{
    "feats":{
        "Acrobatic":{
            "benefit":"<p>You get a +2 bonus on all Acrobatics and Fly skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You are skilled at leaping, jumping, and flying.</p>",
            "name":"Acrobatic",
            "summary":"+2 bonus on Acrobatics and Fly checks",
            "type":"Feat"
        },
        "Acrobatic Steps":{
            "benefit":"<p>Whenever you move, you may move through up to 15 feet of difficult terrain each round as if it were normal terrain. The effects of this feat stack with those provided by Nimble Moves (allowing you to move normally through a total of 20 feet of difficult terrain each round).</p>",
            "description":"<p>You can easily move over and through obstacles.</p>",
            "name":"Acrobatic Steps",
            "requires":[
                "Dex 15",
                "Nimble Moves"
            ],
            "summary":"Ignore 20 feet of difficult terrain when you move",
            "type":"Feat"
        },
        "Agile Maneuvers":{
            "benefit":"<p>You add your Dexterity bonus to your base attack bonus and size bonus when determining your Combat Maneuver Bonus (see Combat Maneuver Bonus.</p>",
            "description":"<p>You've learned to use your quickness in place of brute force when performing combat maneuvers.</p>",
            "featType":"Combat",
            "name":"Agile Maneuvers",
            "summary":"Use your Dex bonus when calculating your CMB",
            "type":"Feat"
        },
        "Alertness":{
            "benefit":"<p>You get a +2 bonus on Perception and Sense Motive skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You often notice things that others might miss.</p>",
            "name":"Alertness",
            "summary":"+2 bonus on Perception and Sense Motive checks",
            "type":"Feat"
        },
        "Alignment Channel":{
            "benefit":"<p>Instead of its normal effect, you can choose to have your ability to channel energy heal or harm outsiders of the chosen alignment subtype. You must make this choice each time you channel energy. If you choose to heal or harm creatures of the chosen alignment subtype, your channel energy has no effect on other creatures. The amount of damage healed or dealt and the DC to halve the damage is otherwise unchanged.</p>",
            "description":"<p>Choose chaos, evil, good, or law. You can channel divine energy to affect outsiders that possess this subtype.</p>",
            "name":"Alignment Channel",
            "requires":[
                "Ability to channel energy"
            ],
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take this feat, it applies to a new alignment subtype. Whenever you channel energy, you must choose which type to effect.</p>",
            "summary":"Channel energy can heal or harm outsiders",
            "type":"Feat"
        },
        "Animal Affinity":{
            "benefit":"<p>You get a +2 bonus on all Handle Animal and Ride skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You are skilled at working with animals and mounts.</p>",
            "name":"Animal Affinity",
            "summary":"+2 bonus on Handle Animal and Ride checks",
            "type":"Feat"
        },
        "Arcane Armor Mastery":{
            "benefit":"<p>As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 20% for any spells you cast this round. This bonus replaces, and does not stack with, the bonus granted by Arcane Armor Training.</p>",
            "description":"<p>You have mastered the ability to cast spells while wearing armor.</p>",
            "featType":"Combat",
            "name":"Arcane Armor Mastery",
            "requires":[
                "Arcane Armor Training",
                "Medium Armor Proficiency",
                "caster level 7th"
            ],
            "summary":"Reduce your arcane spell failure chance by 20%",
            "type":"Feat"
        },
        "Arcane Armor Training":{
            "benefit":"<p>As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 10% for any spells you cast this round.</p>",
            "description":"<p>You have learned how to cast spells while wearing armor.</p>",
            "featType":"Combat",
            "name":"Arcane Armor Training",
            "requires":[
                "Light Armor Proficiency",
                "caster level 3rd"
            ],
            "summary":"Reduce your arcane spell failure chance by 10%",
            "type":"Feat"
        },
        "Arcane Strike":{
            "benefit":"<p>As a swift action, you can imbue your weapons with a fraction of your power. For 1 round, your weapons deal +1 damage and are treated as magic for the purpose of overcoming damage reduction. For every five caster levels you possess, this bonus increases by +1, to a maximum of +5 at 20th level.</p>",
            "description":"<p>You draw upon your arcane power to enhance your weapons with magical energy.</p>",
            "featType":"Combat",
            "name":"Arcane Strike",
            "requires":[
                "Ability to cast arcane spells."
            ],
            "summary":"+1 damage and weapons are considered magic",
            "type":"Feat"
        },
        "Armor Proficiency, Heavy":{
            "benefit":"<p>See Armor Proficiency, Light.</p>",
            "description":"<p>You are skilled at wearing heavy armor.</p>",
            "featType":"Combat",
            "name":"Armor Proficiency, Heavy",
            "normal":"<p>See Armor Proficiency, Light.</p>",
            "requires":[
                "Light Armor Proficiency",
                "Medium Armor Proficiency"
            ],
            "special":"<p>Fighters and paladins automatically have Heavy Armor Proficiency as a bonus feat. They need not select it.</p>",
            "summary":"No penalties on attack rolls while wearing heavy armor",
            "type":"Feat"
        },
        "Armor Proficiency, Light":{
            "benefit":"<p>When you wear a type of armor with which you are proficient, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks.</p>",
            "description":"<p>You are skilled at wearing light armor.</p>",
            "featType":"Combat",
            "name":"Armor Proficiency, Light",
            "normal":"<p>A character who is wearing armor with which he is not proficient applies its armor check penalty to attack rolls and to all skill checks that involve moving.</p>",
            "special":"<p>All characters except monks, sorcerers, and wizards automatically have Light Armor Proficiency as a bonus feat. They need not select it.</p>",
            "summary":"No penalties on attack rolls while wearing light armor",
            "type":"Feat"
        },
        "Armor Proficiency, Medium":{
            "benefit":"<p>See Armor Proficiency, Light.</p>",
            "description":"<p>You are skilled at wearing medium armor.</p>",
            "featType":"Combat",
            "name":"Armor Proficiency, Medium",
            "normal":"<p>See Armor Proficiency, Light.</p>",
            "requires":[
                "Light Armor Proficiency."
            ],
            "special":"<p>Barbarians, clerics, druids, fighters, paladins, and rangers automatically have Medium Armor Proficiency as a bonus feat. They need not select it.</p>",
            "summary":"No penalties on attack rolls while wearing medium armor",
            "type":"Feat"
        },
        "Athletic":{
            "benefit":"<p>You get a +2 bonus on Climb and Swim skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You possess inherent physical prowess.</p>",
            "name":"Athletic",
            "summary":"+2 bonus on Climb and Swim checks",
            "type":"Feat"
        },
        "Augment Summoning":{
            "benefit":"<p>Each creature you conjure with any <i>summon </i>spell gains a +4 enhancement bonus to Strength and Constitution for the duration of the spell that summoned it.</p>",
            "description":"<p>Your summoned creatures are more powerful and robust.</p>",
            "name":"Augment Summoning",
            "requires":[
                "Spell Focus (conjuration)."
            ],
            "summary":"Summoned creatures gain +4 Str and Con",
            "type":"Feat"
        },
        "Bleeding Critical":{
            "benefit":"<p>Whenever you score a critical hit with a slashing or piercing weapon, your opponent takes 2d6 points of bleed damage (see Bleed damage can be stopped by a DC 15 Heal skill check or through any magical healing. The effects of this feat stack.</p>",
            "description":"<p>Your critical hits cause opponents to bleed profusely.</p>",
            "featType":"Combat, Critical",
            "name":"Bleeding Critical",
            "requires":[
                "Critical Focus",
                "base attack bonus +11"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.</p>",
            "summary":"Whenever you score a critical hit, the target takes 2d6 bleed",
            "type":"Feat"
        },
        "Blind-Fight":{
            "benefit":"<p>In melee, every time you miss because of concealment (see invisible attacker gets no advantages related to hitting you in melee. That is, you don't lose your Dexterity bonus to Armor Class, and the attacker doesn't get the usual +2 bonus for being invisible. The invisible attacker's bonuses do still apply for ranged attacks, however.<p>You do not need to make Acrobatics skill checks to move at full speed while blinded.</p></p>",
            "description":"<p>You are skilled at attacking opponents that you cannot clearly perceive.</p>",
            "featType":"Combat",
            "name":"Blind-Fight",
            "normal":"<p>Regular attack roll modifiers for invisible attackers trying to hit you apply, and you lose your Dexterity bonus to AC. The speed reduction for darkness and poor visibility also applies.</p>",
            "special":"<p>The Blind-Fight feat is of no use against a character who is the subject of a <i>blink </i>spell.</p>",
            "summary":"Reroll miss chances for concealment",
            "type":"Feat"
        },
        "Blinding Critical":{
            "benefit":"<p>Whenever you score a critical hit, your opponent is permanently blinded. A successful Fortitude save reduces this to dazzled for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on creatures that do not rely on eyes for sight or creatures with more than two eyes (although multiple critical hits might cause blindness, at the GM's discretion). Blindness can be cured by <i>heal, regeneration, remove blindness, </i>or similar abilities.</p>",
            "description":"<p>Your critical hits blind your opponents.</p>",
            "featType":"Combat, Critical",
            "name":"Blinding Critical",
            "requires":[
                "Critical Focus",
                "base attack bonus +15"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.</p>",
            "summary":"Whenever you score a critical hit, the target is blinded",
            "type":"Feat"
        },
        "Brew Potion":{
            "benefit":"<p>You can create a potion of any 3rd-level or lower spell that you know and that targets one or more creatures or objects. Brewing a potion takes 2 hours if its base price is 250 gp or less, otherwise brewing a potion takes 1 day for each 1,000 gp in its base price. When you create a potion, you set the caster level, which must be sufficient to cast the spell in question and no higher than your own level. To brew a potion, you must use up raw materials costing one half this base price. See the magic item creation rules in flat-footed against any attacks you make with an improvised melee weapon.</p>",
            "description":"<p>You can create magic potions.</p>",
            "featType":"Item Creation",
            "name":"Brew Potion",
            "normal":"<p>You take a –4 penalty on attack rolls made with an improvised weapon.</p>",
            "requires":[
                "Caster level 3rd."
            ],
            "summary":"Create magic potions",
            "type":"Feat"
        },
        "Catch Off-Guard":{
            "benefit":"<p>You do not suffer any penalties for using an improvised melee weapon. Unarmed opponents are flat-footed against any attacks you make with an improvised melee weapon.</p>",
            "description":"<p>Foes are surprised by your skilled use of unorthodox and improvised weapons.</p>",
            "featType":"Combat",
            "name":"Catch Off-Guard",
            "normal":"<p>You take a –4 penalty on attack rolls made with an improvised weapon.</p>",
            "summary":"No penalties for improvised melee weapons",
            "type":"Feat"
        },
        "Channel Smite":{
            "benefit":"<p>Before you make a melee attack roll, you can choose to spend one use of your channel energy ability as a swift action. If you channel positive energy and you hit an undead creature, that creature takes an amount of additional damage equal to the damage dealt by your channel positive energy ability. If you channel negative energy and you hit a living creature, that creature takes an amount of additional damage equal to the damage dealt by your channel negative energy ability. Your target can make a Will save, as normal, to halve this additional damage. If your attack misses, the channel energy ability is still expended with no effect.</p>",
            "description":"<p>You can channel your divine energy through a melee weapon you wield.</p>",
            "featType":"Combat",
            "name":"Channel Smite",
            "requires":[
                "Channel energy class feature."
            ],
            "summary":"Channel energy through your attack",
            "type":"Feat"
        },
        "Cleave":{
            "benefit":"<p>As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the first and also within reach. You can only make one additional attack per round with this feat. When you use this feat, you take a –2 penalty to your Armor Class until your next turn.</p>",
            "description":"<p>You can strike two adjacent foes with a single swing.</p>",
            "featType":"Combat",
            "name":"Cleave",
            "requires":[
                "Str 13",
                "Power Attack",
                "base attack bonus +1"
            ],
            "summary":"Make an additional attack if the first one hits",
            "type":"Feat"
        },
        "Combat Casting":{
            "benefit":"<p>You get a +4 bonus on concentration checks made to cast a spell or use a spell-like ability when casting on the defensive or while grappled.</p>",
            "description":"<p>You are adept at spellcasting when threatened or distracted.</p>",
            "name":"Combat Casting",
            "summary":"+4 bonus on concentration checks for defensive casting",
            "type":"Feat"
        },
        "Combat Expertise":{
            "benefit":"<p>You can choose to take a –1 penalty on melee attack rolls and combat maneuver checks to gain a +1 dodge bonus to your Armor Class. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the dodge bonus increases by +1. You can only choose to use this feat when you declare that you are making an attack or a full-attack action with a melee weapon. The effects of this feat last until your next turn.</p>",
            "description":"<p>You can increase your defense at the expense of your accuracy.</p>",
            "featType":"Combat",
            "name":"Combat Expertise",
            "requires":[
                "Int 13."
            ],
            "summary":"Trade attack bonus for AC bonus",
            "type":"Feat"
        },
        "Combat Reflexes":{
            "benefit":"<p>You may make a number of additional attacks of opportunity per round equal to your Dexterity bonus. With this feat, you may also make attacks of opportunity while flat-footed.</p>",
            "description":"<p>You can make additional attacks of opportunity.</p>",
            "featType":"Combat",
            "name":"Combat Reflexes",
            "normal":"<p>A character without this feat can make only one attack of opportunity per round and can't make attacks of opportunity while flat-footed.</p>",
            "special":"<p>The Combat Reflexes feat does not allow a rogue to use her opportunist ability more than once per round.</p>",
            "summary":"Make additional attacks of opportunity",
            "type":"Feat"
        },
        "Command Undead":{
            "benefit":"<p>As a standard action, you can use one of your uses of channel negative energy to enslave undead within 30 feet. Undead receive a Will save to negate the effect. The DC for this Will save is equal to 10 + 1/2 your cleric level + your Charisma modifier. Undead that fail their saves fall under your control, obeying your commands to the best of their ability, as if under the effects of <i>control undead</i>. Intelligent undead receive a new saving throw each day to resist your command. You can control any number of undead, so long as their total Hit Dice do not exceed your cleric level. If you use channel energy in this way, it has no other effect (it does not heal or harm nearby creatures). If an undead creature is under the control of another creature, you must make an opposed Charisma check whenever your orders conflict.</p>",
            "description":"<p>Using foul powers of necromancy, you can command undead creatures, making them into your servants.</p>",
            "name":"Command Undead",
            "requires":[
                "Channel negative energy class feature"
            ],
            "summary":"Channel energy can be used to control undead",
            "type":"Feat"
        },
        "Craft Magic Arms and Armor":{
            "benefit":"<p>When you score a critical hit, you can apply the effects of two critical feats in addition to the damage dealt.</p>",
            "description":"<p>You can create magic armor, shields, and weapons.</p>",
            "featType":"Item Creation",
            "name":"Craft Magic Arms and Armor",
            "normal":"<p>You can only apply the effects of one critical feat to a given critical hit in addition to the damage dealt.</p>",
            "requires":[
                "Caster level 5th."
            ],
            "summary":"Create magic armors, shields, and weapons",
            "type":"Feat"
        },
        "Craft Rod":{
            "benefit":"<p>You can create magic rods. Crafting a rod takes 1 day for each 1,000 gp in its base price. To craft a rod, you must use up raw materials costing half of its base price. See the magic item creation rules in Magic Items for more information.</p>",
            "description":"<p>You can create magic rods.</p>",
            "featType":"Item Creation",
            "name":"Craft Rod",
            "requires":[
                "Caster level 9th."
            ],
            "summary":"Create magic rods",
            "type":"Feat"
        },
        "Craft Staff":{
            "benefit":"<p>You can create any staff whose prerequisites you meet. Crafting a staff takes 1 day for each 1,000 gp in its base price. To craft a staff, you must use up raw materials costing half of its base price. A newly created staff has 10 charges. See the magic item creation rules in Magic Items for more information.</p>",
            "description":"<p>You can create magic staves.</p>",
            "featType":"Item Creation",
            "name":"Craft Staff",
            "requires":[
                "Caster level 11th."
            ],
            "summary":"Create magic staves",
            "type":"Feat"
        },
        "Craft Wand":{
            "benefit":"<p>You can create a wand of any 4th-level or lower spell that you know. Crafting a wand takes 1 day for each 1,000 gp in its base price. To craft a wand, you must use up raw materials costing half of this base price. A newly created wand has 50 charges. See the magic item creation rules in Magic Items for more information.</p>",
            "description":"<p>You can create magic wands.</p>",
            "featType":"Item Creation",
            "name":"Craft Wand",
            "summary":"Create magic wands",
            "type":"Feat"
        },
        "Craft Wondrous Item":{
            "benefit":"<p>You can create a wide variety of magic wondrous items. Crafting a wondrous item takes 1 day for each 1,000 gp in its price. To create a wondrous item, you must use up raw materials costing half of its base price. See the magic item creation rules in Magic Items for more information.</p><p>You can also mend a broken wondrous item if it is one that you could make. Doing so costs half the raw materials and half the time it would take to craft that item.</p>",
            "description":"<p>You can create wondrous items, a type of magic item.</p>",
            "featType":"Item Creation",
            "name":"Craft Wondrous Item",
            "summary":"Create magic wondrous items",
            "type":"Feat"
        },
        "Critical Focus":{
            "benefit":"<p>You receive a +4 circumstance bonus on attack rolls made to confirm critical hits.</p>",
            "description":"<p>You are trained in the art of causing pain.</p>",
            "featType":"Combat",
            "name":"Critical Focus",
            "requires":[
                "Base attack bonus +9"
            ],
            "summary":"+4 bonus on attack rolls made to confirm critical hits",
            "type":"Feat"
        },
        "Critical Mastery":{
            "benefit":"<p>When you score a critical hit, you can apply the effects of two critical feats in addition to the damage dealt.</p>",
            "description":"<p>Your critical hits cause two additional effects.</p>",
            "featType":"Combat",
            "name":"Critical Mastery",
            "normal":"<p>You can only apply the effects of one critical feat to a given critical hit in addition to the damage dealt.</p>",
            "requires":[
                "Critical Focus",
                "any two critical feats",
                "14th-level fighter."
            ],
            "summary":"Apply two effects to your critical hits",
            "type":"Feat"
        },
        "Dazzling Display":{
            "benefit":"<p>While wielding the weapon in which you have Weapon Focus, you can perform a bewildering show of prowess as a full-round action. Make an Intimidate check to demoralize all foes within 30 feet who can see your display. </p>",
            "description":"<p>Your skill with your favored weapon can frighten enemies.</p>",
            "featType":"Combat",
            "name":"Dazzling Display",
            "requires":[
                "Weapon Focus",
                "proficiency with the selected weapon."
            ],
            "summary":"Intimidate all foes within 30 feet",
            "type":"Feat"
        },
        "Deadly Aim":{
            "benefit":"<p>You can choose to take a –1 penalty on all ranged attack rolls to gain a +2 bonus on all ranged damage rolls. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.</p>",
            "description":"<p>You can make exceptionally deadly ranged attacks by pinpointing a foe's weak spot, at the expense of making the attack less likely to succeed.</p>",
            "featType":"Combat",
            "name":"Deadly Aim",
            "requires":[
                "Dex 13",
                "base attack bonus +1"
            ],
            "summary":"Trade ranged attack bonus for damage",
            "type":"Feat"
        },
        "Deadly Stroke":{
            "benefit":"<p>As a standard action, make a single attack with the weapon for which you have Greater Weapon Focus against a stunned or flat-footed opponent. If you hit, you deal double the normal damage and the target takes 1 point of Constitution bleed (see bleed is not multiplied on a critical hit.</p>",
            "description":"<p>With a well-placed strike, you can bring a swift and painful end to most foes.</p>",
            "featType":"Combat",
            "name":"Deadly Stroke",
            "requires":[
                "Dazzling Display",
                "Greater Weapon Focus, Shatter Defenses, Weapon Focus",
                "proficiency with the selected weapon",
                "base attack bonus +11"
            ],
            "summary":"Deal double damage plus 1 Con bleed",
            "type":"Feat"
        },
        "Deafening Critical":{
            "benefit":"<p>Whenever you score a critical hit against an opponent, the victim is permanently deafened. A successful Fortitude save reduces the deafness to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on deaf creatures. This deafness can be cured by <i>heal, regeneration, remove deafness, </i>or a similar ability.</p>",
            "description":"<p>Your critical hits cause enemies to lose their hearing.</p>",
            "featType":"Combat, Critical",
            "name":"Deafening Critical",
            "requires":[
                "Critical Focus",
                "base attack bonus +13"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.</p>",
            "summary":"Whenever you score a critical hit, the target is deafened",
            "type":"Feat"
        },
        "Deceitful":{
            "benefit":"<p>You get a +2 bonus on all Bluff and Disguise skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You are skilled at deceiving others, both with the spoken word and with physical disguises.</p>",
            "name":"Deceitful",
            "summary":"+2 bonus on Bluff and Disguise checks",
            "type":"Feat"
        },
        "Defensive Combat Training":{
            "benefit":"<p>You must have at least one hand free (holding nothing) to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon, you may deflect it so that you take no damage from it. You must be aware of the attack and not flat-footed. Attempting to deflect a ranged attack doesn't count as an action. Unusually massive ranged weapons (such as boulders or ballista bolts) and ranged attacks generated by natural attacks or spell effects can't be deflected.</p>",
            "description":"<p>You excel at defending yourself from all manner of combat maneuvers.</p>",
            "featType":"Combat",
            "name":"Defensive Combat Training",
            "summary":"Use your total Hit Dice as your base attack bonus for CMD",
            "type":"Feat"
        },
        "Deflect Arrows":{
            "benefit":"<p>You must have at least one hand free (holding nothing) to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon, you may deflect it so that you take no damage from it. You must be aware of the attack and not flat-footed. Attempting to deflect a ranged attack doesn't count as an action. Unusually massive ranged weapons (such as boulders or ballista bolts) and ranged attacks generated by natural attacks or spell effects can't be deflected.</p>",
            "description":"<p>You can knock arrows and other projectiles off course, preventing them from hitting you.</p>",
            "featType":"Combat",
            "name":"Deflect Arrows",
            "requires":[
                "Dex 13",
                "Improved Unarmed Strike."
            ],
            "summary":"Avoid one ranged attack per round",
            "type":"Feat"
        },
        "Deft Hands":{
            "benefit":"<p>You get a +2 bonus on Disable Device and Sleight of Hand skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You have exceptional manual dexterity.</p>",
            "name":"Deft Hands",
            "summary":"+2 bonus on Disable Device and Sleight of Hand checks",
            "type":"Feat"
        },
        "Diehard":{
            "benefit":"<p>When your hit point total is below 0, but you are not dead, you automatically stabilize. You do not need to make a Constitution check each round to avoid losing additional hit points. You may choose to act as if you were disabled, rather than dying. You must make this decision as soon as you are reduced to negative hit points (even if it isn't your turn). If you do not choose to act as if you were disabled, you immediately fall unconscious.<p>When using this feat, you are staggered. You can take a move action without further injuring yourself, but if you perform any standard action (or any other action deemed as strenuous, including some swift actions, such as casting a quickened spell) you take 1 point of damage after completing the act. If your negative hit points are equal to or greater than your Constitution score, you immediately die.</p></p>",
            "description":"<p>You are especially hard to kill. Not only do your wounds automatically stabilize when grievously injured, but you can remain conscious and continue to act even at death's door.</p>",
            "name":"Diehard",
            "normal":"<p>A character without this feat who is reduced to negative hit points is unconscious and dying.</p>",
            "requires":[
                "Endurance."
            ],
            "summary":"Automatically stabilize and remain conscious below 0 hp",
            "type":"Feat"
        },
        "Disruptive":{
            "benefit":"<p>The DC to cast spells defensively increases by +4 for all enemies that are within your threatened area. This increase to casting spells defensively only applies if you are aware of the enemy's location and are capable of taking an attack of opportunity. If you can only take one attack of opportunity per round and have already used that attack, this increase does not apply.</p>",
            "description":"<p>Your training makes it difficult for enemy spellcasters to safely cast spells near you.</p>",
            "featType":"Combat",
            "name":"Disruptive",
            "requires":[
                "6th-level fighter"
            ],
            "summary":"Increases the DC to cast spells adjacent to you",
            "type":"Feat"
        },
        "Dodge":{
            "benefit":"<p>You gain a +1 dodge bonus to your AC. A condition that makes you lose your Dex bonus to AC also makes you lose the benefits of this feat.</p>",
            "description":"<p>Your training and reflexes allow you to react swiftly to avoid an opponents' attacks.</p>",
            "featType":"Combat",
            "name":"Dodge",
            "requires":[
                "Dex 13."
            ],
            "summary":"+1 dodge bonus to AC",
            "type":"Feat"
        },
        "Double Slice":{
            "benefit":"<p>Add your Strength bonus to damage rolls made with your off-hand weapon.</p>",
            "description":"<p>Your off-hand weapon while dual-wielding strikes with greater power.</p>",
            "featType":"Combat",
            "name":"Double Slice",
            "normal":"<p>You normally add only half of your Strength modifier to damage rolls made with a weapon wielded in your off-hand.</p>",
            "requires":[
                "Dex 15",
                "Two-Weapon Fighting."
            ],
            "summary":"Add your Str bonus to off-hand damage rolls",
            "type":"Feat"
        },
        "Elemental Channel":{
            "benefit":"<p>Instead of its normal effect, you can choose to have your ability to channel energy heal or harm outsiders of your chosen elemental subtype. You must make this choice each time you channel energy. If you choose to heal or harm creatures of your elemental subtype, your channel energy has no effect on other creatures. The amount of damage healed or dealt and the DC to halve the damage is otherwise unchanged.</p>",
            "description":"<p>Choose one elemental subtype, such as air, earth, fire, or water. You can channel your divine energy to harm or heal outsiders that possess your chosen elemental subtype.</p>",
            "name":"Elemental Channel",
            "requires":[
                "Channel energy class feature"
            ],
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take this feat, it applies to a new elemental subtype.</p>",
            "summary":"Channel energy can harm or heal elementals",
            "type":"Feat"
        },
        "Empower Spell":{
            "benefit":"<p>All variable, numeric effects of an empowered spell are increased by half, including bonuses to those dice rolls.<p>Saving throws and opposed rolls are not affected, nor are spells without random variables. An empowered spell uses up a spell slot two levels higher than the spell's actual level.</p></p>",
            "description":"<p>You can increase the power of your spells, causing them to deal more damage.</p>",
            "featType":"Metamagic",
            "name":"Empower Spell",
            "summary":"Increase spell variables by 50%",
            "type":"Feat"
        },
        "Endurance":{
            "benefit":"<p>You gain a +4 bonus on the following checks and saves: Swim checks made to resist nonlethal damage from exhaustion; Constitution checks made to continue running; Constitution checks made to avoid nonlethal damage from a forced march; Constitution checks made to hold your breath; Constitution checks made to avoid nonlethal damage from starvation or thirst; Fortitude saves made to avoid nonlethal damage from hot or cold environments; and Fortitude saves made to resist damage from suffocation.<p>You may sleep in light or medium armor without becoming fatigued.</p></p>",
            "description":"<p>Harsh conditions or long exertions do not easily tire you.</p>",
            "name":"Endurance",
            "normal":"<p>A character without this feat who sleeps in medium or heavier armor is fatigued the next day.</p>",
            "summary":"+4 bonus on checks to avoid nonlethal damage",
            "type":"Feat"
        },
        "Enlarge Spell":{
            "benefit":"<p>You can alter a spell with a range of close, medium, or long to increase its range by 100%. An enlarged spell with a range of close now has a range of 50 ft. + 5 ft./level, while medium-range spells have a range of 200 ft. + 20 ft./level and long-range spells have a range of 800 ft. + 80 ft./level. An enlarged spell uses up a spell slot one level higher than the spell's actual level.<p>Spells whose ranges are not defined by distance, as well as spells whose ranges are not close, medium, or long, do not benefit from this feat.</p></p>",
            "description":"<p>You can increase the range of your spells.</p>",
            "featType":"Metamagic",
            "name":"Enlarge Spell",
            "summary":"Double spell range",
            "type":"Feat"
        },
        "Eschew Materials":{
            "benefit":"<p>You can cast any spell with a material component costing 1 gp or less without needing that component. The casting of the spell still provokes attacks of opportunity as normal. If the spell requires a material component that costs more than 1 gp, you must have the material component on hand to cast the spell, as normal.</p>",
            "description":"<p>You can cast many spells without needing to utilize minor material components.</p>",
            "name":"Eschew Materials",
            "summary":"Cast spells without material components",
            "type":"Feat"
        },
        "Exhausting Critical":{
            "benefit":"<p>When you score a critical hit on a foe, your target immediately becomes exhausted. This feat has no effect on exhausted creatures.</p>",
            "description":"<p>Your critical hits cause opponents to become exhausted.</p>",
            "featType":"Combat, Critical",
            "name":"Exhausting Critical",
            "requires":[
                "Critical Focus",
                "Tiring Critical",
                "base attack bonus +15"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess the Critical Mastery feat.</p>",
            "summary":"Whenever you score a critical hit, the target is exhausted",
            "type":"Feat"
        },
        "Exotic Weapon Proficiency":{
            "benefit":"<p>You make attack rolls with the weapon normally.</p>",
            "description":"<p>Choose one type of exotic weapon, such as the spiked chain or whip. You understand how to use that type of exotic weapon in combat, and can utilize any special tricks or qualities that exotic weapon might allow.</p>",
            "featType":"Combat",
            "name":"Exotic Weapon Proficiency",
            "normal":"<p>A character who uses a weapon with which he is not proficient takes a –4 penalty on attack rolls.</p>",
            "requires":[
                "Base attack bonus +1."
            ],
            "special":"<p>You can gain Exotic Weapon Proficiency multiple times. Each time you take the feat, it applies to a new type of exotic weapon. </p>",
            "summary":"No penalty on attacks made with one exotic weapon",
            "type":"Feat"
        },
        "Extend Spell":{
            "benefit":"<p>An extended spell lasts twice as long as normal. A spell with a duration of concentration, instantaneous, or permanent is not affected by this feat. An extended spell uses up a spell slot one level higher than the spell's actual level.</p>",
            "description":"<p>You can make your spells last twice as long.</p>",
            "featType":"Metamagic",
            "name":"Extend Spell",
            "summary":"Double spell duration",
            "type":"Feat"
        },
        "Extra Channel":{
            "benefit":"<p>You can channel energy two additional times per day.</p>",
            "description":"<p>You can channel divine energy more often.</p>",
            "name":"Extra Channel",
            "requires":[
                "Channel energy class feature."
            ],
            "special":"<p>If a paladin with the ability to channel positive energy takes this feat, she can use lay on hands four additional times a day, but only to channel positive energy.</p>",
            "summary":"Channel energy two additional times per day",
            "type":"Feat"
        },
        "Extra Ki":{
            "benefit":"<p>Your <i>ki </i>pool increases by 2. </p>",
            "description":"<p>You can use your ki pool more times per day than most.</p>",
            "name":"Extra Ki",
            "requires":[
                "Ki pool class feature."
            ],
            "special":"<p>You can gain Extra Ki multiple times. Its effects stack.</p>",
            "summary":"Increase your ki pool by 2 points",
            "type":"Feat"
        },
        "Extra Lay On Hands":{
            "benefit":"<p>You can use your lay on hands ability two additional times per day. </p>",
            "description":"<p>You can use your lay on hands ability more often.</p>",
            "name":"Extra Lay On Hands",
            "requires":[
                "Lay on hands class feature."
            ],
            "special":"<p>You can gain Extra Lay On Hands multiple times. Its effects stack.</p>",
            "summary":"Use lay on hands two additional times per day",
            "type":"Feat"
        },
        "Extra Mercy":{
            "benefit":"<p>Select one additional mercy for which you qualify. When you use lay on hands to heal damage to one target, it also receives the additional effects of this mercy.</p>",
            "description":"<p>Your lay on hands ability adds an additional mercy.</p>",
            "name":"Extra Mercy",
            "requires":[
                "Lay on hands class feature",
                "mercy class feature"
            ],
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take this feat, select a new mercy. </p>",
            "summary":"Your lay on hands benefits from one additional mercy",
            "type":"Feat"
        },
        "Extra Performance":{
            "benefit":"<p>You can use bardic performance for 6 additional rounds per day.</p>",
            "description":"<p>You can use your bardic performance ability more often than normal.</p>",
            "name":"Extra Performance",
            "requires":[
                "Bardic performance class feature."
            ],
            "special":"<p>You can gain Extra Performance multiple times. Its effects stack.</p>",
            "summary":"Use bardic performance for 6 additional rounds per day",
            "type":"Feat"
        },
        "Extra Rage":{
            "benefit":"<p>You can rage for 6 additional rounds per day.</p>",
            "description":"<p>You can use your rage ability more than normal.</p>",
            "name":"Extra Rage",
            "requires":[
                "Rage class feature."
            ],
            "special":"<p>You can gain Extra Rage multiple times. Its effects stack.</p>",
            "summary":"Use rage for 6 additional rounds per day",
            "type":"Feat"
        },
        "Far Shot":{
            "benefit":"<p>You only suffer a –1 penalty per full range increment between you and your target when using a ranged weapon.</p>",
            "description":"<p>You are more accurate at longer ranges.</p>",
            "featType":"Combat",
            "name":"Far Shot",
            "normal":"<p>You suffer a –2 penalty per full range increment between you and your target.</p>",
            "requires":[
                "Point-Blank Shot"
            ],
            "summary":"Decrease ranged penalties by half",
            "type":"Feat"
        },
        "Fleet":{
            "benefit":"<p>While you are wearing light or no armor, your base speed increases by 5 feet. You lose the benefits of this feat if you carry a medium or heavy load.</p>",
            "description":"<p>You are faster than most.</p>",
            "name":"Fleet",
            "special":"<p>You can take this feat multiple times. The effects stack. </p>",
            "summary":"Your base speed increases by 5 feet",
            "type":"Feat"
        },
        "Forge Ring":{
            "benefit":"<p>As a standard action, make a single unarmed melee attack against a foe whose speed is reduced (such as from Scorpion Style). If the attack hits, you deal damage normally and the target is staggered until the end of your next turn unless it makes a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier). This feat has no effect on targets that are staggered.</p>",
            "description":"<p>You can create magic rings.</p>",
            "featType":"Item Creation",
            "name":"Forge Ring",
            "requires":[
                "Caster level 7th."
            ],
            "summary":"Create magic rings",
            "type":"Feat"
        },
        "Gorgon's Fist":{
            "benefit":"<p>As a standard action, make a single unarmed melee attack against a foe whose speed is reduced (such as from Scorpion Style). If the attack hits, you deal damage normally and the target is staggered until the end of your next turn unless it makes a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier). This feat has no effect on targets that are staggered.</p>",
            "description":"<p>With one well-placed blow, you leave your target reeling.</p>",
            "featType":"Combat",
            "name":"Gorgon's Fist",
            "requires":[
                "Improved Unarmed Strike",
                "Scorpion Style",
                "base attack bonus +6."
            ],
            "summary":"Stagger a foe whose speed is reduced",
            "type":"Feat"
        },
        "Great Cleave":{
            "benefit":"<p>As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the previous foe and also within reach. If you hit, you can continue to make attacks against foes adjacent to the previous foe, so long as they are within your reach. You cannot attack an individual foe more than once during this attack action. When you use this feat, you take a –2 penalty to your Armor Class until your next turn.</p>",
            "description":"<p>You can strike many adjacent foes with a single blow.</p>",
            "featType":"Combat",
            "name":"Great Cleave",
            "requires":[
                "Str 13",
                "Cleave",
                "Power Attack",
                "base attack bonus +4"
            ],
            "summary":"Make an additional attack after each attack hits",
            "type":"Feat"
        },
        "Great Fortitude":{
            "benefit":"<p>You get a +2 bonus on all Fortitude saving throws.</p>",
            "description":"<p>You are resistant to poisons, diseases, and other maladies.</p>",
            "name":"Great Fortitude",
            "summary":"+2 on Fortitude saves",
            "type":"Feat"
        },
        "Greater Bull Rush":{
            "benefit":"<p>You receive a +2 bonus on checks made to bull rush a foe. This bonus stacks with the bonus granted by Improved Bull Rush. Whenever you bull rush an opponent, his movement provokes attacks of opportunity from all of your allies (but not you).</p>",
            "description":"<p>Your bull rush attacks throw enemies off balance.</p>",
            "featType":"Combat",
            "name":"Greater Bull Rush",
            "normal":"<p>Creatures moved by bull rush do not provoke attacks of opportunity.</p>",
            "requires":[
                "Improved Bull Rush",
                "Power Attack",
                "base attack bonus +6",
                "Str 13"
            ],
            "summary":"Enemies you bull rush provoke attacks of opportunity",
            "type":"Feat"
        },
        "Greater Disarm":{
            "benefit":"<p>You receive a +2 bonus on checks made to disarm a foe. This bonus stacks with the bonus granted by Improved Disarm. Whenever you successfully disarm an opponent, the weapon lands 15 feet away from its previous wielder, in a random direction.</p>",
            "description":"<p>You can knock weapons far from an enemy's grasp.</p>",
            "featType":"Combat",
            "name":"Greater Disarm",
            "normal":"<p>Disarmed weapons and gear land at the feet of the disarmed creature.</p>",
            "requires":[
                "Combat Expertise",
                "Improved Disarm",
                "base attack bonus +6",
                "Int 13"
            ],
            "summary":"Disarmed weapons are knocked away from your enemy",
            "type":"Feat"
        },
        "Greater Feint":{
            "benefit":"<p>Whenever you use feint to cause an opponent to lose his Dexterity bonus, he loses that bonus until the beginning of your next turn, in addition to losing his Dexterity bonus against your next attack.</p>",
            "description":"<p>You are skilled at making foes overreact to your attacks.</p>",
            "featType":"Combat",
            "name":"Greater Feint",
            "normal":"<p>A creature you feint loses its Dexterity bonus against your next attack.</p>",
            "requires":[
                "Combat Expertise",
                "Improved Feint",
                "base attack bonus +6",
                "Int 13"
            ],
            "summary":"Enemies you feint lose their Dex bonus for 1 round",
            "type":"Feat"
        },
        "Greater Grapple":{
            "benefit":"<p>You receive a +2 bonus on checks made to grapple a foe. This bonus stacks with the bonus granted by Improved Grapple. Once you have grappled a creature, maintaining the grapple is a move action. This feat allows you to make two grapple checks each round (to move, harm, or pin your opponent), but you are not required to make two checks. You only need to succeed at one of these checks to maintain the grapple.</p>",
            "description":"<p>Maintaining a grapple is second nature to you.</p>",
            "featType":"Combat",
            "name":"Greater Grapple",
            "normal":"<p>Maintaining a grapple is a standard action.</p>",
            "requires":[
                "Improved Grapple",
                "Improved Unarmed Strike",
                "base attack bonus +6",
                "Dex 13"
            ],
            "summary":"Maintain your grapple as a move action",
            "type":"Feat"
        },
        "Greater Overrun":{
            "benefit":"<p>You receive a +2 bonus on checks made to overrun a foe. This bonus stacks with the bonus granted by Improved Overrun. Whenever you overrun opponents, they provoke attacks of opportunity if they are knocked prone by your overrun.</p>",
            "description":"<p>Enemies must dive to avoid your dangerous move.</p>",
            "featType":"Combat",
            "name":"Greater Overrun",
            "normal":"<p>Creatures knocked prone by your overrun do not provoke an attack of opportunity.</p>",
            "requires":[
                "Improved Overrun",
                "Power Attack",
                "base attack bonus +6",
                "Str 13"
            ],
            "summary":"Enemies you overrun provoke attacks of opportunity",
            "type":"Feat"
        },
        "Greater Penetrating Strike":{
            "benefit":"<p>Your attacks with weapons selected with Weapon Focus ignore up to 10 points of damage reduction. This amount is reduced to 5 points for damage reduction without a type (such as DR 10/—).</p>",
            "description":"<p>Your attacks penetrate the defenses of most foes. </p>",
            "featType":"Combat",
            "name":"Greater Penetrating Strike",
            "requires":[
                "Penetrating Strike",
                "Weapon Focus",
                "16th-level fighter"
            ],
            "summary":"Your attacks ignore 10 points of damage reduction",
            "type":"Feat"
        },
        "Greater Shield Focus":{
            "benefit":"<p>Increase the AC bonus granted by any shield you are using by 1. This bonus stacks with the bonus granted by Shield Focus.</p>",
            "description":"<p>You are skilled at deflecting blows with your shield.</p>",
            "featType":"Combat",
            "name":"Greater Shield Focus",
            "requires":[
                "Shield Focus",
                "Shield Proficiency, base attack bonus +1",
                "8th-level fighter"
            ],
            "summary":"Gain a +1 bonus to your AC when using a shield",
            "type":"Feat"
        },
        "Greater Spell Focus":{
            "benefit":"<p>Add +1 to the Difficulty Class for all saving throws against spells from the school of magic you select. This bonus stacks with the bonus from Spell Focus.</p>",
            "description":"<p>Choose a school of magic to which you have already applied the Spell Focus feat. Any spells you cast of this school are very hard to resist. </p>",
            "name":"Greater Spell Focus",
            "requires":[
                "Spell Focus."
            ],
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new school to which you already have applied the Spell Focus feat.</p>",
            "summary":"+1 bonus on save DCs for one school",
            "type":"Feat"
        },
        "Greater Spell Penetration":{
            "benefit":"<p>You get a +2 bonus on caster level checks (1d20 + caster level) made to overcome a creature's spell resistance. This bonus stacks with the one from Spell Penetration.</p>",
            "description":"<p>Your spells break through spell resistance much more easily than most.</p>",
            "name":"Greater Spell Penetration",
            "requires":[
                "Spell Penetration."
            ],
            "summary":"+2 bonus on level checks to beat spell resistance",
            "type":"Feat"
        },
        "Greater Sunder":{
            "benefit":"<p>You receive a +2 bonus on checks made to sunder an item. This bonus stacks with the bonus granted by Improved Sunder. Whenever you sunder to destroy a weapon, shield, or suit of armor, any excess damage is applied to the item's wielder. No damage is transferred if you decide to leave the item with 1 hit point.</p>",
            "description":"<p>Your devastating strikes cleave through weapons and armor and into their wielders, damaging both item and wielder alike in a single terrific strike.</p>",
            "featType":"Combat",
            "name":"Greater Sunder",
            "requires":[
                "Improved Sunder",
                "Power Attack",
                "base attack bonus +6",
                "Str 13"
            ],
            "summary":"Damage from sunder attempts transfers to your enemy",
            "type":"Feat"
        },
        "Greater Trip":{
            "benefit":"<p>You receive a +2 bonus on checks made to trip a foe. This bonus stacks with the bonus granted by Improved Trip. Whenever you successfully trip an opponent, that opponent provokes attacks of opportunity.</p>",
            "description":"<p>You can make free attacks on foes that you knock down.</p>",
            "featType":"Combat",
            "name":"Greater Trip",
            "normal":"<p>Creatures do not provoke attacks of opportunity from being tripped.</p>",
            "requires":[
                "Combat Expertise",
                "Improved Trip",
                "base attack bonus +6",
                "Int 13"
            ],
            "summary":"Enemies you trip provoke attacks of opportunity",
            "type":"Feat"
        },
        "Greater Two-Weapon Fighting":{
            "benefit":"<p>You get a third attack with your off-hand weapon, albeit at a –10 penalty.</p>",
            "description":"<p>You are incredibly skilled at fighting with two weapons at the same time.</p>",
            "featType":"Combat",
            "name":"Greater Two-Weapon Fighting",
            "requires":[
                "Dex 19",
                "Improved Two-Weapon Fighting",
                "Two-Weapon Fighting",
                "base attack bonus +11"
            ],
            "summary":"Gain a third off-hand attack",
            "type":"Feat"
        },
        "Greater Vital Strike":{
            "benefit":"<p>You gain a +1 bonus on attack rolls you make using the selected weapon. This bonus stacks with other bonuses on attack rolls, including those from Weapon Focus.</p>",
            "description":"<p>You can make a single attack that deals incredible damage.</p>",
            "featType":"Combat",
            "name":"Greater Vital Strike",
            "requires":[
                "Proficiency with selected weapon",
                "Weapon Focus with selected weapon",
                "base attack bonus +1",
                "8th-level fighter"
            ],
            "special":"<p>You can gain Greater Weapon Focus multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon.</p>",
            "summary":"Deal four times the normal damage on a single attack",
            "type":"Feat"
        },
        "Greater Weapon Focus":{
            "benefit":"<p>You gain a +1 bonus on attack rolls you make using the selected weapon. This bonus stacks with other bonuses on attack rolls, including those from Weapon Focus.</p>",
            "description":"<p>Choose one type of weapon (including unarmed strike or grapple) for which you have already selected Weapon Focus. You are a master at your chosen weapon.</p>",
            "featType":"Combat",
            "name":"Greater Weapon Focus",
            "requries":[
                "Proficiency with selected weapon",
                "Weapon Focus with selected weapon",
                "base attack bonus +1",
                "8th-level fighter."
            ],
            "special":"<p>You can gain Greater Weapon Focus multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon.</p>",
            "summary":"+1 bonus on attack rolls with one weapon",
            "type":"Feat"
        },
        "Greater Weapon Specialization":{
            "benefit":"<p>You gain a +2 bonus on all damage rolls you make using the selected weapon. This bonus to damage stacks with other damage roll bonuses, including any you gain from Weapon Specialization.</p>",
            "description":"<p>Choose one type of weapon (including unarmed strike or grapple) for which you possess the Weapon Specialization feat. Your attacks with the chosen weapon are more devastating than normal.",
            "featType":"Combat",
            "name":"Greater Weapon Specialization",
            "requires":[
                "Proficiency with selected weapon",
                "Greater Weapon Focus with selected weapon",
                "Weapon Focus with selected weapon",
                "Weapon Specialization with selected weapon",
                "12th-level fighter"
            ],
            "special":"<p>You can gain Greater Weapon Specialization multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon.</p>",
            "summary":"+2 bonus on damage rolls with one weapon",
            "type":"Feat"
        },
        "Heighten Spell":{
            "benefit":"<p>A heightened spell has a higher spell level than normal (up to a maximum of 9th level). Unlike other metamagic feats, Heighten Spell actually increases the effective level of the spell that it modifies. All effects dependent on spell level (such as saving throw DCs and ability to penetrate a <i>lesser globe of invulnerability</i>) are calculated according to the heightened level. The heightened spell is as difficult to prepare and cast as a spell of its effective level. </p>",
            "description":"<p>You can cast spells as if they were a higher level.</p>",
            "featType":"Metamagic",
            "name":"Heighten Spell",
            "summary":"Treat spell as a higher level",
            "type":"Feat"
        },
        "Improved Bull Rush":{
            "benefit":"<p>You do not provoke an attack of opportunity when performing a bull rush combat maneuver. In addition, you receive a +2 bonus on checks made to bull rush a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to bull rush you.</p>",
            "description":"<p>You are skilled at pushing your foes around.</p>",
            "featType":"Combat",
            "name":"Improved Bull Rush",
            "normal":"<p>You provoke an attack of opportunity when performing a bull rush combat maneuver.</p>",
            "requires":[
                "Str 13",
                "Power Attack",
                "base attack bonus +1."
            ],
            "summary":"+2 bonus on bull rush attempts, no attack of opportunity",
            "type":"Feat"
        },
        "Improved Channel":{
            "benefit":"<p>Add 2 to the DC of saving throws made to resist the effects of your channel energy ability. </p>",
            "description":"<p>Your channeled energy is harder to resist.</p>",
            "name":"Improved Channel",
            "requires":[
                "Channel energy class feature."
            ],
            "summary":"+2 bonus on channel energy DC",
            "type":"Feat"
        },
        "Improved Counterspell":{
            "benefit":"<p>When counterspelling, you may use a spell of the same school that is one or more spell levels higher than the target spell.</p>",
            "description":"<p>You are skilled at countering the spells of others using similar spells.</p>",
            "name":"Improved Counterspell",
            "normal":"<p>Without this feat, you may counter a spell only with the same spell or with a spell specifically designated as countering the target spell.</p>",
            "summary":"Counterspell with spell of the same school",
            "type":"Feat"
        },
        "Improved Critical":{
            "benefit":"<p>When using the weapon you selected, your threat range is doubled.</p>",
            "description":"<p>Attacks made with your chosen weapon are quite deadly.</p>",
            "featType":"Combat",
            "name":"Improved Critical",
            "requires":[
                "Proficient with weapon",
                "base attack bonus +8."
            ],
            "special":"<p>You can gain Improved Critical multiple times. The effects do not stack. Each time you take the feat, it applies to a new type of weapon.<p>This effect doesn't stack with any other effect that expands the threat range of a weapon.</p></p>",
            "summary":"Double the threat range of one weapon",
            "type":"Feat"
        },
        "Improved Disarm":{
            "benefit":"<p>You do not provoke an attack of opportunity when performing a disarm combat maneuver. In addition, you receive a +2 bonus on checks made to disarm a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to disarm you.</p>",
            "description":"<p>You are skilled at knocking weapons from a foe's grasp.</p>",
            "featType":"Combat",
            "name":"Improved Disarm",
            "normal":"<p>You provoke an attack of opportunity when performing a disarm combat maneuver.</p>",
            "requires":[
                "Int 13",
                "Combat Expertise."
            ],
            "summary":"+2 bonus on disarm attempts, no attack of opportunity",
            "type":"Feat"
        },
        "Improved Familiar":{
            "benefit":"<p>When choosing a familiar, the creatures listed below are also available to you. You may choose a familiar with an alignment up to one step away on each alignment axis (lawful through chaotic, good through evil).</p><table><thead><tr><th>Familiar</th><th>Alignment</th><th>Arcane Spellcaster Level</th></tr></thead><tr><td>Celestial hawk<sup>1</sup></td><td>Neutral good</td><td>3rd</td></tr><tr><td>Dire rat</td><td>Neutral</td><td>3rd</td></tr><tr><td>Fiendish viper<sup>2</sup></td><td>Neutral evil</td><td>3rd</td></tr><tr><td>Elemental, Small (any type)</td><td>Neutral</td><td>5th</td></tr><tr><td>Stirge</td><td>Neutral</td><td>5th</td></tr><tr><td>Homunculus<sup>3</sup></td><td>Any</td><td>7th</td></tr><tr><td>Imp</td><td>Lawful evil</td><td>7th</td></tr><tr><td>Mephit (any type)</td><td>Neutral</td><td>7th</td></tr><tr><td>Pseudodragon</td><td>Neutral good</td><td>7th</td></tr><tr><td>Quasit</td><td>Chaotic evil</td><td>7th</td></tr><tfoot><tr><td colspan='3'>1 Or other celestial animal from the standard familiar list.</th></tr><tr><td colspan='3'>2 Or other fiendish animal from the standard familiar list.</th></tr><tr><td colspan='3'>3 The master must first create the homunculus.</th></tr></tfoot></table><p>Improved familiars otherwise use the rules for regular familiars<i>, </i>with two exceptions: if the creature's type is something other than animal, its type does not change; and improved familiars do not gain the ability to speak with other creatures of their kind (although many of them already have the ability to communicate).</p>",
            "description":"<p>This feat allows you to acquire a powerful familiar, but only when you could normally acquire a new familiar.</p>",
            "name":"Improved Familiar",
            "requires":[
                "Ability to acquire a new familiar",
                "compatible alignment",
                "sufficiently high level (see below)"
            ],
            "summary":"Gain a more powerful familiar",
            "type":"Feat"
        },
        "Improved Feint":{
            "benefit":"<p>You can make a Bluff check to feint in combat as a move action.</p>",
            "description":"<p>You are skilled at fooling your opponents in combat.</p>",
            "featType":"Combat",
            "name":"Improved Feint",
            "normal":"<p>Feinting in combat is a standard action.</p>",
            "requires":[
                "Int 13",
                "Combat Expertise"
            ],
            "summary":"Feint as a move action",
            "type":"Feat"
        },
        "Improved Grapple":{
            "benefit":"<p>You do not provoke an attack of opportunity when performing a grapple combat maneuver. In addition, you receive a +2 bonus on checks made to grapple a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to grapple you.</p>",
            "description":"<p>You are skilled at grappling opponents.</p>",
            "featType":"Combat",
            "name":"Improved Grapple",
            "normal":"<p>You provoke an attack of opportunity when performing a grapple combat maneuver.</p>",
            "requires":[
                "Dex 13",
                "Improved Unarmed Strike."
            ],
            "summary":"+2 bonus on grapple attempts, no attack of opportunity",
            "type":"Feat"
        },
        "Improved Great Fortitude":{
            "benefit":"<p>Once per day, you may reroll a Fortitude save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse.</p>",
            "description":"<p>You can draw upon an inner reserve to resist diseases, poisons, and other grievous harm.</p>",
            "name":"Improved Great Fortitude",
            "requires":[
                "Great Fortitude"
            ],
            "summary":"Once per day, you may reroll a Fortitude save",
            "type":"Feat"
        },
        "Improved Initiative":{
            "benefit":"<p>You get a +4 bonus on initiative checks.</p>",
            "description":"<p>Your quick reflexes allow you to react rapidly to danger.</p>",
            "featType":"Combat",
            "name":"Improved Initiative",
            "summary":"+4 bonus on initiative checks",
            "type":"Feat"
        },
        "Improved Iron Will":{
            "benefit":"<p>Once per day, you may reroll a Will save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse.</p>",
            "description":"<p>Your clarity of thought allows you to resist mental attacks.</p>",
            "name":"Improved Iron Will",
            "requires":[
                "Iron Will"
            ],
            "summary":"Once per day, you may reroll a Will save",
            "type":"Feat"
        },
        "Improved Lightning Reflexes":{
            "benefit":"<p>Once per day, you may reroll a Reflex save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse.</p>",
            "description":"<p>You have a knack for avoiding danger all around you.</p>",
            "name":"Improved Lightning Reflexes",
            "requires":[
                "Lightning Reflexes"
            ],
            "summary":"Once per day, you may reroll a Reflex save",
            "type":"Feat"
        },
        "Improved Overrun":{
            "benefit":"<p>You do not provoke an attack of opportunity when performing an overrun combat maneuver. In addition, you receive a +2 bonus on checks made to overrun a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to overrun you. Targets of your overrun attempt may not chose to avoid you.</p>",
            "description":"<p>You are skilled at running down your foes.</p>",
            "featType":"Combat",
            "name":"Improved Overrun",
            "normal":"<p>You provoke an attack of opportunity when performing an overrun combat maneuver.</p>",
            "requires":[
                "Str 13",
                "Power Attack",
                "base attack bonus +1."
            ],
            "summary":"+2 bonus on overrun attempts, no attack of opportunity",
            "type":"Feat"
        },
        "Improved Precise Shot":{
            "benefit":"<p>Your ranged attacks ignore the AC bonus granted to targets by anything less than total cover, and the miss chance granted to targets by anything less than total concealment. Total cover and total concealment provide their normal benefits against your ranged attacks.</p>",
            "description":"<p>Your ranged attacks ignore anything but total concealment and cover.</p>",
            "featType":"Combat",
            "name":"Improved Precise Shot",
            "normal":"<p>See the normal rules on the effects of cover and concealment in Combat.</p>",
            "requires":[
                "Dex 19",
                "Point-Blank Shot",
                "Precise Shot",
                "base attack bonus +11."
            ],
            "summary":"No cover or concealment chance on ranged attacks",
            "type":"Feat"
        },
        "Improved Shield Bash":{
            "benefit":"<p>When you perform a shield bash, you may still apply the shield's shield bonus to your AC.</p>",
            "featType":"Combat",
            "name":"Improved Shield Bash",
            "normal":"<p>Without this feat, a character that performs a shield bash loses the shield's shield bonus to AC until his next turn (see Str 13, Power Attack, base attack bonus +1.</p>",
            "requires":[
                "Shield Proficiency"
            ],
            "summary":"Keep your shield bonus when shield bashing",
            "type":"Feat"
        },
        "Improved Sunder":{
            "benefit":"<p>You do not provoke an attack of opportunity when performing a sunder combat maneuver. In addition, you receive a +2 bonus on checks made to sunder an item. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to sunder your gear. </p>",
            "featType":"Combat",
            "name":"Improved Sunder",
            "normal":"<p>You provoke an attack of opportunity when performing a sunder combat maneuver.</p>",
            "requires":[
                "Power Attack",
                "base attack bonus +1"
            ],
            "summary":"+2 bonus on sunder attempts, no attack of opportunity",
            "type":"Feat"
        },
        "Improved Trip":{
            "benefit":"<p>You do not provoke an attack of opportunity when performing a trip combat maneuver. In addition, you receive a +2 bonus on checks made to trip a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to trip you. </p>",
            "description":"<p>You are skilled at sending your opponents to the ground.</p>",
            "featType":"Combat",
            "name":"Improved Trip",
            "normal":"<p>You provoke an attack of opportunity when performing a trip combat maneuver.</p>",
            "requires":[
                "Int 13",
                "Combat Expertise."
            ],
            "summary":"+2 bonus on trip attempts, no attack of opportunity",
            "type":"Feat"
        },
        "Improved Two-Weapon Fighting":{
            "benefit":"<p>In addition to the standard single extra attack you get with an off-hand weapon, you get a second attack with it, albeit at a –5 penalty.</p>",
            "description":"<p>You are skilled at fighting with two weapons.</p>",
            "featType":"Combat",
            "name":"Improved Two-Weapon Fighting",
            "normal":"<p>Without this feat, you can only get a single extra attack with an off-hand weapon.</p>",
            "requires":[
                "Dex 17",
                "Two-Weapon Fighting",
                "base attack bonus +6"
            ],
            "summary":"Gain additional off-hand attack",
            "type":"Feat"
        },
        "Improved Unarmed Strike":{
            "benefit":"<p>You are considered to be armed even when unarmed—you do not provoke attacks of opportunity when you attack foes while unarmed. Your unarmed strikes can deal lethal or nonlethal damage, at your choice.</p>",
            "description":"<p>You are skilled at fighting while unarmed.</p>",
            "featType":"Combat",
            "name":"Improved Unarmed Strike",
            "normal":"<p>Without this feat, you are considered unarmed when attacking with an unarmed strike, and you can deal only nonlethal damage with such an attack.</p>",
            "summary":"Always considered armed",
            "type":"Feat"
        },
        "Improved Vital Strike":{
            "benefit":"<p>You do not suffer any penalties for using an improvised weapon. Increase the amount of damage dealt by the improvised weapon by one step (for example, 1d4 becomes 1d6) to a maximum of 1d8 (2d6 if the improvised weapon is two-handed). The improvised weapon has a critical threat range of 19–20, with a critical multiplier of ×2.</p>",
            "description":"<p>You can make a single attack that deals a large amount of damage.</p>",
            "featType":"Combat",
            "name":"Improved Vital Strike",
            "requires":[
                "Vital Strike",
                "base attack bonus +11"
            ],
            "summary":"Deal three times the normal damage on a single attack",
            "type":"Feat"
        },
        "Improvised Weapon Mastery":{
            "benefit":"<p>You do not suffer any penalties for using an improvised weapon. Increase the amount of damage dealt by the improvised weapon by one step (for example, 1d4 becomes 1d6) to a maximum of 1d8 (2d6 if the improvised weapon is two-handed). The improvised weapon has a critical threat range of 19–20, with a critical multiplier of ×2.</p>",
            "description":"<p>You can turn nearly any object into a deadly weapon, from a razor-sharp chair leg to a sack of flour.</p>",
            "featType":"Combat",
            "name":"Improvised Weapon Mastery",
            "requires":[
                "Catch Off-Guard or Throw Anything",
                "base attack bonus +8."
            ],
            "summary":"Make an improvised weapon deadly",
            "type":"Feat"
        },
        "Intimidating Prowess":{
            "benefit":"<p>Add your Strength modifier to Intimidate skill checks in addition to your Charisma modifier.</p>",
            "description":"<p>Your physical might is intimidating to others.</p>",
            "featType":"Combat",
            "name":"Intimidating Prowess",
            "summary":"Add Str to Intimidate in addition to Cha",
            "type":"Feat"
        },
        "Iron Will":{
            "benefit":"<p>You get a +2 bonus on all Will saving throws.</p>",
            "description":"<p>You are more resistant to mental effects.</p>",
            "name":"Iron Will",
            "summary":"+2 bonus on Will saves",
            "type":"Feat"
        },
        "Leadership":{
            "benefit":"<p>This feat enables you to attract a loyal cohort and a number of devoted subordinates who assist you. A cohort is generally an NPC with class levels, while followers are typically lower level NPCs. See Table: Leadership for what level of cohort and how many followers you can recruit.</p><p><b>Leadership Modifiers:</b> Several factors can affect your Leadership score, causing it to vary from the base score (character level + Cha modifier). Your reputation (from the point of view of the cohort or follower you are trying to attract) raises or lowers your Leadership score:</p><table><thead><tr><th>Leader's Reputation</th><th>Modifier</th></tr></thead><tbody><tr><td>Great renown</td><td>+2</td></tr><tr><td>Fairness and generosity</td><td>+1</td></tr><tr><td>Special power</td><td>+1</td></tr><tr><td>Failure</td><td>–1</td></tr><tr><td>Aloofness</td><td>–1</td></tr><tr><td>Cruelty</td><td>–2</td></tr></tbody></table><p>Other modifiers may apply when you try to attract a cohort, as listed below.</p><br><table><thead><tr><th>The Leader... </th><th>Modifier</th></tr></thead><tr><td>Has a familiar, special mount, or animal companion</td><td>–2</td></tr><tr><td>Recruits a cohort of a different alignment</td><td>–1</td></tr><tr><td>Caused the death of a cohort</td><td>–2*</td></tr><tfoot><tr><td colspan='2'>* Cumulative per cohort killed.</td></tr></tfoot></table><p>Followers have different priorities from cohorts. When you try to attract a follower, use the following modifiers.</p><br><table><thead><tr><th>The Leader... </th><th>Modifier</th></tr></thead><tr><td>Has a stronghold, base of operations, guildhouse, etc.</td><td>+2</td></tr><tr><td>Moves around a lot</td><td>–1</td></tr><tr><td>Caused the death of other followers</td><td>–1</td></tr></table><br><p><i>Leadership Score</i>: Your base Leadership score equals your level plus your Charisma modifier. In order to take into account negative Charisma modifiers, this table allows for very low Leadership scores, but you must still be 7th level or higher in order to gain the Leadership feat. Outside factors can affect your Leadership score, as detailed above.</p><p><i>Cohort Level</i>: You can attract a cohort of up to this level. Regardless of your Leadership score, you can only recruit a cohort who is two or more levels lower than yourself. The cohort should be equipped with gear appropriate for its level (see Reflex saving throws.</p>",
            "description":"<table id='table-5-2-leadership'><caption>Table: Leadership</caption><thead><tr><th rowspan='2'>Leadership Score</th><th rowspan='2'>Cohort Level</th><th colspan='6'>Number of Followers by Level</th></tr><tr><th>1st</th><th>2nd</th><th>3rd</th><th>4th</th><th>5th</th><th>6th</th></tr></thead><tbody><tr><td>1 or lower</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>2</td><td>1st</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>3</td><td>2nd</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>4</td><td>3rd</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>5</td><td>3rd</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>6</td><td>4th</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>7</td><td>5th</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>8</td><td>5th</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>9</td><td>6th</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>10</td><td>7th</td><td>5</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>11</td><td>7th</td><td>6</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>12</td><td>8th</td><td>8</td><td>—</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>13</td><td>9th</td><td>10</td><td>1</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>14</td><td>10th</td><td>15</td><td>1</td><td>—</td><td>—</td><td>—</td><td>—</td></tr><tr><td>15</td><td>10th</td><td>20</td><td>2</td><td>1</td><td>—</td><td>—</td><td>—</td></tr><tr><td>16</td><td>11th</td><td>25</td><td>2</td><td>1</td><td>—</td><td>—</td><td>—</td></tr><tr><td>17</td><td>12th</td><td>30</td><td>3</td><td>1</td><td>1</td><td>—</td><td>—</td></tr><tr><td>18</td><td>12th</td><td>35</td><td>3</td><td>1</td><td>1</td><td>—</td><td>—</td></tr><tr><td>19</td><td>13th</td><td>40</td><td>4</td><td>2</td><td>1</td><td>1</td><td>—</td></tr><tr><td>20</td><td>14th</td><td>50</td><td>5</td><td>3</td><td>2</td><td>1</td><td>—</td></tr><tr><td>21</td><td>15th</td><td>60</td><td>6</td><td>3</td><td>2</td><td>1</td><td>1</td></tr><tr><td>22</td><td>15th</td><td>75</td><td>7</td><td>4</td><td>2</td><td>2</td><td>1</td></tr><tr><td>23</td><td>16th</td><td>90</td><td>9</td><td>5</td><td>3</td><td>2</td><td>1</td></tr><tr><td>24</td><td>17th</td><td>110</td><td>11</td><td>6</td><td>3</td><td>2</td><td>1</td></tr><tr><td>25 or higher</td><td>17th</td><td>135</td><td>13</td><td>7</td><td>4</td><td>2</td><td>2</td></tr></tbody></table><p>You attract followers to your cause and a companion to join you on your adventures.</p>",
            "name":"Leadership",
            "requires":[
                "Character level 7th"
            ],
            "summary":"Gain a cohort and followers",
            "type":"Feat"
        },
        "Lightning Reflexes":{
            "benefit":"<p>You get a +2 bonus on all Reflex saving throws.</p>",
            "description":"<p>You have faster reflexes than normal.</p>",
            "name":"Lightning Reflexes",
            "summary":"+2 bonus on Reflex saves",
            "type":"Feat"
        },
        "Lightning Stance":{
            "benefit":"<p>If you take two actions to move or a withdraw action in a turn, you gain 50% concealment for 1 round.</p>",
            "description":"<p>The speed at which you move makes it nearly impossible for opponents to strike you.</p>",
            "featType":"Combat",
            "name":"Lightning Stance",
            "requires":[
                "Dex 17",
                "Dodge",
                "Wind Stance",
                "base attack bonus +11"
            ],
            "summary":"Gain 50% concealment if you move",
            "type":"Feat"
        },
        "Lunge":{
            "benefit":"<p>You can increase the reach of your melee attacks by 5 feet until the end of your turn by taking a –2 penalty to your AC until your next turn. You must decide to use this ability before any attacks are made.</p>",
            "description":"<p>You can strike foes that would normally be out of reach.</p>",
            "featType":"Combat",
            "name":"Lunge",
            "requires":[
                "Base attack bonus +6"
            ],
            "summary":"Take a 2 penalty to your AC to attack with reach",
            "type":"Feat"
        },
        "Magical Aptitude":{
            "benefit":"<p>You get a +2 bonus on all Spellcraft checks and Use Magic Device checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You are skilled at spellcasting and using magic items.</p>",
            "name":"Magical Aptitude",
            "summary":"+2 bonus on Spellcraft and Use Magic Device checks",
            "type":"Feat"
        },
        "Manyshot":{
            "benefit":"<p>When making a full-attack action with a bow, your first attack fires two arrows. If the attack hits, both arrows hit. Apply precision-based damage (such as sneak attack) and critical hit damage only once for this attack. Damage bonuses from using a composite bow with a high Strength bonus apply to each arrow, as do other damage bonuses, such as a ranger's favored enemy bonus. Damage reduction and resistances apply separately to each arrow.</p>",
            "description":"<p>You can fire multiple arrows at a single target.</p>",
            "featType":"Combat",
            "name":"Manyshot",
            "requires":[
                "Dex 17",
                "Point-Blank Shot",
                "Rapid Shot",
                "base attack bonus +6"
            ],
            "summary":"Shoot two arrows simultaneously",
            "type":"Feat"
        },
        "Martial Weapon Proficiency":{
            "benefit":"<p>You make attack rolls with the selected weapon normally (without the non-proficient penalty).</p>",
            "description":"<p>Choose a type of martial weapon. You understand how to use that type of martial weapon in combat.</p>",
            "featType":"Combat",
            "name":"Martial Weapon Proficiency",
            "normal":"<p>When using a weapon with which you are not proficient, you take a –4 penalty on attack rolls.</p>",
            "special":"<p>Barbarians, fighters, paladins, and rangers are proficient with all martial weapons. They need not select this feat.<p>You can gain Martial Weapon Proficiency multiple times. Each time you take the feat, it applies to a new type of weapon. </p></p>",
            "summary":"No penalty on attacks made with one martial weapon",
            "type":"Feat"
        },
        "Master Craftsman":{
            "benefit":"<p>Choose one Craft or Profession skill in which you possess at least 5 ranks. You receive a +2 bonus on your chosen Craft or Profession skill. Ranks in your chosen skill count as your caster level for the purposes of qualifying for the Craft Magic Arms and Armor and Craft Wondrous Item feats. You can create magic items using these feats, substituting your ranks in the chosen skill for your total caster level. You must use the chosen skill for the check to create the item. The DC to create the item still increases for any necessary spell requirements (see the magic item creation rules in Craft Magic Arms and Armor and Craft Wondrous Item feats.</p>",
            "description":"<p>Your superior crafting skills allow you to create simple magic items.</p>",
            "name":"Master Craftsman",
            "requires":[
                "5 ranks in any Craft or Profession skill"
            ],
            "summary":"You can craft magic items without being a spellcaster",
            "type":"Feat"
        },
        "Maximize Spell":{
            "benefit":"<p>All variable, numeric effects of a spell modified by this feat are maximized. Saving throws and opposed rolls are not affected, nor are spells without random variables. A maximized spell uses up a spell slot three levels higher than the spell's actual level.<p>An empowered, maximized spell gains the separate benefits of each feat: the maximum result plus half the normally rolled result.</p></p>",
            "description":"<p>Your spells have the maximum possible effect.</p>",
            "featType":"Metamagic",
            "name":"Maximize Spell",
            "summary":"Maximize spell variables",
            "type":"Feat"
        },
        "Medusa's Wrath":{
            "benefit":"<p>Whenever you use the full-attack action and make at least one unarmed strike, you can make two additional unarmed strikes at your highest base attack bonus. These bonus attacks must be made against a dazed, flat-footed, paralyzed, staggered, stunned, or unconscious foe.</p>",
            "description":"<p>You can take advantage of your opponent's confusion, delivering multiple blows.</p>",
            "featType":"Combat",
            "name":"Medusa's Wrath",
            "requires":[
                "Improved Unarmed Strike",
                "Gorgon's Fist",
                "Scorpion Style",
                "base attack bonus +11"
            ],
            "summary":"Make 2 extra attacks against a hindered foe",
            "type":"Feat"
        },
        "Mobility":{
            "benefit":"<p>You get a +4 dodge bonus to Armor Class against attacks of opportunity caused when you move out of or within a threatened area. A condition that makes you lose your Dexterity bonus to Armor Class (if any) also makes you lose dodge bonuses.<p>Dodge bonuses stack with each other, unlike most types of bonuses.</p></p>",
            "description":"<p>You can easily move through a dangerous melee.</p>",
            "featType":"Combat",
            "name":"Mobility",
            "requires":[
                "Dex 13",
                "Dodge"
            ],
            "summary":"+4 AC against attacks of opportunity from movement",
            "type":"Feat"
        },
        "Mounted Archery":{
            "benefit":"<p>The penalty you take when using a ranged weapon while mounted is halved: –2 instead of –4 if your mount is taking a double move, and –4 instead of –8 if your mount is running.</p>",
            "description":"<p>You are skilled at making ranged attacks while mounted.</p>",
            "featType":"Combat",
            "name":"Mounted Archery",
            "requires":[
                "Ride 1 rank",
                "Mounted Combat"
            ],
            "summary":"Halve the penalty for ranged attacks while mounted",
            "type":"Feat"
        },
        "Mounted Combat":{
            "benefit":"<p>Once per round when your mount is hit in combat, you may attempt a Ride check (as an immediate action) to negate the hit. The hit is negated if your Ride check result is greater than the opponent's attack roll.</p>",
            "description":"<p>You are adept at guiding your mount through combat.</p>",
            "featType":"Combat",
            "name":"Mounted Combat",
            "requires":[
                "Ride 1 rank."
            ],
            "summary":"Avoid attacks on mount with Ride check",
            "type":"Feat"
        },
        "Natural Spell":{
            "benefit":"<p>You can complete the verbal and somatic components of spells while using wild shape. You substitute various noises and gestures for the normal verbal and somatic components of a spell.<p>You can also use any material components or focuses you possess, even if such items are melded within your current form. This feat does not permit the use of magic items while you are in a form that could not ordinarily use them, and you do not gain the ability to speak while using wild shape.</p></p>",
            "description":"<p>You can cast spells even while in a form that cannot normally cast spells.</p>",
            "name":"Natural Spell",
            "requires":[
                "Wis 13",
                "wild shape class feature"
            ],
            "summary":"Cast spells while using wild shape",
            "type":"Feat"
        },
        "Nimble Moves":{
            "benefit":"<p>Whenever you move, you may move through 5 feet of difficult terrain each round as if it were normal terrain. This feat allows you to take a 5-foot step into difficult terrain.</p>",
            "description":"<p>You can move across a single obstacle with ease.</p>",
            "name":"Nimble Moves",
            "requires":[
                "Dex 13"
            ],
            "summary":"Ignore 5 feet of difficult terrain when you move",
            "type":"Feat"
        },
        "Penetrating Strike":{
            "benefit":"<p>As a standard action, make a single ranged attack. The target does not gain any armor, natural armor, or shield bonuses to its Armor Class. You do not gain the benefit of this feat if you move this round.</p>",
            "description":"<p>Your attacks are capable of penetrating the defenses of some creatures.</p>",
            "featType":"Combat",
            "name":"Penetrating Strike",
            "requires":[
                "Weapon Focus",
                "base attack bonus +1",
                "12th-level fighter",
                "proficiency with weapon"
            ],
            "summary":"Your attacks ignore 5 points of damage reduction",
            "type":"Feat"
        },
        "Persuasive":{
            "benefit":"<p>You get a +2 bonus on Diplomacy and Intimidate skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You are skilled at swaying attitudes and intimidating others into your way of thinking.</p>",
            "name":"Persuasive",
            "summary":"+2 bonus on Diplomacy and Intimidate checks",
            "type":"Feat"
        },
        "Pinpoint Targeting":{
            "benefit":"<p>As a standard action, make a single ranged attack. The target does not gain any armor, natural armor, or shield bonuses to its Armor Class. You do not gain the benefit of this feat if you move this round.</p>",
            "description":"<p>You can target the weak points in your opponent's armor.</p>",
            "featType":"Combat",
            "name":"Pinpoint Targeting",
            "requires":[
                "Dex 19",
                "Improved Precise Shot",
                "Point-Blank Shot",
                "Precise Shot",
                "base attack bonus +16."
            ],
            "summary":"No armor or shield bonus on one ranged attack",
            "type":"Feat"
        },
        "Point-Blank Shot":{
            "benefit":"<p>You get a +1 bonus on attack and damage rolls with ranged weapons at ranges of up to 30 feet.</p>",
            "description":"<p>You are especially accurate when making ranged attacks against close targets.</p>",
            "featType":"Combat",
            "name":"Point-Blank Shot",
            "summary":"+1 attack and damage on targets within 30 feet",
            "type":"Feat"
        },
        "Power Attack":{
            "benefit":"<p>You can choose to take a –1 penalty on all melee attack rolls and combat maneuver checks to gain a +2 bonus on all melee damage rolls. This bonus to damage is increased by half (+50%) if you are making an attack with a two-handed weapon, a one handed weapon using two hands, or a primary natural weapon that adds 1-1/2 times your Strength modifier on damage rolls. This bonus to damage is halved (–50%) if you are making an attack with an off-hand weapon or secondary natural weapon. When your base attack bonus reaches +4, and every 4 points thereafter, the penalty increases by –1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll, and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.</p>",
            "description":"<p>You can make exceptionally deadly melee attacks by sacrificing accuracy for strength.</p>",
            "featType":"Combat",
            "name":"Power Attack",
            "requires":[
                "Str 13",
                "base attack bonus +1"
            ],
            "summary":"Trade melee attack bonus for damage",
            "type":"Feat"
        },
        "Precise Shot":{
            "benefit":"<p>You can shoot or throw ranged weapons at an opponent engaged in melee without taking the standard –4 penalty on your attack roll.</p>",
            "description":"<p>You are adept at firing ranged attacks into melee.</p>",
            "featType":"Combat",
            "name":"Precise Shot",
            "requires":[
                "Point-Blank Shot."
            ],
            "summary":"No penalty for shooting into melee",
            "type":"Feat"
        },
        "Quick Draw":{
            "benefit":"<p>You can draw a weapon as a free action instead of as a move action. You can draw a hidden weapon (see the Sleight of Hand skill) as a move action.</p><p>A character who has selected this feat may throw weapons at his full normal rate of attacks (much like a character with a bow).</p><p>Alchemical items, potions, scrolls, and wands cannot be drawn quickly using this feat.</p>",
            "description":"<p>You can draw weapons faster than most.</p>",
            "featType":"Combat",
            "name":"Quick Draw",
            "normal":"<p>Without this feat, you may draw a weapon as a move action, or (if your base attack bonus is +1 or higher) as a free action as part of movement. Without this feat, you can draw a hidden weapon as a standard action.</p>",
            "requires":[
                "Base attack bonus +1."
            ],
            "summary":"Draw weapon as a free action",
            "type":"Feat"
        },
        "Quicken Spell":{
            "benefit":"<p>Casting a quickened spell is a swift action. You can perform another action, even casting another spell, in the same round as you cast a quickened spell. A spell whose casting time is more than 1 round or 1 full-round action cannot be quickened.<p>A quickened spell uses up a spell slot four levels higher than the spell's actual level. Casting a quickened spell doesn't provoke an attack of opportunity.</p></p>",
            "description":"<p>You can cast spells in a fraction of the normal time.</p>",
            "featType":"Metamagic",
            "name":"Quicken Spell",
            "special":"<p>You can apply the effects of this feat to a spell cast spontaneously, so long as it has a casting time that is not more than 1 full-round action, without increasing the spell's casting time.</p>",
            "summary":"Cast spell as a swift action",
            "type":"Feat"
        },
        "Rapid Reload":{
            "benefit":"<p>The time required for you to reload your chosen type of crossbow is reduced to a free action (for a hand or light crossbow) or a move action (for a heavy crossbow). Reloading a crossbow still provokes an attack of opportunity.<p>If you have selected this feat for hand crossbow or light crossbow, you may fire that weapon as many times in a full-attack action as you could attack if you were using a bow.</p></p>",
            "description":"<p>Choose a type of crossbow (hand, light, or heavy). You can reload such weapons quickly.</p>",
            "featType":"Combat",
            "name":"Rapid Reload",
            "normal":"<p>A character without this feat needs a move action to reload a hand or light crossbow, or a full-round action to reload a heavy crossbow. </p>",
            "requires":[
                "Weapon Proficiency (crossbow type chosen)."
            ],
            "special":"<p>You can gain Rapid Reload multiple times. Each time you take the feat, it applies to a new type of crossbow.</p>",
            "summary":"Reload crossbow quickly",
            "type":"Feat"
        },
        "Rapid Shot":{
            "benefit":"<p>When making a full-attack action with a ranged weapon, you can fire one additional time this round. All of your attack rolls take a –2 penalty when using Rapid Shot.</p>",
            "description":"<p>You can make an additional ranged attack.</p>",
            "featType":"Combat",
            "name":"Rapid Shot",
            "requires":[
                "Dex 13",
                "Point-Blank Shot"
            ],
            "summary":"Make one extra ranged attack",
            "type":"Feat"
        },
        "Ride-By Attack":{
            "benefit":"<p>When you are mounted and use the charge action, you may move and attack as if with a standard charge and then move again (continuing the straight line of the charge). Your total movement for the round can't exceed double your mounted speed. You and your mount do not provoke an attack of opportunity from the opponent that you attack.</p>",
            "description":"<p>While mounted and charging, you can move, strike at a foe, and then continue moving.</p>",
            "featType":"Combat",
            "name":"Ride-By Attack",
            "requires":[
                "Ride 1 rank",
                "Mounted Combat"
            ],
            "summary":"Move before and after a charge attack while mounted",
            "type":"Feat"
        },
        "Run":{
            "benefit":"<p>When running, you move five times your normal speed (if wearing medium, light, or no armor and carrying no more than a medium load) or four times your speed (if wearing heavy armor or carrying a heavy load). If you make a jump after a running start (see the Acrobatics skill description), you gain a +4 bonus on your Acrobatics check. While running, you retain your Dexterity bonus to your Armor Class.</p>",
            "description":"<p>You are swift of foot.</p>",
            "name":"Run",
            "normal":"<p>You move four times your speed while running (if wearing medium, light, or no armor and carrying no more than a medium load) or three times your speed (if wearing heavy armor or carrying a heavy load), and you lose your Dexterity bonus to AC.</p>",
            "summary":"Run at 5 times your normal speed",
            "type":"Feat"
        },
        "Scorpion Style":{
            "benefit":"<p>To use this feat, you must make a single unarmed attack as a standard action. If this unarmed attack hits, you deal damage normally, and the target's base land speed is reduced to 5 feet for a number of rounds equal to your Wisdom modifier unless it makes a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier).</p>",
            "description":"<p>You can perform an unarmed strike that greatly hampers your target's movement.</p>",
            "featType":"Combat",
            "name":"Scorpion Style",
            "requires":[
                "Improved Unarmed Strike."
            ],
            "summary":"Reduce target's speed to 5 ft.",
            "type":"Feat"
        },
        "Scribe Scroll":{
            "benefit":"<p>When you channel energy, you can choose a number of targets in the area up to your Charisma modifier. These targets are not affected by your channeled energy.</p>",
            "description":"<p>You can create magic scrolls.</p>",
            "featType":"Item Creation",
            "name":"Scribe Scroll",
            "normal":"<p>All targets in a 30-foot burst are affected when you channel energy. You can only choose whether or not you are affected.</p>",
            "requires":[
                "Caster level 1st."
            ],
            "summary":"Create magic scrolls",
            "type":"Feat"
        },
        "Selective Channeling":{
            "benefit":"<p>When you channel energy, you can choose a number of targets in the area up to your Charisma modifier. These targets are not affected by your channeled energy.</p>",
            "description":"<p>You can choose whom to affect when you channel energy.</p>",
            "name":"Selective Channeling",
            "normal":"<p>All targets in a 30-foot burst are affected when you channel energy. You can only choose whether or not you are affected.</p>",
            "requires":[
                "Cha 13",
                "channel energy class feature."
            ],
            "summary":"Choose whom to affect with channel energy",
            "type":"Feat"
        },
        "Self-Sufficient":{
            "benefit":"<p>You get a +2 bonus on all Heal checks and Survival checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You know how to get along in the wild and how to effectively treat wounds.</p>",
            "name":"Self-Sufficient",
            "summary":"+2 bonus on Heal and Survival checks",
            "type":"Feat"
        },
        "Shatter Defenses":{
            "benefit":"<p>Any shaken, frightened, or panicked opponent hit by you this round is flat-footed to your attacks until the end of your next turn. This includes any additional attacks you make this round.</p>",
            "description":"<p>Your skill with your chosen weapon leaves opponents unable to defend themselves if you strike them when their defenses are already compromised.</p>",
            "featType":"Combat",
            "name":"Shatter Defenses",
            "requires":[
                "Weapon Focus",
                "Dazzling Display",
                "base attack bonus +6",
                "proficiency with weapon"
            ],
            "summary":"Hindered foes are flat-footed",
            "type":"Feat"
        },
        "Shield Focus":{
            "benefit":"<p>Increase the AC bonus granted by any shield you are using by 1.</p>",
            "description":"<p>You are skilled at deflecting blows with your shield.</p>",
            "featType":"Combat",
            "name":"Shield Focus",
            "requires":[
                "Shield Proficiency",
                "base attack bonus +1"
            ],
            "summary":"Gain a +1 bonus to your AC when using a shield",
            "type":"Feat"
        },
        "Shield Master":{
            "benefit":"<p>You do not suffer any penalties on attack rolls made with a shield while you are wielding another weapon. Add your shield's enhancement bonus to attacks and damage rolls made with the shield as if it was a weapon enhancement bonus.</p>",
            "description":"<p>Your mastery of the shield allows you to fight with it without hindrance.</p>",
            "featType":"Combat",
            "name":"Shield Master",
            "requires":[
                "Improved Shield Bash, Shield Proficiency",
                "Shield Slam",
                "Two-Weapon Fighting",
                "base attack bonus +11"
            ],
            "summary":"No two-weapon penalties when attacking with a shield",
            "type":"Feat"
        },
        "Shield Proficiency":{
            "benefit":"<p>When you use a shield (except a tower shield), the shield's armor check penalty only applies to Strength- and Dexterity-based skills.</p>",
            "description":"<p>You are trained in how to properly use a shield.</p>",
            "featType":"Combat",
            "name":"Shield Proficiency",
            "normal":"<p>When you are using a shield with which you are not proficient, you take the shield's armor check penalty on attack rolls and on all skill checks that involve moving.</p>",
            "special":"<p>Barbarians, bards, clerics, druids, fighters, paladins, and rangers all automatically have Shield Proficiency as a bonus feat. They need not select it.</p>",
            "summary":"No penalties on attack rolls when using a shield",
            "type":"Feat"
        },
        "Shield Slam":{
            "benefit":"<p>Any opponents hit by your shield bash are also hit with a free bull rush attack, substituting your attack roll for the combat maneuver check (see bull rush does not provoke an attack of opportunity. Opponents who cannot move back due to a wall or other surface are knocked prone after moving the maximum possible distance. You may choose to move with your target if you are able to take a 5-foot step or to spend an action to move this turn.</p>",
            "description":"<p>In the right position, your shield can be used to send opponents flying.</p>",
            "featType":"Combat",
            "name":"Shield Slam",
            "requires":[
                "Improved Shield Bash",
                "Shield Proficiency",
                "Two-Weapon Fighting",
                "base attack bonus +6"
            ],
            "summary":"Free bull rush with a bash attack",
            "type":"Feat"
        },
        "Shot on the Run":{
            "benefit":"<p>As a full-round action, you can move up to your speed and make a single ranged attack at any point during your movement.</p>",
            "description":"<p>You can move, fire a ranged weapon, and move again before your foes can react.</p>",
            "featType":"Combat",
            "name":"Shot on the Run",
            "normal":"<p>You cannot move before and after an attack with a ranged weapon.</p>",
            "requires":[
                "Dex 13",
                "Dodge",
                "Mobility",
                "Point-Blank Shot",
                "base attack bonus +4"
            ],
            "summary":"Make ranged attack at any point during movement",
            "type":"Feat"
        },
        "Sickening Critical":{
            "benefit":"<p>Whenever you score a critical hit, your opponent becomes sickened for 1 minute. The effects of this feat do not stack. Additional hits instead add to the effect's duration.</p>",
            "description":"<p>Your critical hits cause opponents to become sickened.</p>",
            "featType":"Combat, Critical",
            "name":"Sickening Critical",
            "requires":[
                "Critical Focus",
                "base attack bonus +11"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.</p>",
            "summary":"Whenever you score a critical hit, the target is sickened",
            "type":"Feat"
        },
        "Silent Spell":{
            "benefit":"<p>A silent spell can be cast with no verbal components. Spells without verbal components are not affected. A silent spell uses up a spell slot one level higher than the spell's actual level.</p>",
            "description":"<p>You can cast your spells without making any sound.</p>",
            "featType":"Metamagic",
            "name":"Silent Spell",
            "special":"<p>Bard spells cannot be enhanced by this feat.</p>",
            "summary":"Cast spell without verbal components",
            "type":"Feat"
        },
        "Simple Weapon Proficiency":{
            "benefit":"<p>You make attack rolls with simple weapons without penalty.</p>",
            "description":"<p>You are trained in the use of basic weapons.</p>",
            "featType":"Combat",
            "name":"Simple Weapon Proficiency",
            "normal":"<p>When using a weapon with which you are not proficient, you take a –4 penalty on attack rolls.</p>",
            "special":"<p>All characters except for druids, monks, and wizards are automatically proficient with all simple weapons. They need not select this feat.</p>",
            "summary":"No penalty on attacks made with simple weapons",
            "type":"Feat"
        },
        "Skill Focus":{
            "benefit":"<p>You get a +3 bonus on all checks involving the chosen skill. If you have 10 or more ranks in that skill, this bonus increases to +6.</p>",
            "description":"<p>Choose a skill. You are particularly adept at that skill.</p>",
            "name":"Skill Focus",
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new skill.</p>",
            "summary":"+3 bonus on one skill (+6 at 10 ranks)",
            "type":"Feat"
        },
        "Snatch Arrows":{
            "benefit":"<p>When using the Deflect Arrows feat you may choose to catch the weapon instead of just deflecting it. Thrown weapons can immediately be thrown back as an attack against the original attacker (even though it isn't your turn) or kept for later use.<p>You must have at least one hand free (holding nothing) to use this feat.</p></p>",
            "description":"<p>Instead of knocking an arrow or ranged attack aside, you can catch it in mid-flight.</p>",
            "featType":"Combat",
            "name":"Snatch Arrows",
            "requires":[
                "Dex 15",
                "Deflect Arrows",
                "Improved Unarmed Strike"
            ],
            "summary":"Catch one ranged attack per round",
            "type":"Feat"
        },
        "Spell Focus":{
            "benefit":"<p>Add +1 to the Difficulty Class for all saving throws against spells from the school of magic you select.</p>",
            "description":"<p>Choose a school of magic. Any spells you cast of that school are more difficult to resist.</p>",
            "name":"Spell Focus",
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new school of magic.</p>",
            "summary":"+1 bonus on save DCs for one school",
            "type":"Feat"
        },
        "Spell Mastery":{
            "benefit":"<p>Each time you take this feat, choose a number of spells that you already know equal to your Intelligence modifier. From that point on, you can prepare these spells without referring to a spellbook.</p>",
            "description":"<p>You have mastered a small handful of spells, and can prepare these spells without referencing your spellbooks at all.</p>",
            "name":"Spell Mastery",
            "normal":"<p>Without this feat, you must use a spellbook to prepare all your spells, except <i>read magic.</i></p>",
            "requires":[
                "1st-level wizard"
            ],
            "summary":"Prepare some spells without a spellbook",
            "type":"Feat"
        },
        "Spell Penetration":{
            "benefit":"<p>You get a +2 bonus on caster level checks (1d20 + caster level) made to overcome a creature's spell resistance.</p>",
            "description":"<p>Your spells break through spell resistance more easily than most.</p>",
            "name":"Spell Penetration",
            "summary":"+2 bonus on level checks to beat spell resistance",
            "type":"Feat"
        },
        "Spellbreaker":{
            "benefit":"<p>Enemies in your threatened area that fail their checks to cast spells defensively provoke attacks of opportunity from you.</p>",
            "description":"<p>You can strike at enemy spellcasters who fail to cast defensively when you threaten them.</p>",
            "featType":"Combat",
            "name":"Spellbreaker",
            "normal":"<p>Enemies that fail to cast spells defensively do not provoke attacks of opportunity.</p>",
            "requires":[
                "Disruptive",
                "10th-level fighter"
            ],
            "summary":"Enemies provoke attacks if their spells fail",
            "type":"Feat"
        },
        "Spirited Charge":{
            "benefit":"<p>When mounted and using the charge action, you deal double damage with a melee weapon (or triple damage with a lance).</p>",
            "description":"<p>Your mounted charge attacks deal a tremendous amount of damage.</p>",
            "featType":"Combat",
            "name":"Spirited Charge",
            "requires":[
                "Ride 1 rank",
                "Mounted Combat",
                "Ride-By Attack"
            ],
            "summary":"Double damage on a mounted charge",
            "type":"Feat"
        },
        "Spring Attack":{
            "benefit":"<p>As a full-round action, you can move up to your speed and make a single melee attack without provoking any attacks of opportunity from the target of your attack. You can move both before and after the attack, but you must move at least 10 feet before the attack and the total distance that you move cannot be greater than your speed. You cannot use this ability to attack a foe that is adjacent to you at the start of your turn.</p>",
            "description":"<p>You can deftly move up to a foe, strike, and withdraw before he can react.</p>",
            "featType":"Combat",
            "name":"Spring Attack",
            "normal":"<p>You cannot move before and after an attack.</p>",
            "requires":[
                "Dex 13",
                "Dodge",
                "Mobility",
                "base attack bonus +4"
            ],
            "summary":"Move before and after melee attack",
            "type":"Feat"
        },
        "Staggering Critical":{
            "benefit":"<p>Whenever you score a critical hit, your opponent becomes staggered for 1d4+1 rounds. A successful Fortitude save reduces the duration to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration.</p>",
            "description":"<p>Your critical hits cause opponents to slow down.</p>",
            "featType":"Combat, Critical",
            "name":"Staggering Critical",
            "requires":[
                "Critical Focus",
                "base attack bonus +13"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.</p>",
            "summary":"Whenever you score a critical hit, the target is staggered",
            "type":"Feat"
        },
        "Stand Still":{
            "benefit":"<p>When a foe provokes an attack of opportunity due to moving through your adjacent squares, you can make a combat maneuver check as your attack of opportunity. If successful, the enemy cannot move for the rest of his turn. An enemy can still take the rest of his action, but cannot move. This feat also applies to any creature that attempts to move from a square that is adjacent to you if such movement provokes an attack of opportunity.</p>",
            "description":"<p>You can stop foes that try to move past you.</p>",
            "featType":"Combat",
            "name":"Stand Still",
            "requires":[
                "Combat Reflexes"
            ],
            "summary":"Stop enemies from moving past you",
            "type":"Feat"
        },
        "Stealthy":{
            "benefit":"<p>You get a +2 bonus on all Escape Artist and Stealth skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill.</p>",
            "description":"<p>You are good at avoiding unwanted attention and slipping out of bonds.</p>",
            "name":"Stealthy",
            "summary":"+2 bonus on Escape Artist and Stealth checks",
            "type":"Feat"
        },
        "Step Up":{
            "benefit":"<p>Whenever an adjacent foe attempts to take a 5-foot step away from you, you may also make a 5-foot step as an immediate action so long as you end up adjacent to the foe that triggered this ability. If you take this step, you cannot take a 5-foot step during your next turn. If you take an action to move during your next turn, subtract 5 feet from your total movement.</p>",
            "description":"<p>You can close the distance when a foe tries to move away.</p>",
            "featType":"Combat",
            "name":"Step Up",
            "requires":[
                "Base attack bonus +1."
            ],
            "summary":"Take a 5-foot step as an immediate action",
            "type":"Feat"
        },
        "Still Spell":{
            "benefit":"<p>A stilled spell can be cast with no somatic components. Spells without somatic components are not affected. A stilled spell uses up a spell slot one level higher than the spell's actual level.</p>",
            "description":"<p>You can cast spells without moving.</p>",
            "featType":"Metamagic",
            "name":"Still Spell",
            "summary":"Cast spell without somatic components",
            "type":"Feat"
        },
        "Strike Back":{
            "benefit":"<p>You can ready an action to make a melee attack against any foe that attacks you in melee, even if the foe is outside of your reach.</p>",
            "description":"<p>You can strike at foes that attack you using their superior reach, by targeting their limbs or weapons as they come at you.</p>",
            "featType":"Combat",
            "name":"Strike Back",
            "requires":[
                "Base attack bonus +11."
            ],
            "summary":"Attack foes that strike you while using reach",
            "type":"Feat"
        },
        "Stunning Critical":{
            "benefit":"<p>Whenever you score a critical hit, your opponent becomes stunned for 1d4 rounds. A successful Fortitude save reduces this to staggered for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration.</p>",
            "description":"<p>Your critical hits cause opponents to become stunned.</p>",
            "featType":"Combat, Critical",
            "name":"Stunning Critical",
            "requires":[
                "Critical Focus",
                "Staggering Critical",
                "base attack bonus +17"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.</p>",
            "summary":"Whenever you score a critical hit, the target is stunned",
            "type":"Feat"
        },
        "Stunning Fist":{
            "benefit":"<p>You must declare that you are using this feat before you make your attack roll (thus, a failed attack roll ruins the attempt). Stunning Fist forces a foe damaged by your unarmed attack to make a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier), in addition to dealing damage normally. A defender who fails this saving throw is stunned for 1 round (until just before your next turn). A stunned character drops everything held, can't take actions, loses any Dexterity bonus to AC, and takes a –2 penalty to AC. You may attempt a stunning attack once per day for every four levels you have attained (but see Special), and no more than once per round. Constructs, oozes, plants, undead, incorporeal creatures, and creatures immune to critical hits cannot be stunned.</p>",
            "description":"<p>You know just where to strike to temporarily stun a foe.</p>",
            "featType":"Combat",
            "name":"Stunning Fist",
            "requires":[
                "Dex 13",
                "Wis 13",
                "Improved Unarmed Strike",
                "base attack bonus +8"
            ],
            "special":"<p>A monk receives Stunning Fist as a bonus feat at 1st level, even if he does not meet the prerequisites. A monk may attempt a stunning attack a number of times per day equal to his monk level, plus one more time per day for every four levels he has in classes other than monk.</p>",
            "summary":"Stun opponent with an unarmed strike",
            "type":"Feat"
        },
        "Throw Anything":{
            "benefit":"<p>You do not suffer any penalties for using an improvised ranged weapon. You receive a +1 circumstance bonus on attack rolls made with thrown splash weapons.</p>",
            "description":"<p>You are used to throwing things you have on hand.</p>",
            "featType":"Combat",
            "name":"Throw Anything",
            "normal":"<p>You take a –4 penalty on attack rolls made with an improvised weapon.</p>",
            "summary":"No penalties for improvised ranged weapons",
            "type":"Feat"
        },
        "Tiring Critical":{
            "benefit":"<p>Whenever you score a critical hit, your opponent becomes fatigued. This feat has no additional effect on a fatigued or exhausted creature.</p>",
            "description":"<p>Your critical hits cause opponents to become fatigued.</p>",
            "featType":"Combat, Critical",
            "name":"Tiring Critical",
            "requires":[
                "Critical Focus",
                "base attack bonus +13"
            ],
            "special":"<p>You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery.</p>",
            "summary":"Whenever you score a critical hit, the target is fatigued",
            "type":"Feat"
        },
        "Toughness":{
            "benefit":"<p>You gain +3 hit points. For every Hit Die you possess beyond 3, you gain an additional +1 hit point. If you have more than 3 Hit Dice, you gain +1 hit points whenever you gain a Hit Die (such as when you gain a level).</p>",
            "description":"<p>You have enhanced physical stamina.</p>",
            "name":"Toughness",
            "summary":"+3 hit points, +1 per Hit Die beyond 3",
            "type":"Feat"
        },
        "Tower Shield Proficiency":{
            "benefit":"<p>When you use a tower shield, the shield's armor check penalty only applies to Strength and Dexterity-based skills.</p>",
            "description":"<p>You are trained in how to properly use a tower shield.</p>",
            "featType":"Combat",
            "name":"Tower Shield Proficiency",
            "normal":"<p>A character using a shield with which he is not proficient takes the shield's armor check penalty on attack rolls and on all skill checks that involve moving, including Ride.</p>",
            "requires":[
                "Shield Proficiency."
            ],
            "special":"<p>Fighters automatically have Tower Shield Proficiency as a bonus feat. They need not select it.</p>",
            "summary":"No penalties on attack rolls when using a tower shield",
            "type":"Feat"
        },
        "Trample":{
            "benefit":"<p>When you attempt to overrun an opponent while mounted, your target may not choose to avoid you. Your mount may make one hoof attack against any target you knock down, gaining the standard +4 bonus on attack rolls against prone targets.</p>",
            "description":"<p>While mounted, you can ride down opponents and trample them under your mount.</p>",
            "featType":"Combat",
            "name":"Trample",
            "requires":[
                "Ride 1 rank",
                "Mounted Combat"
            ],
            "summary":"Overrun targets while mounted",
            "type":"Feat"
        },
        "Turn Undead":{
            "benefit":"<p>You can, as a standard action, use one of your uses of channel positive energy to cause all undead within 30 feet of you to flee, as if panicked. Undead receive a Will save to negate the effect. The DC for this Will save is equal to 10 + 1/2 your cleric level + your Charisma modifier. Undead that fail their save flee for 1 minute. Intelligent undead receive a new saving throw each round to end the effect. If you use channel energy in this way, it has no other effect (it does not heal or harm nearby creatures).</p>",
            "description":"<p>Calling upon higher powers, you cause undead to flee from the might of your unleashed divine energy.</p>",
            "name":"Turn Undead",
            "requires":[
                "Channel positive energy class feature"
            ],
            "summary":"Channel energy can be used to make undead flee",
            "type":"Feat"
        },
        "Two-Weapon Defense":{
            "benefit":"<p>When wielding a double weapon or two weapons (not including natural weapons or unarmed strikes), you gain a +1 shield bonus to your AC.<p>When you are fighting defensively or using the total defense action, this shield bonus increases to +2.</p></p>",
            "description":"<p>You are skilled at defending yourself while dual-wielding.</p>",
            "featType":"Combat",
            "name":"Two-Weapon Defense",
            "requires":[
                "Dex 15",
                "Two-Weapon Fighting"
            ],
            "summary":"Gain +1 shield bonus when fighting with two weapons",
            "type":"Feat"
        },
        "Two-Weapon Fighting":{
            "benefit":"<p>If you hit an opponent with both your primary hand and your off-hand weapon, you deal an additional 1d10 points of damage plus 1-1/2 times your Strength modifier. You can only deal this additional damage once each round.</p>",
            "description":"<p>You can fight with a weapon wielded in each of your hands. You can make one extra attack each round with the secondary weapon.</p>",
            "featType":"Combat",
            "name":"Two-Weapon Fighting",
            "requires":[
                "Dex 15."
            ],
            "summary":"Reduce two-weapon fighting penalties",
            "type":"Feat"
        },
        "Two-Weapon Rend":{
            "benefit":"<p>If you hit an opponent with both your primary hand and your off-hand weapon, you deal an additional 1d10 points of damage plus 1-1/2 times your Strength modifier. You can only deal this additional damage once each round.</p>",
            "description":"<p>Striking with both of your weapons simultaneously, you can use them to deliver devastating wounds.</p>",
            "featType":"Combat",
            "name":"Two-Weapon Rend",
            "reqiures":[
                "Dex 17",
                "Double Slice",
                "Improved Two-Weapon Fighting",
                "Two-Weapon Fighting",
                "base attack bonus +11."
            ],
            "summary":"Rend a foe hit by both your weapons",
            "type":"Feat"
        },
        "Unseat":{
            "Benefits":"<p>When charging an opponent while mounted and wielding a lance, resolve the attack as normal. If it hits, you may immediately make a free bull rush attempt in addition to the normal damage. If successful, the target is knocked off his horse and lands prone in a space adjacent to his mount that is directly away from you.</p>",
            "description":"<p>You are skilled at unseating your mounted opponents.</p>",
            "featType":"Combat",
            "name":"Unseat",
            "requires":[
                "Str 13",
                "Ride 1 rank",
                "Mounted Combat",
                "Power Attack",
                "Improved Bull Rush",
                "base attack bonus +1"
            ],
            "summary":"Knock opponents from their mounts",
            "type":"Feat"
        },
        "Vital Strike":{
            "benefit":"<p>When you use the attack action, you can make one attack at your highest base attack bonus that deals additional damage. Roll the weapon's damage dice for the attack twice and add the results together before adding bonuses from Strength, weapon abilities (such as Dexterity modifier instead of your Strength modifier on attack rolls. If you carry a shield, its armor check penalty applies to your attack rolls.</p>",
            "description":"<p>You make a single attack that deals significantly more damage than normal.</p>",
            "featType":"Combat",
            "name":"Vital Strike",
            "requires":[
                "Base attack bonus +6"
            ],
            "special":"<p>Natural weapons are considered light weapons.</p>",
            "summary":"Deal twice the normal damage on a single attack",
            "type":"Feat"
        },
        "Weapon Finesse":{
            "benefit":"<p>With a light weapon, rapier, whip, or spiked chain made for a creature of your size category, you may use your Dexterity modifier instead of your Strength modifier on attack rolls. If you carry a shield, its armor check penalty applies to your attack rolls.</p>",
            "description":"<p>You are trained in using your agility in melee combat, as opposed to brute strength.</p>",
            "featType":"Combat",
            "name":"Weapon Finesse",
            "special":"<p>Natural weapons are considered light weapons.</p>",
            "summary":"Use Dex instead of Str on attack rolls with light weapons",
            "type":"Feat"
        },
        "Weapon Focus":{
            "benefit":"<p>You gain a +1 bonus on all attack rolls you make using the selected weapon.</p>",
            "description":"<p>Choose one type of weapon. You can also choose unarmed strike or grapple (or ray, if you are a spellcaster) as your weapon for the purposes of this feat.</p>",
            "featType":"Combat",
            "name":"Weapon Focus",
            "requires":[
                "Proficiency with selected weapon",
                "base attack bonus +1"
            ],
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon.</p>",
            "summary":"+1 bonus on attack rolls with one weapon",
            "type":"Feat"
        },
        "Weapon Specialization":{
            "benefit":"<p>You gain a +2 bonus on all damage rolls you make using the selected weapon.</p>",
            "description":"<p>You are skilled at dealing damage with one weapon. Choose one type of weapon (including unarmed strike or grapple) for which you have already selected the Weapon Focus feat. You deal extra damage when using this weapon.</p>",
            "featType":"Combat",
            "name":"Weapon Specialization",
            "requires":[
                "Proficiency with selected weapon",
                "Weapon Focus with selected weapon",
                "fighter level 4th"
            ],
            "special":"<p>You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon.</p>",
            "summary":"+2 bonus on damage rolls with one weapon",
            "type":"Feat"
        },
        "Whirlwind Attack":{
            "benefit":"<p>When you use the full-attack action, you can give up your regular attacks and instead make one melee attack at your highest base attack bonus against each opponent within reach. You must make a separate attack roll against each opponent.<p>When you use the Whirlwind Attack feat, you also forfeit any bonus or extra attacks granted by other feats, spells, or abilities.</p></p>",
            "description":"<p>You can strike out at every foe within reach.</p>",
            "featType":"Combat",
            "name":"Whirlwind Attack",
            "requires":[
                "Dex 13",
                "Int 13",
                "Combat Expertise",
                "Dodge",
                "Mobility",
                "Spring Attack",
                "base attack bonus +4"
            ],
            "summary":"Make one melee attack against all foes within reach",
            "type":"Feat"
        },
        "Widen Spell":{
            "benefit":"<p>You can alter a burst, emanation, or spread-shaped spell to increase its area. Any numeric measurements of the spell's area increase by 100%. A widened spell uses up a spell slot three levels higher than the spell's actual level.<p>Spells that do not have an area of one of these four sorts are not affected by this feat.</p></p>",
            "description":"<p>You can cast your spells so that they occupy a larger space.</p>",
            "featType":"Metamagic",
            "name":"Widen Spell",
            "summary":"Double spell area",
            "type":"Feat"
        },
        "Wind Stance":{
            "benefit":"<p>If you move more than 5 feet this turn, you gain 20% concealment for 1 round against ranged attacks.</p>",
            "description":"<p>Your erratic movements make it difficult for enemies to pinpoint your location.</p>",
            "featType":"Combat",
            "name":"Wind Stance",
            "requires":[
                "Dex 15",
                "Dodge",
                "base attack bonus +6"
            ],
            "summary":"Gain 20% concealment if you move",
            "type":"Feat"
        }
    },
    "source":{
        "date":"2009-08-01",
        "name":"Core Rulebook"
    }
}
