{
    "classes": {
        "Barbarian": {
            "name": "Barbarian",
            "type": "Class",
            "summary": "<p>The barbarian is a brutal berserker from beyond the edge of civilized lands.</p>",
            "description": "<p>For some, there is only rage. In the ways of their people, in the fury of their passion, in the howl of battle, conflict is all these brutal souls know. Savages, hired muscle, masters of vicious martial techniques, they are not soldiers or professional warriorsthey are the battle possessed, creatures of slaughter and spirits of war. Known as barbarians, these warmongers know little of training, preparation, or the rules of warfare; for them, only the moment exists, with the foes that stand before them and the knowledge that the next moment might hold their death. They possess a sixth sense in regard to danger and the endurance to weather all that might entail. These brutal warriors might rise from all walks of life, both civilized and savage, though whole societies embracing such philosophies roam the wild places of the world. Within barbarians storms the primal spirit of battle, and woe to those who face their rage.</p>",
            "Role": "<p>Barbarians excel in combat, possessing the martial prowess and fortitude to take on foes seemingly far superior to themselves. With rage granting them boldness and daring beyond that of most other warriors, barbarians charge furiously into battle and ruin all who would stand in their way.</p>",
            "hitDie": "12",
            "classSkills": [
                "Acrobatics", "Climb", "Craft", "Handle Animal", "Intimidate", "Knowledge (nature)", "Perception", "Ride", "Survival", "Swim"
            ],
            "skillsPerLevel": "4",
            "progression": {
                "BAB": [
                    "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"
                ],
                "Fortitude": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Reflex": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Will": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ]
            },
            "alignmentRestrictions": ["Lawful"],
            "ageCategory": "Intuitive",
            "Class Features": {
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "description": "<p>A barbarian is proficient with all simple and martial weapons, light armor, medium armor, and shields (except tower shields).</p>",
                    "addFeats": [
                        "Simple Weapons Proficiency", "Martial Weapons Proficiency", "Light Armor Proficiency", "Medium Armor Proficiency", "Shield Proficiency"
                    ]
                },
                "Fast Movement": {
                    "name": "Fast Movement",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A barbarian's land speed is faster than the norm for her race by +10 feet. This benefit applies only when she is wearing no armor, light armor, or medium armor, and not carrying a heavy load. Apply this bonus before modifying the barbarian's speed because of any load carried or armor worn. This bonus stacks with any other bonuses to the barbarian's land speed.</p>",
                    "speed": "10",
                    "stacks": "true",
                    "conditions": {
                        "armor": [
                            "none", "light", "medium"
                        ],
                        "encumberance": ["!heavyLoad"]
                    }
                },
                "Rage": {
                    "name": "Rage",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A barbarian can call upon inner reserves of strength and ferocity, granting her additional combat prowess. Starting at 1st level, a barbarian can rage for a number of rounds per day equal to 4 + her Constitution modifier. At each level after 1st, she can rage for 2 additional rounds. Temporary increases to Constitution, such as those gained from rage and spells like bear's endurance, do not increase the total number of rounds that a barbarian can rage per day. A barbarian can enter rage as a free action. The total number of rounds of rage per day is renewed after resting for 8 hours, although these hours do not need to be consecutive.</p><p>While in rage, a barbarian gains a +4 morale bonus to her Strength and Constitution, as well as a +2 morale bonus on Will saves. In addition, she takes a –2 penalty to Armor Class. The increase to Constitution grants the barbarian 2 hit points per Hit Dice, but these disappear when the rage ends and are not lost first like temporary hit points. While in rage, a barbarian cannot use any Charisma-, Dexterity-, or Intelligence-based skills (except Acrobatics, Fly, Intimidate, and Ride) or any ability that requires patience or concentration.</p><p>A barbarian can end her rage as a free action and is fatigued after rage for a number of rounds equal to 2 times the number of rounds spent in the rage. A barbarian cannot enter a new rage while fatigued or exhausted but can otherwise enter rage multiple times during a single encounter or combat. If a barbarian falls unconscious, her rage immediately ends, placing her in peril of death.</p>"
                },
                "Rage Powers": {
                    "name": "Rage Powers",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>As a barbarian gains levels, she learns to use her rage in new ways. Starting at 2nd level, a barbarian gains a rage power. She gains another rage power for every two levels of barbarian attained after 2nd level. A barbarian gains the benefits of rage powers only while raging, and some of these powers require the barbarian to take an action first. Unless otherwise noted, a barbarian cannot select an individual power more than once.</p><p>Totem rage powers grant powers in a theme. A barbarian cannot select from more than one group of totem rage powers. For example, a barbarian that selects a beast totem rage power cannot later chose to gain any of the spirit totem rage powers.</p>",
                    "Animal Fury": {
                        "name": "Animal Fury",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>While raging, the barbarian gains a bite attack. If used as part of a full attack action, the bite attack is made at the barbarian's full base attack bonus –5. If the bite hits, it deals 1d4 points of damage (assuming the barbarian is Medium; 1d3 points of damage if Small) plus half the barbarian's Strength modifier. A barbarian can make a bite attack as part of the action to maintain or break free from a grapple. This attack is resolved before the grapple check is made. If the bite attack hits, any grapple checks made by the barbarian against the target this round are at a +2 bonus.</p>"
                    },
                    "Clear Mind": {
                        "name": "Clear Mind",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A barbarian may reroll a failed Will save. This power is used as an immediate action after the first save is attempted, but before the results are revealed by the GM. The barbarian must take the second result, even if it is worse. A barbarian must be at least 8th level before selecting this power. This power can only be used once per rage.</p>"
                    },
                    "Fearless Rage": {
                        "name": "Fearless Rage",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>While raging, the barbarian is immune to the shaken and frightened conditions. A barbarian must be at least 12th level before selecting this rage power.</p>"
                    },
                    "Guarded Stance": {
                        "name": "Guarded Stance",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian gains a +1 dodge bonus to her Armor Class against melee attacks for a number of rounds equal to the barbarian's current Constitution modifier (minimum 1). This bonus increases by +1 for every 6 levels the barbarian has attained. Activating this ability is a move action that does not provoke an attack of opportunity.</p>"
                    },
                    "Increased Damage Reduction": {
                        "name": "Increased Damage Reduction",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian's damage reduction increases by 1/—. This increase is always active while the barbarian is raging. A barbarian can select this rage power up to three times. Its effects stack. A barbarian must be at least 8th level before selecting this rage power.</p>"
                    },
                    "Internal Fortitude": {
                        "name": "Internal Fortitude",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>While raging, the barbarian is immune to the sickened and nauseated conditions. A barbarian must be at least 8th level before selecting this rage power.</p>"
                    },
                    "Intimidating Glare": {
                        "name": "Intimidating Glare",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian can make an Intimidate check against one adjacent foe as a move action. If the barbarian successfully demoralizes her opponent, the foe is shaken for 1d4 rounds + 1 round for every 5 points by which the barbarian's check exceeds the DC.</p>"
                    },
                    "Knockback": {
                        "name": "Knockback",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per round, the barbarian can make a bull rush attempt against one target in place of a melee attack. If successful, the target takes damage equal to the barbarian's Strength modifier and is moved back as normal. The barbarian does not need to move with the target if successful. This does not provoke an attack of opportunity.</p>"
                    },
                    "Low-Light Vision": {
                        "name": "Low-Light Vision",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian's senses sharpen and she gains low-light vision while raging.</p>"
                    },
                    "Mighty Swing": {
                        "name": "Mighty Swing",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian automatically confirms a critical hit. This power is used as an immediate action once a critical threat has been determined. A barbarian must be at least 12th level before selecting this power. This power can only be used once per rage.</p>"
                    },
                    "Moment of Clarity": {
                        "name": "Moment of Clarity",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian does not gain any benefits or take any of the penalties from rage for 1 round. Activating this power is a swift action. This includes the penalty to Armor Class and the restriction on what actions can be performed. This round still counts against her total number of rounds of rage per day. This power can only be used once per rage.</p>"
                    },
                    "Night Vision": {
                        "name": "Night Vision",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian's senses grow incredibly sharp while raging and she gains darkvision 60 feet. A barbarian must have low-light vision as a rage power or a racial trait to select this rage power.</p>"
                    },
                    "No Escape": {
                        "name": "No Escape",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian can move up to double her normal speed as an immediate action but she can only use this ability when an adjacent foe uses a withdraw action to move away from her. She must end her movement adjacent to the enemy that used the withdraw action. The barbarian provokes attacks of opportunity as normal during this movement. This power can only be used once per rage.</p>"
                    },
                    "Powerful Blow": {
                        "name": "Powerful Blow",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian gains a +1 bonus on a single damage roll. This bonus increases by +1 for every 4 levels the barbarian has attained. This power is used as a swift action before the roll to hit is made. This power can only be used once per rage.</p>"
                    },
                    "Quick Reflexes": {
                        "name": "Quick Reflexes",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>While raging, the barbarian can make one additional attack of opportunity per round.</p>"
                    },
                    "Raging Climber": {
                        "name": "Raging Climber",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When raging, the barbarian adds her level as an enhancement bonus on all Climb skill checks.</p>"
                    },
                    "Raging Leaper": {
                        "name": "Raging Leaper",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When raging, the barbarian adds her level as an enhancement bonus on all Acrobatics skill checks made to jump. When making a jump in this way, the barbarian is always considered to have a running start.</p>"
                    },
                    "Raging Swimmer": {
                        "name": "Raging Swimmer",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When raging, the barbarian adds her level as an enhancement bonus on all Swim skill checks.</p>"
                    },
                    "Renewed Vigor": {
                        "name": "Renewed Vigor",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>As a standard action, the barbarian heals 1d8 points of damage + her Constitution modifier. For every four levels the barbarian has attained above 4th, this amount of damage healed increases by 1d8, to a maximum of 5d8 at 20th level. A barbarian must be at least 4th level before selecting this power. This power can be used only once per day and only while raging.</p>"
                    },
                    "Rolling Dodge": {
                        "name": "Rolling Dodge",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian gains a +1 dodge bonus to her Armor Class against ranged attacks for a number of rounds equal to the barbarian's current Constitution modifier (minimum 1). This bonus increases by +1 for every 6 levels the barbarian has attained. Activating this ability is a move action that does not provoke an attack of opportunity.</p>"
                    },
                    "Roused Anger": {
                        "name": "Roused Anger",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian may enter a rage even if fatigued. While raging after using this ability, the barbarian is immune to the fatigued condition. Once this rage ends, the barbarian is exhausted for 10 minutes per round spent raging.</p>"
                    },
                    "Scent": {
                        "name": "Scent",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian gains the scent ability while raging and can use this ability to locate unseen foes (see Special Abilities for rules on the scent ability).</p>"
                    },
                    "Strength Surge": {
                        "name": "Strength Surge",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian adds her barbarian level on one Strength check or combat maneuver check, or to her Combat Maneuver Defense when an opponent attempts a maneuver against her. This power is used as an immediate action. This power can only be used once per rage.</p>"
                    },
                    "Superstition": {
                        "name": "Superstition",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian gains a +2 morale bonus on saving throws made to resist spells, supernatural abilities, and spell-like abilities. This bonus increases by +1 for every 4 levels the barbarian has attained. While raging, the barbarian cannot be a willing target of any spell and must make saving throws to resist all spells, even those cast by allies.</p>"
                    },
                    "Surprise Accuracy": {
                        "name": "Surprise Accuracy",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian gains a +1 morale bonus on one attack roll. This bonus increases by +1 for every 4 levels the barbarian has attained. This power is used as a swift action before the roll to hit is made. This power can only be used once per rage.</p>"
                    },
                    "Swift Foot": {
                        "name": "Swift Foot",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian gains a 5-foot enhancement bonus to her speed. This increase is always active while the barbarian is raging. A barbarian can select this rage power up to three times. Its effects stack.</p>"
                    },
                    "Terrifying Howl": {
                        "name": "Terrifying Howl",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian unleashes a terrifying howl as a standard action. All shaken enemies within 30 feet must make a Will save (DC equal to 10 + 1/2 the barbarian's level + the barbarian's Strength modifier) or be panicked for 1d4+1 rounds. Once an enemy has made a save versus terrifying howl (successful or not), it is immune to this power for 24 hours. A barbarian must have the intimidating glare rage power to select this rage power. A barbarian must be at least 8th level before selecting this power.</p>"
                    },
                    "Unexpected Strike": {
                        "name": "Unexpected Strike",
                        "type": "Rage Power",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>The barbarian can make an attack of opportunity against a foe that moves into any square threatened by the barbarian, regardless of whether or not that movement would normally provoke an attack of opportunity. This power can only be used once per rage. A barbarian must be at least 8th level before selecting this power.</p>"
                    }
                },
                "Uncanny Dodge": {
                    "name": "Uncanny Dodge",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, a barbarian gains the ability to react to danger before her senses would normally allow her to do so. She cannot be caught flat-footed, even if the attacker is invisible. She still loses her Dexterity bonus to AC if immobilized. A barbarian with this ability can still lose her Dexterity bonus to AC if an opponent successfully uses the feint action against her.</p><p>If a barbarian already has uncanny dodge from a different class, she automatically gains improved uncanny dodge (see below) instead.</p>"
                },
                "Trap Sense": {
                    "name": "Trap Sense",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, a barbarian gains a +1 bonus on Reflex saves made to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses increase by +1 every three barbarian levels thereafter (6th, 9th, 12th, 15th, and 18th level). Trap sense bonuses gained from multiple classes stack.</p>"
                },
                "Improved Uncanny Dodge": {
                    "name": "Improved Uncanny Dodge",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level and higher, a barbarian can no longer be flanked. This defense denies a rogue the ability to sneak attack the barbarian by flanking her, unless the attacker has at least four more rogue levels than the target has barbarian levels.</p><p>If a character already has uncanny dodge (see above) from another class, the levels from the classes that grant uncanny dodge stack to determine the minimum rogue level required to flank the character.</p>"
                },
                "Damage Reduction": {
                    "name": "Damage Reduction",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 7th level, a barbarian gains damage reduction. Subtract 1 from the damage the barbarian takes each time she is dealt damage from a weapon or a natural attack. At 10th level, and every three barbarian levels thereafter (13th, 16th, and 19th level), this damage reduction rises by 1 point. Damage reduction can reduce damage to 0 but not below 0.</p>"
                },
                "Greater Rage": {
                    "name": "Greater Rage",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 11th level, when a barbarian enters rage, the morale bonus to her Strength and Constitution increases to +6 and the morale bonus on her Will saves increases to +3.</p>"
                },
                "Indomitable Will": {
                    "name": "Indomitable Will",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While in rage, a barbarian of 14th level or higher gains a +4 bonus on Will saves to resist enchantment spells. This bonus stacks with all other modifiers, including the morale bonus on Will saves she also receives during her rage.</p>"
                },
                "Tireless Rage": {
                    "name": "Tireless Rage",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Starting at 17th level, a barbarian no longer becomes fatigued at the end of her rage.</p>"
                },
                "Mighty Rage": {
                    "name": "Mighty Rage",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 20th level, when a barbarian enters rage, the morale bonus to her Strength and Constitution increases to +8 and the morale bonus on her Will saves increases to +4.</p>"
                }
            },
            "Bard": {
                "name": "Bard",
                "type": "Class",
                "summary": "<p>The bard uses skill and spell alike to bolster his allies, confound his enemies, and build upon his fame.</p>",
                "description": "<p>Untold wonders and secrets exist for those skillful enough to discover them. Through cleverness, talent, and magic, these cunning few unravel the wiles of the world, becoming adept in the arts of persuasion, manipulation, and inspiration. Typically masters of one or many forms of artistry, bards possess an uncanny ability to know more than they should and use what they learn to keep themselves and their allies ever one step ahead of danger. Bards are quick-witted and captivating, and their skills might lead them down many paths, be they gamblers or jacks-of-all-trades, scholars or performers, leaders or scoundrels, or even all of the above. For bards, every day brings its own opportunities, adventures, and challenges, and only by bucking the odds, knowing the most, and being the best might they claim the treasures of each.</p>",
                "hitDie": "8",
                "classSkills": [
                    "Acrobatics", "Appraise", "Bluff", "Climb", "Craft", "Diplomacy", "Disguise", "Escape Artist", "Intimidate", "Knowledge (all)", "Linguistics", "Perception", "Perform", "Profession", "Sense Motive", "Sleight of Hand", "Spellcraft", "Stealth", "Use Magic Device"
                ],
                "skillsPerLevel": "6",
                "progression": {
                    "BAB": [
                        "0", "1", "2", "3", "3", "4", "5", "6", "6", "7", "8", "9", "9", "10", "11", "12", "12", "13", "14", "15"
                    ],
                    "Fortitude": [
                        "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                    ],
                    "Reflex": [
                        "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                    ],
                    "Will": [
                        "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                    ],
                    "spellsPerDay": [
                        ["1"], ["2"], ["3"], [
                            "3", "1"
                        ], [
                            "4", "2"
                        ], [
                            "4", "3"
                        ], [
                            "4", "3", "1"
                        ], [
                            "4", "4", "2"
                        ], [
                            "5", "4", "3"
                        ], [
                            "5", "4", "3", "1"
                        ], [
                            "5", "4", "4", "2"
                        ], [
                            "5", "5", "4", "3"
                        ], [
                            "5", "5", "4", "3", "1"
                        ], [
                            "5", "5", "4", "4", "2"
                        ], [
                            "5", "5", "5", "4", "3"
                        ], [
                            "5", "5", "5", "4", "3", "1"
                        ], [
                            "5", "5", "5", "4", "4", "2"
                        ], [
                            "5", "5", "5", "5", "4", "3"
                        ], [
                            "5", "5", "5", "5", "5", "4"
                        ], [
                            "5", "5", "5", "5", "5", "5"
                        ]
                    ]
                },
                "alignmentRestrictions": [],
                "ageCategory": "Self-Taught",
                "Class Features": {
                    "Weapon and Armor Proficiency": {
                        "name": "Weapon and Armor Proficiency",
                        "type": "Class Feature",

                        "description": "<p>A bard is proficient with all simple weapons, plus the longsword, rapier, sap, short sword, shortbow, and whip. Bards are also proficient with light armor and shields (except tower shields). A bard can cast bard spells while wearing light armor and use a shield without incurring the normal arcane spell failure chance. Like any other arcane spellcaster, a bard wearing medium or heavy armor incurs a chance of arcane spell failure if the spell in question has a somatic component. A multiclass bard still incurs the normal arcane spell failure chance for arcane spells received from other classes.</p>"
                    },
                    "Spells": {
                        "name": "Spells",
                        "type": "Class Feature",

                        "description": "<p>A bard casts arcane spells drawn from the bard spell list presented in Spell Lists. He can cast any spell he knows without preparing it ahead of time. Every bard spell has a verbal component (song, recitation, or music). To learn or cast a spell, a bard must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a bard's spell is 10 + the spell level + the bard's Charisma modifier.</p><p>Like other spellcasters, a bard can cast only a certain number of spells of each spell level per day. His base daily spell allotment is given on Table: Bard. In addition, he receives bonus spells per day if he has a high Charisma score (see Table: Ability Modifiers and Bonus Spells).</p><p>The bard's selection of spells is extremely limited. A bard begins play knowing four 0-level spells and two 1st-level spells of the bard's choice. At each new bard level, he gains one or more new spells, as indicated on Table: Bard Spells Known. (Unlike spells per day, the number of spells a bard knows is not affected by his Charisma score. The numbers on Table: Bard Spells Known are fixed.)</p><p>Upon reaching 5th level, and at every third bard level after that (8th, 11th, and so on), a bard can choose to learn a new spell in place of one he already knows. In effect, the bard “loses” the old spell in exchange for the new one. The new spell's level must be the same as that of the spell being exchanged, and it must be at least one level lower than the highest-level bard spell the bard can cast. A bard may swap only a single spell at any given level and must choose whether or not to swap the spell at the same time that he gains new spells known for the level.</p><p>A bard need not prepare his spells in advance. He can cast any spell he knows at any time, assuming he has not yet used up his allotment of spells per day for the spell's level.</p>"
                    },
                    "Bardic Knowledge": {
                        "name": "Bardic Knowledge",
                        "type": "Class Feature",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A bard adds half his class level (minimum 1) on all Knowledge skill checks and may make all Knowledge skill checks untrained.</p>"
                    },
                    "Bardic Performance": {
                        "name": "Bardic Performance",
                        "type": "Class Feature",

                        "description": "<p>A bard is trained to use the Perform skill to create magical effects on those around him, including himself if desired. He can use this ability for a number of rounds per day equal to 4 + his Charisma modifier. At each level after 1st a bard can use bardic performance for 2 additional rounds per day. Each round, the bard can produce any one of the types of bardic performance that he has mastered, as indicated by his level.</p><p>Starting a bardic performance is a standard action, but it can be maintained each round as a free action. Changing a bardic performance from one effect to another requires the bard to stop the previous performance and start a new one as a standard action. A bardic performance cannot be disrupted, but it ends immediately if the bard is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action to maintain it each round. A bard cannot have more than one bardic performance in effect at one time.</p><p>At 7th level, a bard can start a bardic performance as a move action instead of a standard action. At 13th level, a bard can start a bardic performance as a swift action.</p><p>Each bardic performance has audible components, visual components, or both.</p><p>If a bardic performance has audible components, the targets must be able to hear the bard for the performance to have any effect, and many such performances are language dependent (as noted in the description). A deaf bard has a 20% chance to fail when attempting to use a bardic performance with an audible component. If he fails this check, the attempt still counts against his daily limit. Deaf creatures are immune to bardic performances with audible components.</p><p>If a bardic performance has a visual component, the targets must have line of sight to the bard for the performance to have any effect. A blind bard has a 50% chance to fail when attempting to use a bardic performance with a visual component. If he fails this check, the attempt still counts against his daily limit. Blind creatures are immune to bardic performances with visual components.</p>",
                        "Countersong": {
                            "name": "Countersong",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>At 1st level, a bard learns to counter magic effects that depend on sound (but not spells that have verbal components). Each round of the countersong he makes a Perform (keyboard, percussion, wind, string, or sing) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by a sonic or language-dependent magical attack may use the bard's Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform check result proves to be higher. If a creature within range of the countersong is already under the effect of a noninstantaneous sonic or language-dependent magical attack, it gains another saving throw against the effect each round it hears the countersong, but it must use the bard's Perform skill check result for the save. Countersong does not work on effects that don't allow saves. Countersong relies on audible components.</p>"
                        },
                        "Distraction": {
                            "name": "Distraction",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>At 1st level, a bard can use his performance to counter magic effects that depend on sight. Each round of the distraction, he makes a Perform (act, comedy, dance, or oratory) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by an illusion (pattern) or illusion (figment) magical attack may use the bard's Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform skill check proves to be higher. If a creature within range of the distraction is already under the effect of a noninstantaneous illusion (pattern) or illusion (figment) magical attack, it gains another saving throw against the effect each round it sees the distraction, but it must use the bard's Perform skill check result for the save. Distraction does not work on effects that don't allow saves. Distraction relies on visual components.</p>"
                        },
                        "Fascinate": {
                            "name": "Fascinate",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>At 1st level, a bard can use his performance to cause one or more creatures to become fascinated with him. Each creature to be fascinated must be within 90 feet, able to see and hear the bard, and capable of paying attention to him. The bard must also be able to see the creatures affected. The distraction of a nearby combat or other dangers prevents this ability from working. For every three levels the bard has attained beyond 1st, he can target one additional creature with this ability.</p><p>Each creature within range receives a Will save (DC 10 + 1/2 the bard's level + the bard's Cha modifier) to negate the effect. If a creature's saving throw succeeds, the bard cannot attempt to fascinate that creature again for 24 hours. If its saving throw fails, the creature sits quietly and observes the performance for as long as the bard continues to maintain it. While fascinated, a target takes a –4 penalty on all skill checks made as reactions, such as Perception checks. Any potential threat to the target allows the target to make a new saving throw against the effect. Any obvious threat, such as someone drawing a weapon, casting a spell, or aiming a weapon at the target, automatically breaks the effect.</p><p>Fascinate is an enchantment (compulsion), mind-affecting ability. Fascinate relies on audible and visual components in order to function.</p>"
                        },
                        "Inspire Courage": {
                            "name": "Inspire Courage",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>A 1st-level bard can use his performance to inspire courage in his allies (including himself), bolstering them against fear and improving their combat abilities. To be affected, an ally must be able to perceive the bard's performance. An affected ally receives a +1 morale bonus on saving throws against charm and fear effects and a +1 competence bonus on attack and weapon damage rolls. At 5th level, and every six bard levels thereafter, this bonus increases by +1, to a maximum of +4 at 17th level. Inspire courage is a mind-affecting ability. Inspire courage can use audible or visual components. The bard must choose which component to use when starting his performance.</p>"
                        },
                        "Inspire Competence": {
                            "name": "Inspire Competence",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>A bard of 3rd level or higher can use his performance to help an ally succeed at a task. That ally must be within 30 feet and be able to hear the bard. The ally gets a +2 competence bonus on skill checks with a particular skill as long as she continues to hear the bard's performance. This bonus increases by +1 for every four levels the bard has attained beyond 3rd (+3 at 7th, +4 at 11th, +5 at 15th, and +6 at 19th). Certain uses of this ability are infeasible, such as Stealth, and may be disallowed at the GM's discretion. A bard can't inspire competence in himself. Inspire competence relies on audible components.</p>"
                        },
                        "Suggestion": {
                            "name": "Suggestion",
                            "type": "Bardic Performance",
                            "featureType": "Sp",
                            "description": "<p>A bard of 6th level or higher can use his performance to make a suggestion (as per the spell) to a creature he has already fascinated (see above). Using this ability does not disrupt the fascinate effect, but it does require a standard action to activate (in addition to the free action to continue the fascinate effect). A bard can use this ability more than once against an individual creature during an individual performance.</p><p>Making a suggestion does not count against a bard's daily use of bardic performance. A Will saving throw (DC 10 + 1/2 the bard's level + the bard's Cha modifier) negates the effect. This ability affects only a single creature. Suggestion is an enchantment (compulsion), mind affecting, language-dependent ability and relies on audible components.</p>"
                        },
                        "Dirge of Doom": {
                            "name": "Dirge of Doom",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>A bard of 8th level or higher can use his performance to foster a sense of growing dread in his enemies, causing them to become shaken. To be affected, an enemy must be within 30 feet and able to see and hear the bard's performance. The effect persists for as long as the enemy is within 30 feet and the bard continues his performance. This performance cannot cause a creature to become frightened or panicked, even if the targets are already shaken from another effect. Dirge of doom is a mind-affecting fear effect, and it relies on audible and visual components.</p>"
                        },
                        "Inspire Greatness": {
                            "name": "Inspire Greatness",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>A bard of 9th level or higher can use his performance to inspire greatness in himself or a single willing ally within 30 feet, granting extra fighting capability. For every three levels the bard attains beyond 9th, he can target an additional ally while using this performance (up to a maximum of four targets at 18th level). To inspire greatness, all of the targets must be able to see and hear the bard. A creature inspired with greatness gains 2 bonus Hit Dice (d10s), the commensurate number of temporary hit points (apply the target's Constitution modifier, if any, to these bonus Hit Dice), a +2 competence bonus on attack rolls, and a +1 competence bonus on Fortitude saves. The bonus Hit Dice count as regular Hit Dice for determining the effect of spells that are Hit Dice dependent. Inspire greatness is a mind-affecting ability and it relies on audible and visual components.</p>"
                        },
                        "Soothing Performance": {
                            "name": "Soothing Performance",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>A bard of 12th level or higher can use his performance to create an effect equivalent to a mass cure serious wounds, using the bard's level as the caster level. In addition, this performance removes the fatigued, sickened, and shaken conditions from all those affected. Using this ability requires 4 rounds of continuous performance, and the targets must be able to see and hear the bard throughout the performance. Soothing performance affects all targets that remain within 30 feet throughout the performance. Soothing performance relies on audible and visual components.</p>"
                        },
                        "Frightening Tune": {
                            "name": "Frightening Tune",
                            "type": "Bardic Performance",
                            "featureType": "Sp",
                            "description": "<p>A bard of 14th level or higher can use his performance to cause fear in his enemies. To be affected, an enemy must be able to hear the bard perform and be within 30 feet. Each enemy within range receives a Will save (DC 10 + 1/2 the bard's level + the bard's Cha modifier) to negate the effect. If the save succeeds, the creature is immune to this ability for 24 hours. If the save fails, the target becomes frightened and flees for as long as the target can hear the bard's performance. Frightening tune relies on audible components.</p>"
                        },
                        "Inspire Heroics": {
                            "name": "Inspire Heroics",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>A bard of 15th level or higher can inspire tremendous heroism in himself or a single ally within 30 feet. For every three bard levels the character attains beyond 15th, he can inspire heroics in an additional creature. To inspire heroics, all of the targets must be able to see and hear the bard. Inspired creatures gain a +4 morale bonus on saving throws and a +4 dodge bonus to AC. This effect lasts for as long as the targets are able to witness the performance. Inspire heroics is a mind-affecting ability that relies on audible and visual components.</p>"
                        },
                        "Mass Suggestion": {
                            "name": "Mass Suggestion",
                            "type": "Bardic Performance",
                            "featureType": "Sp",
                            "description": "<p>This ability functions just like suggestion, but allows a bard of 18th level or higher to make a suggestion simultaneously to any number of creatures that he has already fascinated. Mass suggestion is an enchantment (compulsion), mind-affecting, language-dependent ability that relies on audible components.</p>"
                        },
                        "Deadly Performance": {
                            "name": "Deadly Performance",
                            "type": "Bardic Performance",
                            "specialAbilityType": "Supernatural",
                            "description": "<p>A bard of 20th level or higher can use his performance to cause one enemy to die from joy or sorrow. To be affected, the target must be able to see and hear the bard perform for 1 full round and be within 30 feet. The target receives a Will save (DC 10 + 1/2 the bard's level + the bard's Cha modifier) to negate the effect. If a creature's saving throw succeeds, the target is staggered for 1d4 rounds, and the bard cannot use deadly performance on that creature again for 24 hours. If a creature's saving throw fails, it dies. Deadly performance is a mind-affecting death effect that relies on audible and visual components.</p>"
                        }
                    },
                    "Cantrips": {
                        "name": "Cantrips",
                        "type": "Class Feature",

                        "description": "<p>Bards learn a number of cantrips, or 0-level spells, as noted on Table: Bard Spells Known under “Spells Known.” These spells are cast like any other spell, but they do not consume any slots and may be used again.</p>"
                    },
                    "Versatile Performance": {
                        "name": "Versatile Performance",
                        "type": "Class Feature",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>At 2nd level, a bard can choose one type of Perform skill. He can use his bonus in that skill in place of his bonus in associated skills. When substituting in this way, the bard uses his total Perform skill bonus, including class skill bonus, in place of its associated skill's bonus, whether or not he has ranks in that skill or if it is a class skill. At 6th level, and every 4 levels thereafter, the bard can select an additional type of Perform to substitute.</p><p>The types of Perform and their associated skills are: Act (Bluff, Disguise), Comedy (Bluff, Intimidate), Dance (Acrobatics, Fly), Keyboard Instruments (Diplomacy, Intimidate), Oratory (Diplomacy, Sense Motive), Percussion (Handle Animal, Intimidate), Sing (Bluff, Sense Motive), String (Bluff, Diplomacy), and Wind (Diplomacy, Handle Animal).</p>"
                    },
                    "Well-Versed": {
                        "name": "Well-Versed",
                        "type": "Class Feature",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>At 2nd level, the bard becomes resistant to the bardic performance of others, and to sonic effects in general. The bard gains a +4 bonus on saving throws made against bardic performance, sonic, and language-dependent effects.</p>"
                    },
                    "Lore Master": {
                        "name": "Lore Master",
                        "type": "Class Feature",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>At 5th level, the bard becomes a master of lore and can take 10 on any Knowledge skill check that he has ranks in. A bard can choose not to take 10 and can instead roll normally. In addition, once per day, the bard can take 20 on any Knowledge skill check as a standard action. He can use this ability one additional time per day for every six levels he possesses beyond 5th, to a maximum of three times per day at 17th level.</p>"
                    },
                    "Jack-of-All-Trades": {
                        "name": "Jack-of-All-Trades",
                        "type": "Class Feature",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>At 10th level, the bard can use any skill, even if the skill normally requires him to be trained. At 16th level, the bard considers all skills to be class skills. At 19th level, the bard can take 10 on any skill check, even if it is not normally allowed.</p>"
                    }
                }
            }
        },
        "Bard": {
            "name": "Bard",
            "type": "Class",
            "summary": "<p>The bard uses skill and spell alike to bolster his allies, confound his enemies, and build upon his fame.</p>",
            "description": "<p>Untold wonders and secrets exist for those skillful enough to discover them. Through cleverness, talent, and magic, these cunning few unravel the wiles of the world, becoming adept in the arts of persuasion, manipulation, and inspiration. Typically masters of one or many forms of artistry, bards possess an uncanny ability to know more than they should and use what they learn to keep themselves and their allies ever one step ahead of danger. Bards are quick-witted and captivating, and their skills might lead them down many paths, be they gamblers or jacks-of-all-trades, scholars or performers, leaders or scoundrels, or even all of the above. For bards, every day brings its own opportunities, adventures, and challenges, and only by bucking the odds, knowing the most, and being the best might they claim the treasures of each.</p>",
            "hitDie": "8",
            "classSkills": [
                "Acrobatics", "Appraise", "Bluff", "Climb", "Craft", "Diplomacy", "Disguise", "Escape Artist", "Intimidate", "Knowledge (all)", "Linguistics", "Perception", "Perform", "Profession", "Sense Motive", "Sleight of Hand", "Spellcraft", "Stealth", "Use Magic Device"
            ],
            "skillsPerLevel": "6",
            "progression": {
                "BAB": [
                    "0", "1", "2", "3", "3", "4", "5", "6", "6", "7", "8", "9", "9", "10", "11", "12", "12", "13", "14", "15"
                ],
                "Fortitude": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Reflex": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Will": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "spellsPerDay": [
                    ["1"], ["2"], ["3"], [
                        "3", "1"
                    ], [
                        "4", "2"
                    ], [
                        "4", "3"
                    ], [
                        "4", "3", "1"
                    ], [
                        "4", "4", "2"
                    ], [
                        "5", "4", "3"
                    ], [
                        "5", "4", "3", "1"
                    ], [
                        "5", "4", "4", "2"
                    ], [
                        "5", "5", "4", "3"
                    ], [
                        "5", "5", "4", "3", "1"
                    ], [
                        "5", "5", "4", "4", "2"
                    ], [
                        "5", "5", "5", "4", "3"
                    ], [
                        "5", "5", "5", "4", "3", "1"
                    ], [
                        "5", "5", "5", "4", "4", "2"
                    ], [
                        "5", "5", "5", "5", "4", "3"
                    ], [
                        "5", "5", "5", "5", "5", "4"
                    ], [
                        "5", "5", "5", "5", "5", "5"
                    ]
                ]
            },
            "alignmentRestrictions": [],
            "ageCategory": "Self-Taught",
            "Class Features": {
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "description": "<p>A bard is proficient with all simple weapons, plus the longsword, rapier, sap, short sword, shortbow, and whip. Bards are also proficient with light armor and shields (except tower shields). A bard can cast bard spells while wearing light armor and use a shield without incurring the normal arcane spell failure chance. Like any other arcane spellcaster, a bard wearing medium or heavy armor incurs a chance of arcane spell failure if the spell in question has a somatic component. A multiclass bard still incurs the normal arcane spell failure chance for arcane spells received from other classes.</p>"
                },
                "Spells": {
                    "name": "Spells",
                    "type": "Class Feature",
                    "description": "<p>A bard casts arcane spells drawn from the bard spell list presented in Spell Lists. He can cast any spell he knows without preparing it ahead of time. Every bard spell has a verbal component (song, recitation, or music). To learn or cast a spell, a bard must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a bard's spell is 10 + the spell level + the bard's Charisma modifier.</p><p>Like other spellcasters, a bard can cast only a certain number of spells of each spell level per day. His base daily spell allotment is given on Table: Bard. In addition, he receives bonus spells per day if he has a high Charisma score (see Table: Ability Modifiers and Bonus Spells).</p><p>The bard's selection of spells is extremely limited. A bard begins play knowing four 0-level spells and two 1st-level spells of the bard's choice. At each new bard level, he gains one or more new spells, as indicated on Table: Bard Spells Known. (Unlike spells per day, the number of spells a bard knows is not affected by his Charisma score. The numbers on Table: Bard Spells Known are fixed.)</p><p>Upon reaching 5th level, and at every third bard level after that (8th, 11th, and so on), a bard can choose to learn a new spell in place of one he already knows. In effect, the bard “loses” the old spell in exchange for the new one. The new spell's level must be the same as that of the spell being exchanged, and it must be at least one level lower than the highest-level bard spell the bard can cast. A bard may swap only a single spell at any given level and must choose whether or not to swap the spell at the same time that he gains new spells known for the level.</p><p>A bard need not prepare his spells in advance. He can cast any spell he knows at any time, assuming he has not yet used up his allotment of spells per day for the spell's level.</p>"
                },
                "Bardic Knowledge": {
                    "name": "Bardic Knowledge",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A bard adds half his class level (minimum 1) on all Knowledge skill checks and may make all Knowledge skill checks untrained.</p>"
                },
                "Bardic Performance": {
                    "name": "Bardic Performance",
                    "type": "Class Feature",
                    "description": "<p>A bard is trained to use the Perform skill to create magical effects on those around him, including himself if desired. He can use this ability for a number of rounds per day equal to 4 + his Charisma modifier. At each level after 1st a bard can use bardic performance for 2 additional rounds per day. Each round, the bard can produce any one of the types of bardic performance that he has mastered, as indicated by his level.</p><p>Starting a bardic performance is a standard action, but it can be maintained each round as a free action. Changing a bardic performance from one effect to another requires the bard to stop the previous performance and start a new one as a standard action. A bardic performance cannot be disrupted, but it ends immediately if the bard is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action to maintain it each round. A bard cannot have more than one bardic performance in effect at one time.</p><p>At 7th level, a bard can start a bardic performance as a move action instead of a standard action. At 13th level, a bard can start a bardic performance as a swift action.</p><p>Each bardic performance has audible components, visual components, or both.</p><p>If a bardic performance has audible components, the targets must be able to hear the bard for the performance to have any effect, and many such performances are language dependent (as noted in the description). A deaf bard has a 20% chance to fail when attempting to use a bardic performance with an audible component. If he fails this check, the attempt still counts against his daily limit. Deaf creatures are immune to bardic performances with audible components.</p><p>If a bardic performance has a visual component, the targets must have line of sight to the bard for the performance to have any effect. A blind bard has a 50% chance to fail when attempting to use a bardic performance with a visual component. If he fails this check, the attempt still counts against his daily limit. Blind creatures are immune to bardic performances with visual components.</p>",
                    "Countersong": {
                        "name": "Countersong",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>At 1st level, a bard learns to counter magic effects that depend on sound (but not spells that have verbal components). Each round of the countersong he makes a Perform (keyboard, percussion, wind, string, or sing) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by a sonic or language-dependent magical attack may use the bard's Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform check result proves to be higher. If a creature within range of the countersong is already under the effect of a noninstantaneous sonic or language-dependent magical attack, it gains another saving throw against the effect each round it hears the countersong, but it must use the bard's Perform skill check result for the save. Countersong does not work on effects that don't allow saves. Countersong relies on audible components.</p>"
                    },
                    "Distraction": {
                        "name": "Distraction",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>At 1st level, a bard can use his performance to counter magic effects that depend on sight. Each round of the distraction, he makes a Perform (act, comedy, dance, or oratory) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by an illusion (pattern) or illusion (figment) magical attack may use the bard's Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform skill check proves to be higher. If a creature within range of the distraction is already under the effect of a noninstantaneous illusion (pattern) or illusion (figment) magical attack, it gains another saving throw against the effect each round it sees the distraction, but it must use the bard's Perform skill check result for the save. Distraction does not work on effects that don't allow saves. Distraction relies on visual components.</p>"
                    },
                    "Fascinate": {
                        "name": "Fascinate",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>At 1st level, a bard can use his performance to cause one or more creatures to become fascinated with him. Each creature to be fascinated must be within 90 feet, able to see and hear the bard, and capable of paying attention to him. The bard must also be able to see the creatures affected. The distraction of a nearby combat or other dangers prevents this ability from working. For every three levels the bard has attained beyond 1st, he can target one additional creature with this ability.</p><p>Each creature within range receives a Will save (DC 10 + 1/2 the bard's level + the bard's Cha modifier) to negate the effect. If a creature's saving throw succeeds, the bard cannot attempt to fascinate that creature again for 24 hours. If its saving throw fails, the creature sits quietly and observes the performance for as long as the bard continues to maintain it. While fascinated, a target takes a –4 penalty on all skill checks made as reactions, such as Perception checks. Any potential threat to the target allows the target to make a new saving throw against the effect. Any obvious threat, such as someone drawing a weapon, casting a spell, or aiming a weapon at the target, automatically breaks the effect.</p><p>Fascinate is an enchantment (compulsion), mind-affecting ability. Fascinate relies on audible and visual components in order to function.</p>"
                    },
                    "Inspire Courage": {
                        "name": "Inspire Courage",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>A 1st-level bard can use his performance to inspire courage in his allies (including himself), bolstering them against fear and improving their combat abilities. To be affected, an ally must be able to perceive the bard's performance. An affected ally receives a +1 morale bonus on saving throws against charm and fear effects and a +1 competence bonus on attack and weapon damage rolls. At 5th level, and every six bard levels thereafter, this bonus increases by +1, to a maximum of +4 at 17th level. Inspire courage is a mind-affecting ability. Inspire courage can use audible or visual components. The bard must choose which component to use when starting his performance.</p>"
                    },
                    "Inspire Competence": {
                        "name": "Inspire Competence",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>A bard of 3rd level or higher can use his performance to help an ally succeed at a task. That ally must be within 30 feet and be able to hear the bard. The ally gets a +2 competence bonus on skill checks with a particular skill as long as she continues to hear the bard's performance. This bonus increases by +1 for every four levels the bard has attained beyond 3rd (+3 at 7th, +4 at 11th, +5 at 15th, and +6 at 19th). Certain uses of this ability are infeasible, such as Stealth, and may be disallowed at the GM's discretion. A bard can't inspire competence in himself. Inspire competence relies on audible components.</p>"
                    },
                    "Suggestion": {
                        "name": "Suggestion",
                        "type": "Bardic Performance",
                        "featureType": "Sp",
                        "description": "<p>A bard of 6th level or higher can use his performance to make a suggestion (as per the spell) to a creature he has already fascinated (see above). Using this ability does not disrupt the fascinate effect, but it does require a standard action to activate (in addition to the free action to continue the fascinate effect). A bard can use this ability more than once against an individual creature during an individual performance.</p><p>Making a suggestion does not count against a bard's daily use of bardic performance. A Will saving throw (DC 10 + 1/2 the bard's level + the bard's Cha modifier) negates the effect. This ability affects only a single creature. Suggestion is an enchantment (compulsion), mind affecting, language-dependent ability and relies on audible components.</p>"
                    },
                    "Dirge of Doom": {
                        "name": "Dirge of Doom",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>A bard of 8th level or higher can use his performance to foster a sense of growing dread in his enemies, causing them to become shaken. To be affected, an enemy must be within 30 feet and able to see and hear the bard's performance. The effect persists for as long as the enemy is within 30 feet and the bard continues his performance. This performance cannot cause a creature to become frightened or panicked, even if the targets are already shaken from another effect. Dirge of doom is a mind-affecting fear effect, and it relies on audible and visual components.</p>"
                    },
                    "Inspire Greatness": {
                        "name": "Inspire Greatness",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>A bard of 9th level or higher can use his performance to inspire greatness in himself or a single willing ally within 30 feet, granting extra fighting capability. For every three levels the bard attains beyond 9th, he can target an additional ally while using this performance (up to a maximum of four targets at 18th level). To inspire greatness, all of the targets must be able to see and hear the bard. A creature inspired with greatness gains 2 bonus Hit Dice (d10s), the commensurate number of temporary hit points (apply the target's Constitution modifier, if any, to these bonus Hit Dice), a +2 competence bonus on attack rolls, and a +1 competence bonus on Fortitude saves. The bonus Hit Dice count as regular Hit Dice for determining the effect of spells that are Hit Dice dependent. Inspire greatness is a mind-affecting ability and it relies on audible and visual components.</p>"
                    },
                    "Soothing Performance": {
                        "name": "Soothing Performance",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>A bard of 12th level or higher can use his performance to create an effect equivalent to a mass cure serious wounds, using the bard's level as the caster level. In addition, this performance removes the fatigued, sickened, and shaken conditions from all those affected. Using this ability requires 4 rounds of continuous performance, and the targets must be able to see and hear the bard throughout the performance. Soothing performance affects all targets that remain within 30 feet throughout the performance. Soothing performance relies on audible and visual components.</p>"
                    },
                    "Frightening Tune": {
                        "name": "Frightening Tune",
                        "type": "Bardic Performance",
                        "featureType": "Sp",
                        "description": "<p>A bard of 14th level or higher can use his performance to cause fear in his enemies. To be affected, an enemy must be able to hear the bard perform and be within 30 feet. Each enemy within range receives a Will save (DC 10 + 1/2 the bard's level + the bard's Cha modifier) to negate the effect. If the save succeeds, the creature is immune to this ability for 24 hours. If the save fails, the target becomes frightened and flees for as long as the target can hear the bard's performance. Frightening tune relies on audible components.</p>"
                    },
                    "Inspire Heroics": {
                        "name": "Inspire Heroics",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>A bard of 15th level or higher can inspire tremendous heroism in himself or a single ally within 30 feet. For every three bard levels the character attains beyond 15th, he can inspire heroics in an additional creature. To inspire heroics, all of the targets must be able to see and hear the bard. Inspired creatures gain a +4 morale bonus on saving throws and a +4 dodge bonus to AC. This effect lasts for as long as the targets are able to witness the performance. Inspire heroics is a mind-affecting ability that relies on audible and visual components.</p>"
                    },
                    "Mass Suggestion": {
                        "name": "Mass Suggestion",
                        "type": "Bardic Performance",
                        "featureType": "Sp",
                        "description": "<p>This ability functions just like suggestion, but allows a bard of 18th level or higher to make a suggestion simultaneously to any number of creatures that he has already fascinated. Mass suggestion is an enchantment (compulsion), mind-affecting, language-dependent ability that relies on audible components.</p>"
                    },
                    "Deadly Performance": {
                        "name": "Deadly Performance",
                        "type": "Bardic Performance",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>A bard of 20th level or higher can use his performance to cause one enemy to die from joy or sorrow. To be affected, the target must be able to see and hear the bard perform for 1 full round and be within 30 feet. The target receives a Will save (DC 10 + 1/2 the bard's level + the bard's Cha modifier) to negate the effect. If a creature's saving throw succeeds, the target is staggered for 1d4 rounds, and the bard cannot use deadly performance on that creature again for 24 hours. If a creature's saving throw fails, it dies. Deadly performance is a mind-affecting death effect that relies on audible and visual components.</p>"
                    }
                },
                "Cantrips": {
                    "name": "Cantrips",
                    "type": "Class Feature",

                    "description": "<p>Bards learn a number of cantrips, or 0-level spells, as noted on Table: Bard Spells Known under “Spells Known.” These spells are cast like any other spell, but they do not consume any slots and may be used again.</p>"
                },
                "Versatile Performance": {
                    "name": "Versatile Performance",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, a bard can choose one type of Perform skill. He can use his bonus in that skill in place of his bonus in associated skills. When substituting in this way, the bard uses his total Perform skill bonus, including class skill bonus, in place of its associated skill's bonus, whether or not he has ranks in that skill or if it is a class skill. At 6th level, and every 4 levels thereafter, the bard can select an additional type of Perform to substitute.</p><p>The types of Perform and their associated skills are: Act (Bluff, Disguise), Comedy (Bluff, Intimidate), Dance (Acrobatics, Fly), Keyboard Instruments (Diplomacy, Intimidate), Oratory (Diplomacy, Sense Motive), Percussion (Handle Animal, Intimidate), Sing (Bluff, Sense Motive), String (Bluff, Diplomacy), and Wind (Diplomacy, Handle Animal).</p>"
                },
                "Well-Versed": {
                    "name": "Well-Versed",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, the bard becomes resistant to the bardic performance of others, and to sonic effects in general. The bard gains a +4 bonus on saving throws made against bardic performance, sonic, and language-dependent effects.</p>"
                },
                "Lore Master": {
                    "name": "Lore Master",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, the bard becomes a master of lore and can take 10 on any Knowledge skill check that he has ranks in. A bard can choose not to take 10 and can instead roll normally. In addition, once per day, the bard can take 20 on any Knowledge skill check as a standard action. He can use this ability one additional time per day for every six levels he possesses beyond 5th, to a maximum of three times per day at 17th level.</p>"
                },
                "Jack-of-All-Trades": {
                    "name": "Jack-of-All-Trades",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 10th level, the bard can use any skill, even if the skill normally requires him to be trained. At 16th level, the bard considers all skills to be class skills. At 19th level, the bard can take 10 on any skill check, even if it is not normally allowed.</p>"
                }
            }
        },
        "Fighter": {
            "name": "Fighter",
            "type": "Class",
            "summary": "<p>Brave and stalwart, the fighter is a master of all manner of arms and armor.</p>",
            "description": "<p>Some take up arms for glory, wealth, or revenge. Others do battle to prove themselves, to protect others, or because they know nothing else. Still others learn the ways of weaponcraft to hone their bodies in battle and prove their mettle in the forge of war. Lords of the battlefield, fighters are a disparate lot, training with many weapons or just one, perfecting the uses of armor, learning the fighting techniques of exotic masters, and studying the art of combat, all to shape themselves into living weapons. Far more than mere thugs, these skilled warriors reveal the true deadliness of their weapons, turning hunks of metal into arms capable of taming kingdoms, slaughtering monsters, and rousing the hearts of armies. Soldiers, knights, hunters, and artists of war, fighters are unparalleled champions, and woe to those who dare stand against them.</p>",
            "hitDie": "10",
            "classSkills": [
                "Climb", "Craft", "Handle Animal", "Intimidate", "Knowledge (dungeoneering)", "Knowledge (engineering)", "Profession", "Ride", "Survival", "Swim"
            ],
            "skillsPerLevel": "2",
            "progression": {
                "BAB": [
                    "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"
                ],
                "Fortitude": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Reflex": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Will": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ]
            },
            "Class Features": {
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "description": "<p>A fighter is proficient with all simple and martial weapons and with all armor (heavy, light, and medium) and shields (including tower shields).</p>",
                    "addFeats": [
                        "Simple Weapons Proficiency", "Martial Weapons Proficiency", "Light Armor Proficiency", "Medium Armor Proficiency", "Shield Proficiency"
                    ]
                },
                "Bonus Feats": {
                    "name": "Bonus Feats",
                    "type": "Class Feature",
                    "description": "<p>At 1st level, and at every even level thereafter, a fighter gains a bonus feat in addition to those gained from normal advancement (meaning that the fighter gains a feat at every level). These bonus feats must be selected from those listed as combat feats, sometimes also called \"fighter bonus feats.\"</p><p>Upon reaching 4th level, and every four levels thereafter (8th, 12th, and so on), a fighter can choose to learn a new bonus feat in place of a bonus feat he has already learned. In effect, the fighter loses the bonus feat in exchange for the new one. The old feat cannot be one that was used as a prerequisite for another feat, prestige class, or other ability. A fighter can only change one feat at any given level and must choose whether or not to swap the feat at the time he gains a new bonus feat for the level.</p>"
                },
                "Bravery": {
                    "name": "Bravery",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Starting at 2nd level, a fighter gains a +1 bonus on Will saves against fear. This bonus increases by +1 for every four levels beyond 2nd.</p>"
                },
                "Armor Training": {
                    "name": "Armor Training",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Starting at 3rd level, a fighter learns to be more maneuverable while wearing armor. Whenever he is wearing armor, he reduces the armor check penalty by 1 (to a minimum of 0) and increases the maximum Dexterity bonus allowed by his armor by 1. Every four levels thereafter (7th, 11th, and 15th), these bonuses increase by +1 each time, to a maximum –4 reduction of the armor check penalty and a +4 increase of the maximum Dexterity bonus allowed.</p><p>In addition, a fighter can also move at his normal speed while wearing medium armor. At 7th level, a fighter can move at his normal speed while wearing heavy armor.</p>"
                },
                "Weapon Training": {
                    "name": "Weapon Training",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Starting at 5th level, a fighter can select one group of weapons, as noted below. Whenever he attacks with a weapon from this group, he gains a +1 bonus on attack and damage rolls.</p><p>Every four levels thereafter (9th, 13th, and 17th), a fighter becomes further trained in another group of weapons. He gains a +1 bonus on attack and damage rolls when using a weapon from this group. In addition, the bonuses granted by previous weapon groups increase by +1 each. For example, when a fighter reaches 9th level, he receives a +1 bonus on attack and damage rolls with one weapon group and a +2 bonus on attack and damage rolls with the weapon group selected at 5th level. Bonuses granted from overlapping groups do not stack. Take the highest bonus granted for a weapon if it resides in two or more groups.</p><p>A fighter also adds this bonus to any combat maneuver checks made with weapons from this group. This bonus also applies to the fighter's Combat Maneuver Defense when defending against disarm and sunder attempts made against weapons from this group.</p>",
                    "weaponGroups": {
                        "Axes": [
                            "battleaxe", "dwarven waraxe", "greataxe", "handaxe", "heavy pick", "light pick", "orc double axe", "throwing axe"
                        ],
                        "Blades, Heavy": [
                            "bastard sword", "elven curve blade", "falchion", "greatsword", "longsword", "scimitar", "scythe", "two-bladed sword"
                        ],
                        "Blades, Light": [
                            "dagger", "kama", "kukri", "rapier", "sickle", "starknife", "short sword"
                        ],
                        "Bows": [
                            "composite longbow", "composite shortbow", "longbow", "shortbow"
                        ],
                        "Close": [
                            "gauntlet", "heavy shield", "light shield", "punching dagger", "sap", "spiked armor", "spiked gauntlet", "spiked shield", "unarmed strike"
                        ],
                        "Crossbows": [
                            "hand crossbow" ", " "heavy crossbow", "light crossbow", "heavy repeating crossbow", "light repeating crossbow"
                        ],
                        "Double": [
                            "dire flail", "dwarven urgrosh", "gnome hooked hammer", "orc double axe", "quarterstaff", "two-bladed sword"
                        ],
                        "Flails": [
                            "dire flail", "flail", "heavy flail", "morningstar", "nunchaku", "spiked chain", "whip"
                        ],
                        "Hammers": [
                            "club", "greatclub", "heavy mace", "light hammer", "light mace", "warhammer"
                        ],
                        "Monk": [
                            "kama", "nunchaku", "quarterstaff", "sai", "shuriken", "siangham", "unarmed strike"
                        ],
                        "Natural": [
                            "unarmed strike and all natural weapons", "such as bite", "claw", "gore", "tail", "wing"
                        ],
                        "Pole Arms": [
                            "glaive", "guisarme", "halberd", "ranseur"
                        ],
                        "Spears": [
                            "javelin", "lance", "longspear", "shortspear", "spear", "trident"
                        ],
                        "Thrown": [
                            "blowgun", "bolas", "club", "dagger", "dart", "halfling sling staff", "javelin", "light hammer", "net", "shortspear", "shuriken", "sling", "spear", "starknife", "throwing axe", "trident"
                        ]
                    }
                },
                "Armor Mastery": {
                    "name": "Armor Mastery",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 19th level, a fighter gains DR 5/— whenever he is wearing armor or using a shield.</p>"
                },
                "Weapon Mastery": {
                    "name": "Weapon Mastery",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 20th level, a fighter chooses one weapon, such as the longsword, greataxe, or longbow. Any attacks made with that weapon automatically confirm all critical threats and have their damage multiplier increased by 1 (×2 becomes ×3, for example). In addition, he cannot be disarmed while wielding a weapon of this type.</p>"
                }
            }
        },
        "Cleric": {
            "name": "Cleric",
            "type": "Class",
            "description": "<p>In faith and the miracles of the divine, many find a greater purpose. Called to serve powers beyond most mortal understanding, all priests preach wonders and provide for the spiritual needs of their people. Clerics are more than mere priests, though; these emissaries of the divine work the will of their deities through strength of arms and the magic of their gods. Devoted to the tenets of the religions and philosophies that inspire them, these ecclesiastics quest to spread the knowledge and influence of their faith. Yet while they might share similar abilities, clerics prove as different from one another as the divinities they serve, with some offering healing and redemption, others judging law and truth, and still others spreading conflict and corruption. The ways of the cleric are varied, yet all who tread these paths walk with the mightiest of allies and bear the arms of the gods themselves.</p>",
            "hitDie": "8",
            "classSkills": [
                "Appraise", "Craft", "Diplomacy", "Heal", "Knowledge (arcana)", "Knowledge (history)", "Knowledge (nobility)", "Knowledge (planes)", "Knowledge (religion)", "Linguistics", "Profession", "Sense Motive"
            ],
            "skillsPerLevel": "2",
            "progression": {
                "BAB": [
                    "0", "1", "2", "3", "3", "4", "5", "6", "6", "7", "8", "9", "9", "10", "11", "12", "12", "13", "14", "15"
                ],
                "Fortitude": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Reflex": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Will": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "spellsPerDay": [
                    [
                        "3", "1+1"
                    ], [
                        "4", "2+1"
                    ], [
                        "4", "2+1", "1+1"
                    ], [
                        "4", "3+1", "2+1"
                    ], [
                        "4", "3+1", "2+1", "1+1"
                    ], [
                        "4", "3+1", "3+1", "2+1"
                    ], [
                        "4", "4+1", "3+1", "2+1", "1+1"
                    ], [
                        "4", "4+1", "3+1", "3+1", "2+1"
                    ], [
                        "4", "4+1", "4+1", "3+1", "2+1", "1+1"
                    ], [
                        "4", "4+1", "4+1", "3+1", "3+1", "2+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "3+1", "2+1", "1+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "3+1", "3+1", "2+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "3+1", "2+1", "1+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "3+1", "3+1", "2+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "4+1", "3+1", "2+1", "1+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "4+1", "3+1", "3+1", "2+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1", "3+1", "2+1", "1+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1", "3+1", "3+1", "2+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1", "3+1", "3+1"
                    ], [
                        "4", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1", "4+1"
                    ]
                ]
            },
            "role": "<p></p>",
            "ageCategory": "Trained"
        },
        "Druid": {
            "name": "Druid",
            "type": "Class",
            "description": "The druid is a worshiper of all things natural—a spellcaster, a friend to animals, and a skilled shapechanger.",
            "hitDie": "8",
            "classSkills": [
                "Climb", "Craft", "Fly", "Handle Animal", "Heal", "Knowledge (geography)", "Knowledge (nature)", "Perception", "Profession", "Ride", "Spellcraft", "Survival", "Swim"
            ],
            "skillsPerLevel": "4",
            "progression": {
                "BAB": [
                    "0", "1", "2", "3", "3", "4", "5", "6", "6", "7", "8", "9", "9", "10", "11", "12", "12", "13", "14", "15"
                ],
                "Fortitude": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Reflex": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Will": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "spellsPerDay": [
                    [
                        "3", "1"
                    ], [
                        "4", "2"
                    ], [
                        "4", "2", "1"
                    ], [
                        "4", "3", "2"
                    ], [
                        "4", "3", "2", "1"
                    ], [
                        "4", "3", "3", "2"
                    ], [
                        "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "4", "3", "3"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "4", "4", "4"
                    ]
                ]
            }
            ,"Class Features": {}
        },
        "Monk": {
            "name": "Monk",
            "type": "Class",
            "summary": "<p>A student of martial arts, the monk trains his body to be his greatest weapon and defense.</p>",
            "description": "<p></p>",
            "hitDie": "8",
            "classSkills": [
                "Acrobatics", "Climb", "Craft", "Escape Artist", "Intimidate", "Knowledge (history)", "Knowledge (religion)", "Perception", "Perform", "Profession", "Ride", "Sense Motive", "Stealth", "Swim"
            ],
            "skillsPerLevel": "4",
            "progression": {
                "BAB": [
                    "0", "1", "2", "3", "3", "4", "5", "6", "6", "7", "8", "9", "9", "10", "11", "12", "12", "13", "14", "15"
                ],
                "Fortitude": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Reflex": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Will": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ]
            },
            "alignmentRestrictions": ["!Lawful"],
            "Class Features": {
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "description": "<p>Monks are proficient with the club, crossbow (light or heavy), dagger, handaxe, javelin, kama, nunchaku, quarterstaff, sai, shortspear, short sword, shuriken, siangham, sling, and spear.</p><p>Monks are not proficient with any armor or shields.</p><p>When wearing armor, using a shield, or carrying a medium or heavy load, a monk loses his AC bonus, as well as his fast movement and flurry of blows abilities.</p>"
                },
                "AC Bonus": {
                    "name": "AC Bonus",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>When unarmored and unencumbered, the monk adds his Wisdom bonus (if any) to his AC and his CMD. In addition, a monk gains a +1 bonus to AC and CMD at 4th level. This bonus increases by 1 for every four monk levels thereafter, up to a maximum of +5 at 20th level.</p><p>These bonuses to AC apply even against touch attacks or when the monk is flat-footed. He loses these bonuses when he is immobilized or helpless, when he wears any armor, when he carries a shield, or when he carries a medium or heavy load.</p>"
                },
                "Flurry of Blows": {
                    "name": "Flurry of Blows",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>Starting at 1st level, a monk can make a flurry of blows as a full-attack action. When doing so, he may make on additional attack, taking a -2 penalty on all of his attack rolls, as if using the Two-Weapon Fighting feat. These attacks can be any combination of unarmed strikes and attacks with a monk special weapon (he does not need to use two weapons to use this ability). For the purpose of these attacks, the monk's base attack bonus from his monk class levels is equal to his monk level. For all other purposes, such as qualifying for a feat or a prestige class, the monk uses his normal base attack bonus.</p><p>At 8th level, the monk can make two additional attacks when he uses flurry of blows, as if using Improved Two-Weapon Fighting (even if the monk does not meet the prerequisites for the feat).</p><p>At 15th level, the monk can make three additional attacks using flurry of blows, as if using Greater Two-Weapon Fighting (even if the monk does not meet the prerequisites for the feat).</p><p>A monk applies his full Strength bonus to his damage rolls for all successful attacks made with flurry of blows, whether the attacks are made with an off-hand or with a weapon wielded in both hands. A monk may substitute disarm, sunder, and trip combat maneuvers for unarmed attacks as part of a flurry of blows. A monk cannot use any weapon other than an unarmed strike or a special monk weapon as part of a flurry of blows. A monk with natural weapons cannot use such weapons as part of a flurry of blows, nor can he make natural attacks in addition to his flurry of blows attacks.</p>"
                },
                "Unarmed Strike": {
                    "name": "Unarmed Strike",
                    "type": "Class Feature",
                    "description": "<p>At 1st level, a monk gains Improved Unarmed Strike as a bonus feat. A monk's attacks may be with fist, elbows, knees, and feet. This means that a monk may make unarmed strikes with his hands full. There is no such thing as an off-hand attack for a monk striking unarmed. A monk may thus apply his full Strength bonus on damage rolls for all his unarmed strikes.</p><p>Usually a monk's unarmed strikes deal lethal damage, but he can choose to deal nonlethal damage instead with no penalty on his attack roll. He has the same choice to deal lethal or nonlethal damage while grappling.</p><p>A monk's unarmed strike is treated as both a manufactured weapon and a natural weapon for the purpose of spells and effects that enhance or improve either manufactured weapons or natural weapons.</p><p>A monk also deals more damage with his unarmed strikes than a normal person would, as shown above on Table: Monk. The unarmed damage values listed on Table: Monk is for Medium monks. A Small monk deals less damage than the amount given there with his unarmed attacks, while a Large monk deals more damage; see Small or Large Monk Unarmed Damage on the table given below.</p><table><caption>Small or Large Monk Unarmed Damage</caption><th><td>Level</td><td>Damage (Small Monk)</td><td>Damage (Large Monk)</td></th><tr><td>1st–3rd</td><td>1d4</td><td>1d8</td></tr><tr><td>4th–7th</td><td>1d6</td><td>2d6</td></tr><tr><td>8th–11th</td><td>1d8</td><td>2d8</td></tr><tr><td>12th–15th</td><td>1d10</td><td>3d6</td></tr><tr><td>16th–19th</td><td>2d6</td><td>3d8</td></tr><tr><td>20th</td><td>2d8</td><td>4d8</td></tr></table>"
                },
                "Bonus Feat": {
                    "name": "Bonus Feat",
                    "type": "Class Feature",
                    "description": "<p>At 1st level, 2nd level, and every 4 levels thereafter, a monk may select a bonus feat. These feats must be taken from the following list: Catch Off-Guard, Combat Reflexes, Deflect Arrows, Dodge, Improved Grapple, Scorpion Style, and Throw Anything. At 6th level, the following feats are added to the list: Gorgon's Fist, Improved Bull Rush, Improved Disarm, Improved Feint, Improved Trip, and Mobility. At 10th level, the following feats are added to the list: Improved Critical, Medusa's Wrath, Snatch Arrows, and Spring Attack. A monk need not have any of the prerequisites normally required for these feats to select them.</p>"
                },
                "Stunning Fist": {
                    "name": "Stunning Fist",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 1st level, the monk gains Stunning Fist as a bonus feat, even if he does not meet the prerequisites. At 4th level, and every 4 levels thereafter, the monk gains the ability to apply a new condition to the target of his Stunning Fist. This condition replaces stunning the target for 1 round, and a successful saving throw still negates the effect. At 4th level, he can choose to make the target fatigued. At 8th level, he can make the target sickened for 1 minute. At 12th level, he can make the target staggered for 1d6+1 rounds. At 16th level, he can permanently blind or deafen the target. At 20th level, he can paralyze the target for 1d6+1 rounds. The monk must choose which condition will apply before the attack roll is made. These effects do not stack with themselves (a creature sickened by Stunning Fist cannot become nauseated if hit by Stunning Fist again), but additional hits do increase the duration.</p>"
                },
                "Evasion": {
                    "name": "Evasion",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 2nd level or higher, a monk can avoid damage from many area-effect attacks. If a monk makes a successful Reflex saving throw against an attack that normally deals half damage on a successful save, he instead takes no damage. Evasion can be used only if a monk is wearing light armor or no armor. A helpless monk does not gain the benefit of evasion.</p>"
                },
                "Fast Movement": {
                    "name": "Fast Movement",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 3rd level, a monk gains an enhancement bonus to his land speed, as shown on Table: Monk. A monk in armor or carrying a medium or heavy load loses this extra speed.</p>"
                },
                "Maneuver Training": {
                    "name": "Maneuver Training",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 3rd level, a monk uses his monk level in place of his base attack bonus when calculating his Combat Maneuver Bonus. Base attack bonuses granted from other classes are unaffected and are added normally.</p>"
                },
                "Still Mind": {
                    "name": "Still Mind",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>A monk of 3rd level or higher gains a +2 bonus on saving throws against enchantment spells and effects.</p>"
                },
                "Ki Pool": {
                    "name": "Ki Pool",
                    "type": "Class Feature",
                    "featureType": "Supernatural",
                    "description": "<p>At 4th level, a monk gains a pool of ki points, supernatural energy he can use to accomplish amazing feats. The number of points in a monk's ki pool is equal to 1/2 his monk level + his Wisdom modifier. As long as he has at least 1 point in his ki pool, he can make a ki strike. At 4th level, ki strike allows his unarmed attacks to be treated as magic weapons for the purpose of overcoming damage reduction. At 7th level, his unarmed attacks are also treated as cold iron and silver for the purpose of overcoming damage reduction. At 10th level, his unarmed attacks are also treated as lawful weapons for the purpose of overcoming damage reduction. At 16th level, his unarmed attacks are treated as adamantine weapons for the purpose of overcoming damage reduction and bypassing hardness.</p><p>By spending 1 point from his ki pool, a monk can make one additional attack at his highest attack bonus when making a flurry of blows attack. In addition, he can spend 1 point to increase his speed by 20 feet for 1 round. Finally, a monk can spend 1 point from his ki pool to give himself a +4 dodge bonus to AC for 1 round. Each of these powers is activated as a swift action. A monk gains additional powers that consume points from his ki pool as he gains levels.</p><p>The ki pool is replenished each morning after 8 hours of rest or meditation; these hours do not need to be consecutive.</p>"
                },
                "Slow Fall": {
                    "name": "Slow Fall",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 4th level or higher, a monk within arm's reach of a wall can use it to slow his descent. When first gaining this ability, he takes damage as if the fall were 20 feet shorter than it actually is. The monk's ability to slow his fall (that is, to reduce the effective distance of the fall when next to a wall) improves with his monk level until at 20th level he can use a nearby wall to slow his descent and fall any distance without harm.</p>"
                },
                "High Jump": {
                    "name": "High Jump",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 5th level, a monk adds his level to all Acrobatics checks made to jump, both for vertical jumps and horizontal jumps. In addition, he always counts as having a running start when making jump checks using Acrobatics. By spending 1 point from his ki pool as a swift action, a monk gains a +20 bonus on Acrobatics checks made to jump for 1 round.</p>"
                },
                "Purity of Body": {
                    "name": "Purity of Body",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 5th level, a monk gains immunity to all diseases, including supernatural and magical diseases.</p>"
                },
                "Wholeness of Body": {
                    "name": "Wholeness of Body",
                    "type": "Class Feature",
                    "featureType": "Supernatural",
                    "description": "<p>At 7th level or higher, a monk can heal his own wounds as a standard action. He can heal a number of hit points of damage equal to his monk level by using 2 points from his ki pool.</p>"
                },
                "Improved Evasion": {
                    "name": "Improved Evasion",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 9th level, a monk's evasion ability improves. He still takes no damage on a successful Reflex saving throw against attacks, but henceforth he takes only half damage on a failed save. A helpless monk does not gain the benefit of improved evasion.</p>"
                },
                "Diamond Body": {
                    "name": "Diamond Body",
                    "type": "Class Feature",
                    "featureType": "Supernatural",
                    "description": "<p>At 11th level, a monk gains immunity to poisons of all kinds.</p>"
                },
                "Abundant Step": {
                    "name": "Abundant Step",
                    "type": "Class Feature",
                    "featureType": "Supernatural",
                    "description": "<p>At 12th level or higher, a monk can slip magically between spaces, as if using the spell dimension door. Using this ability is a move action that consumes 2 points from his ki pool. His caster level for this effect is equal to his monk level. He cannot take other creatures with him when he uses this ability.</p>"
                },
                "Diamond Soul": {
                    "name": "Diamond Soul",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 13th level, a monk gains spell resistance equal to his current monk level + 10. In order to affect the monk with a spell, a spellcaster must get a result on a caster level check (1d20 + caster level) that equals or exceeds the monk's spell resistance.</p>"
                },
                "Quivering Palm": {
                    "name": "Quivering Palm",
                    "type": "Class Feature",
                    "featureType": "Supernatural",
                    "description": "<p>Starting at 15th level, a monk can set up vibrations within the body of another creature that can thereafter be fatal if the monk so desires. He can use this quivering palm attack once per day, and he must announce his intent before making his attack roll. Creatures immune to critical hits cannot be affected. Otherwise, if the monk strikes successfully and the target takes damage from the blow, the quivering palm attack succeeds. Thereafter, the monk can try to slay the victim at any later time, as long as the attempt is made within a number of days equal to his monk level. To make such an attempt, the monk merely wills the target to die (a free action), and unless the target makes a Fortitude saving throw (DC 10 + 1/2 the monk's level + the monk's Wis modifier), it dies. If the saving throw is successful, the target is no longer in danger from that particular quivering palm attack, but it may still be affected by another one at a later time. A monk can have no more than 1 quivering palm in effect at one time. If a monk uses quivering palm while another is still in effect, the previous effect is negated.</p>"
                },
                "Timeless Body": {
                    "name": "Timeless Body",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>At 17th level, a monk no longer takes penalties to his ability scores for aging and cannot be magically aged. Any such penalties that he has already taken, however, remain in place. Age bonuses still accrue, and the monk still dies of old age when his time is up.</p>"
                },
                "Tongue of the Sun and Moon": {
                    "name": "Tongue of the Sun and Moon",
                    "type": "Class Feature",
                    "featureType": "Extraordinary",
                    "description": "<p>A monk of 17th level or higher can speak with any living creature.</p>"
                },
                "Empty Body": {
                    "name": "Empty Body",
                    "type": "Class Feature",
                    "featureType": "Supernatural",
                    "description": "<p>At 19th level, a monk gains the ability to assume an ethereal state for 1 minute as though using the spell etherealness. Using this ability is a move action that consumes 3 points from his ki pool. This ability only affects the monk and cannot be used to make other creatures ethereal.</p>"
                },
                "Perfect Self": {
                    "name": "Perfect Self",
                    "type": "Class Feature",
                    "description": "<p>At 20th level, a monk becomes a magical creature. He is forevermore treated as an outsider rather than as a humanoid (or whatever the monk's creature type was) for the purpose of spells and magical effects. Additionally, the monk gains damage reduction 10/chaotic, which allows him to ignore the first 10 points of damage from any attack made by a nonchaotic weapon or by any natural attack made by a creature that doesn't have similar damage reduction. Unlike other outsiders, the monk can still be brought back from the dead as if he were a member of his previous creature type.</p>"
                }
            }
        },
        "Paladin": {
            "name": "Paladin",
            "type": "Class",
            "summary": "<p>The paladin is the knight in shining armor, a devoted follower of law and good.</p>",
            "description": "<p>Through a select, worthy few shines the power of the divine. Called paladins, these noble souls dedicate their swords and lives to the battle against evil. Knights, crusaders, and law-bringers, paladins seek not just to spread divine justice but to embody the teachings of the virtuous deities they serve. In pursuit of their lofty goals, they adhere to ironclad laws of morality and discipline. As reward for their righteousness, these holy champions are blessed with boons to aid them in their quests: powers to banish evil, heal the innocent, and inspire the faithful. Although their convictions might lead them into conflict with the very souls they would save, paladins weather endless challenges of faith and dark temptations, risking their lives to do right and fighting to bring about a brighter future.</p>",
            "hitDie": "10",
            "classSkills": [
                "Craft", "Diplomacy", "Handle Animal", "Heal", "Knowledge (nobility)", "Knowledge (religion)", "Profession", "Ride", "Sense Motive", "Spellcraft"
            ],
            "skillsPerLevel": "2",
            "alignmentRestrictions": [
                "!Lawful", "!Good"
            ],
            "progression": {
                "BAB": [
                    "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"
                ],
                "Fortitude": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Reflex": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Will": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "spellsPerDay": [
                    [], [], [], ["0"], ["1"], ["1"], [
                        "1", "0"
                    ], [
                        "1", "1"
                    ], [
                        "2", "1"
                    ], [
                        "2", "1", "0"
                    ], [
                        "2", "1", "1"
                    ], [
                        "2", "2", "1"
                    ], [
                        "3", "2", "1", "0"
                    ], [
                        "3", "2", "1", "1"
                    ], [
                        "3", "2", "2", "1"
                    ], [
                        "3", "3", "2", "1"
                    ], [
                        "4", "3", "2", "1"
                    ], [
                        "4", "3", "2", "2"
                    ], [
                        "4", "3", "3", "2"
                    ], [
                        "4", "4", "3", "3"
                    ]
                ]
            },
            "Class Features": {
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>Paladins are proficient with all simple and martial weapons, with all types of armor (heavy, medium, and light), and with shields (except tower shields).</p>"
                },
                "Aura of Good": {
                    "name": "Aura of Good",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>The power of a paladin's aura of good (see the detect good spell) is equal to her paladin level.</p>"
                },
                "Detect Evil": {
                    "name": "Detect Evil",
                    "type": "Class Feature",
                    "featureType": "Sp",
                    "description": "<p>At will, a paladin can use detect evil, as the spell. A paladin can, as a move action, concentrate on a single item or individual within 60 feet and determine if it is evil, learning the strength of its aura as if having studied it for 3 rounds. While focusing on one individual or object, the paladin does not detect evil in any other object or individual within range.</p>"
                },
                "Smite Evil": {
                    "name": "Smite Evil",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>Once per day, a paladin can call out to the powers of good to aid her in her struggle against evil. As a swift action, the paladin chooses one target within sight to smite. If this target is evil, the paladin adds her Charisma bonus (if any) to her attack rolls and adds her paladin level to all damage rolls made against the target of her smite. If the target of smite evil is an outsider with the evil subtype, an evil-aligned dragon, or an undead creature, the bonus to damage on the first successful attack increases to 2 points of damage per level the paladin possesses. Regardless of the target, smite evil attacks automatically bypass any DR the creature might possess.</p><p>In addition, while smite evil is in effect, the paladin gains a deflection bonus equal to her Charisma modifier (if any) to her AC against attacks made by the target of the smite. If the paladin targets a creature that is not evil, the smite is wasted with no effect.</p><p>The smite evil effect remains until the target of the smite is dead or the next time the paladin rests and regains her uses of this ability. At 4th level, and at every three levels thereafter, the paladin may smite evil one additional time per day, as indicated on Table: Paladin, to a maximum of seven times per day at 19th level.</p>"
                },
                "Divine Grace": {
                    "name": "Divine Grace",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 2nd level, a paladin gains a bonus equal to her Charisma bonus (if any) on all saving throws.</p>"
                },
                "Lay On Hands": {
                    "name": "Lay On Hands",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>Beginning at 2nd level, a paladin can heal wounds (her own or those of others) by touch. Each day she can use this ability a number of times equal to 1/2 her paladin level plus her Charisma modifier. With one use of this ability, a paladin can heal 1d6 hit points of damage for every two paladin levels she possesses. Using this ability is a standard action, unless the paladin targets herself, in which case it is a swift action. Despite the name of this ability, a paladin only needs one free hand to use this ability.</p><p>Alternatively, a paladin can use this healing power to deal damage to undead creatures, dealing 1d6 points of damage for every two levels the paladin possesses. Using lay on hands in this way requires a successful melee touch attack and doesn't provoke an attack of opportunity. Undead do not receive a saving throw against this damage.</p>"
                },
                "Aura of Courage": {
                    "name": "Aura of Courage",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 3rd level, a paladin is immune to fear (magical or otherwise). Each ally within 10 feet of her gains a +4 morale bonus on saving throws against fear effects. This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
                },
                "Divine Health": {
                    "name": "Divine Health",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 3rd level, a paladin is immune to all diseases, including supernatural and magical diseases, including mummy rot.</p>"
                },
                "Mercy": {
                    "name": "Mercy",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 3rd level, and every three levels thereafter, a paladin can select one mercy. Each mercy adds an effect to the paladin's lay on hands ability. Whenever the paladin uses lay on hands to heal damage to one target, the target also receives the additional effects from all of the mercies possessed by the paladin. A mercy can remove a condition caused by a curse, disease, or poison without curing the affliction. Such conditions return after 1 hour unless the mercy actually removes the affliction that causes the condition.<p>At 3rd level, the paladin can select from the following initial mercies.</p><li>Fatigued: The target is no longer fatigued.</li><li>Shaken: The target is no longer shaken.</li><li>Sickened: The target is no longer sickened.</li><p>At 6th level, a paladin adds the following mercies to the list of those that can be selected.</p><ul><li>Dazed: The target is no longer dazed.</li><li>Diseased: The paladin's lay on hands ability also acts as remove disease, using the paladin's level as the caster level.</li><li>Staggered: The target is no longer staggered, unless the target is at exactly 0 hit points.</li></ul><p>At 9th level, a paladin adds the following mercies to the list of those that can be selected.</p><ul><li>Cursed: The paladin's lay on hands ability also acts as remove curse, using the paladin's level as the caster level.</li><li>Exhausted: The target is no longer exhausted. The paladin must have the fatigue mercy before selecting this mercy.</li><li>Frightened: The target is no longer frightened. The paladin must have the shaken mercy before selecting this mercy.</li><li>Nauseated: The target is no longer nauseated. The paladin must have the sickened mercy before selecting this mercy.</li><li>Poisoned: The paladin's lay on hands ability also acts as neutralize poison, using the paladin's level as the caster level.</li></ul><p>At 12th level, a paladin adds the following mercies to the list of those that can be selected.</p><ul><li>Blinded: The target is no longer blinded.</li><li>Deafened: The target is no longer deafened.</li><li>Paralyzed: The target is no longer paralyzed.</li><li>Stunned: The target is no longer stunned.</li></ul><p>These abilities are cumulative. For example, a 12th-level paladin's lay on hands ability heals 6d6 points of damage and might also cure fatigued and exhausted conditions as well as removing diseases and neutralizing poisons. Once a condition or spell effect is chosen, it can't be changed.</p></p>"
                },
                "Channel Positive Energy": {
                    "name": "Channel Positive Energy",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>When a paladin reaches 4th level, she gains the supernatural ability to channel positive energy like a cleric. Using this ability consumes two uses of her lay on hands ability. A paladin uses her level as her effective cleric level when channeling positive energy. This is a Charisma-based ability.</p>"
                },
                "Spells": {
                    "name": "Spells",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>Beginning at 4th level, a paladin gains the ability to cast a small number of divine spells which are drawn from the paladin spell list presented in Spell Lists. A paladin must choose and prepare her spells in advance.</p><p>To prepare or cast a spell, a paladin must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a paladin's spell is 10 + the spell level + the paladin's Charisma modifier.</p><p>Like other spellcasters, a paladin can cast only a certain number of spells of each spell level per day. Her base daily spell allotment is given on Table: Paladin. In addition, she receives bonus spells per day if she has a high Charisma score (see Table: Ability Modifiers and Bonus Spells). When Table: Paladin indicates that the paladin gets 0 spells per day of a given spell level, she gains only the bonus spells she would be entitled to based on her Charisma score for that spell level.</p><p>A paladin must spend 1 hour each day in quiet prayer and meditation to regain her daily allotment of spells. A paladin may prepare and cast any spell on the paladin spell list, provided that she can cast spells of that level, but she must choose which spells to prepare during her daily meditation.</p><p>Through 3rd level, a paladin has no caster level. At 4th level and higher, her caster level is equal to her paladin level – 3.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Sp",
                    "description": "<p>Upon reaching 5th level, a paladin forms a divine bond with her god. This bond can take one of two forms. Once the form is chosen, it cannot be changed.</p><p>The first type of bond allows the paladin to enhance her weapon as a standard action by calling upon the aid of a celestial spirit for 1 minute per paladin level. When called, the spirit causes the weapon to shed light as a torch. At 5th level, this spirit grants the weapon a +1 enhancement bonus. For every three levels beyond 5th, the weapon gains another +1 enhancement bonus, to a maximum of +6 at 20th level. These bonuses can be added to the weapon, stacking with existing weapon bonuses to a maximum of +5, or they can be used to add any of the following weapon properties: axiomatic, brilliant energy, defending, disruption, flaming, flaming burst, holy, keen, merciful, and speed. Adding these properties consumes an amount of bonus equal to the property's cost (see Table: Melee Weapon Special Abilities). These bonuses are added to any properties the weapon already has, but duplicate abilities do not stack. If the weapon is not magical, at least a +1 enhancement bonus must be added before any other properties can be added. The bonus and properties granted by the spirit are determined when the spirit is called and cannot be changed until the spirit is called again. The celestial spirit imparts no bonuses if the weapon is held by anyone other than the paladin but resumes giving bonuses if returned to the paladin. These bonuses apply to only one end of a double weapon. A paladin can use this ability once per day at 5th level, and one additional time per day for every four levels beyond 5th, to a total of four times per day at 17th level.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.The second type of bond allows a paladin to gain the service of an unusually intelligent, strong, and loyal steed to serve her in her crusade against evil. This mount is usually a heavy horse (for a Medium paladin) or a pony (for a Small paladin), although more exotic mounts, such as a boar, camel, or dog are also suitable. This mount functions as a druid's animal companion, using the paladin's level as her effective druid level. Bonded mounts have an Intelligence of at least 6.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.Once per day, as a full-round action, a paladin may magically call her mount to her side. This ability is the equivalent of a spell of a level equal to one-third the paladin's level. The mount immediately appears adjacent to the paladin. A paladin can use this ability once per day at 5th level, and one additional time per day for every 4 levels thereafter, for a total of four times per day at 17th level.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.At 11th level, the mount gains the celestial template and becomes a magical beast for the purposes of determining which spells affect it. At 15th level, a paladin's mount gains spell resistance equal to the paladin's level + 11.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.Should the paladin's mount die, the paladin may not summon another mount for 30 days or until she gains a paladin level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.</p>"
                },
                "Aura of Resolve": {
                    "name": "Aura of Resolve",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 8th level, a paladin is immune to charm spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against charm effects.</p><p>This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
                },
                "Aura of Justice": {
                    "name": "Aura of Justice",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, a paladin can expend two uses of her smite evil ability to grant the ability to smite evil to all allies within 10 feet, using her bonuses. Allies must use this smite evil ability by the start of the paladin's next turn and the bonuses last for 1 minute. Using this ability is a free action. Evil creatures gain no benefit from this ability.</p>"
                },
                "Aura of Faith": {
                    "name": "Aura of Faith",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 14th level, a paladin's weapons are treated as good-aligned for the purposes of overcoming damage reduction. Any attack made against an enemy within 10 feet of her is treated as good-aligned for the purposes of overcoming damage reduction.</p><p>This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
                },
                "Aura of Righteousness": {
                    "name": "Aura of Righteousness",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 17th level, a paladin gains DR 5/evil and immunity to compulsion spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against compulsion effects.</p><p>This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
                },
                "Holy Champion": {
                    "name": "Holy Champion",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 20th level, a paladin becomes a conduit for the power of her god. Her DR increases to 10/evil. Whenever she uses smite evil and successfully strikes an evil outsider, the outsider is also subject to a banishment, using her paladin level as the caster level (her weapon and holy symbol automatically count as objects that the subject hates). After the banishment effect and the damage from the attack is resolved, the smite immediately ends. In addition, whenever she channels positive energy or uses lay on hands to heal a creature, she heals the maximum possible amount.</p>"
                },
                "Code of Conduct": {
                    "name": "Code of Conduct",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>A paladin must be of lawful good alignment and loses all class features except proficiencies if she ever willingly commits an evil act.</p><p>Additionally, a paladin's code requires that she respect legitimate authority, act with honor (not lying, not cheating, not using poison, and so forth), help those in need (provided they do not use the help for evil or chaotic ends), and punish those who harm or threaten innocents</p>"
                },
                "Associates": {
                    "name": "Associates",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>While she may adventure with good or neutral allies, a paladin avoids working with evil characters or with anyone who consistently offends her moral code. Under exceptional circumstances, a paladin can ally with evil associates, but only to defeat what she believes to be a greater evil. A paladin should seek an atonement spell periodically during such an unusual alliance, and should end the alliance immediately should she feel it is doing more harm than good. A paladin may accept only henchmen, followers, or cohorts who are lawful good.</p>"
                }
            }
        },
        "Ranger": {
            "name": "Ranger",
            "type": "Class",
            "description": "A tracker and hunter, the ranger is a creature of the wild and of tracking down his favored foes.",
            "hitDie": "10",
            "classSkills": [
                "Climb", "Craft", "Handle Animal", "Heal", "Intimidate", "Knowledge (dungeoneering)", "Knowledge (geography)", "Knowledge (nature)", "Perception", "Profession", "Ride", "Spellcraft", "Stealth", "Survival", "Swim"
            ],
            "skillsPerLevel": "6",
            "progression": {
                "BAB": [
                    "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"
                ],
                "Fortitude": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Reflex": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Will": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "spellsPerDay": [
                    [], [], [], ["0"], ["1"], ["1"], [
                        "1", "0"
                    ], [
                        "1", "1"
                    ], [
                        "2", "1"
                    ], [
                        "2", "1", "0"
                    ], [
                        "2", "1", "1"
                    ], [
                        "2", "2", "1"
                    ], [
                        "3", "2", "1", "0"
                    ], [
                        "3", "2", "1", "1"
                    ], [
                        "3", "2", "2", "1"
                    ], [
                        "3", "3", "2", "1"
                    ], [
                        "4", "3", "2", "1"
                    ], [
                        "4", "3", "2", "2"
                    ], [
                        "4", "3", "3", "2"
                    ], [
                        "4", "4", "3", "3"
                    ]
                ]
            }
            ,"Class Features": {}
        },
        "Rogue": {
            "name": "Rogue",
            "type": "Class",
            "summary": "<p>The rogue is a thief and a scout, an opportunist capable of delivering brutal strikes against unwary foes.</p>",
            "description": "<p>Life is an endless adventure for those who live by their wits. Ever just one step ahead of danger, rogues bank on their cunning, skill, and charm to bend fate to their favor. Never knowing what to expect, they prepare for everything, becoming masters of a wide variety of skills, training themselves to be adept manipulators, agile acrobats, shadowy stalkers, or masters of any of dozens of other professions or talents. Thieves and gamblers, fast talkers and diplomats, bandits and bounty hunters, and explorers and investigators all might be considered rogues, as well as countless other professions that rely upon wits, prowess, or luck. Although many rogues favor cities and the innumerable opportunities of civilization, some embrace lives on the road, journeying far, meeting exotic people, and facing fantastic danger in pursuit of equally fantastic riches. In the end, any who desire to shape their fates and live life on their own terms might come to be called rogues.</p>",
            "hitDie": "8",
            "classSkills": [
                "Acrobatics", "Appraise", "Bluff", "Climb", "Craft", "Diplomacy", "Disable Device", "Disguise", "Escape Artist", "Intimidate", "Knowledge (dungeoneering)", "Knowledge (local)", "Linguistics", "Perception", "Perform", "Profession", "Sense Motive", "Sleight of Hand", "Stealth", "Swim", "Use Magic Device"
            ],
            "skillsPerLevel": "8",
            "progression": {
                "BAB": [
                    "0", "1", "2", "3", "3", "4", "5", "6", "6", "7", "8", "9", "9", "10", "11", "12", "12", "13", "14", "15"
                ],
                "Fortitude": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Reflex": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "Will": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ]
            },
            "Class Features": {
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "description": "<p>Rogues are proficient with all simple weapons, plus the hand crossbow, rapier, sap, shortbow, and short sword. They are proficient with light armor, but not with shields.</p>"
                },
                "Sneak Attack": {
                    "name": "Sneak Attack",
                    "type": "Class Feature",
                    "description": "<p>If a rogue can catch an opponent when he is unable to defend himself effectively from her attack, she can strike a vital spot for extra damage.The rogue's attack deals extra damage anytime her target would be denied a Dexterity bonus to AC (whether the target actually has a Dexterity bonus or not), or when the rogue flanks her target. This extra damage is 1d6 at 1st level, and increases by 1d6 every two rogue levels thereafter. Should the rogue score a critical hit with a sneak attack, this extra damage is not multiplied. Ranged attacks can count as sneak attacks only if the target is within 30 feet.<p></p>With a weapon that deals nonlethal damage (like a sap, whip, or an unarmed strike), a rogue can make a sneak attack that deals nonlethal damage instead of lethal damage. She cannot use a weapon that deals lethal damage to deal nonlethal damage in a sneak attack, not even with the usual –4 penalty.<p></p>The rogue must be able to see the target well enough to pick out a vital spot and must be able to reach such a spot. A rogue cannot sneak attack while striking a creature with concealment.</p>"
                },
                "Trapfinding": {
                    "name": "Trapfinding",
                    "type": "Class Feature",
                    "description": "<p>A rogue adds 1/2 her level to Perception skill checks made to locate traps and to Disable Device skill checks (minimum +1). A rogue can use Disable Device to disarm magic traps.</p>"
                },
                "Evasion": {
                    "name": "Evasion",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level and higher, a rogue can avoid even magical and unusual attacks with great agility. If she makes a successful Reflex saving throw against an attack that normally deals half damage on a successful save, she instead takes no damage. Evasion can be used only if the rogue is wearing light armor or no armor. A helpless rogue does not gain the benefit of evasion.</p>"
                },
                "Rogue Talents": {
                    "name": "Rogue Talents",
                    "type": "Class Feature",
                    "description": "<p>As a rogue gains experience, she learns a number of talents that aid her and confound her foes. Starting at 2nd level, a rogue gains one rogue talent. She gains an additional rogue talent for every 2 levels of rogue attained after 2nd level. A rogue cannot select an individual talent more than once.<p></p>Talents marked with an asterisk add effects to a rogue's sneak attack. Only one of these talents can be applied to an individual attack and the decision must be made before the attack roll is made.</p>",
                    "Bleeding Attack": {
                        "name": "Bleeding Attack",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this ability can cause living opponents to bleed by hitting them with a sneak attack. This attack causes the target to take 1 additional point of damage each round for each die of the rogue's sneak attack (e.g., 4d6 equals 4 points of bleed). Bleeding creatures take that amount of damage every round at the start of each of their turns. The bleeding can be stopped by a DC 15 Heal check or the application of any effect that heals hit point damage. Bleeding damage from this ability does not stack with itself. Bleeding damage bypasses any damage reduction the creature might possess.</p>"
                    },
                    "Combat Trick": {
                        "name": "Combat Trick",
                        "type": "Rogue Talent",
                        "description": "<p>A rogue that selects this talent gains a bonus combat feat (see Feats).</p>"
                    },
                    "Fast Stealth": {
                        "name": "Fast Stealth",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>This ability allows a rogue to move at full speed using the Stealth skill without penalty.</p>"
                    },
                    "Finesse Rogue": {
                        "name": "Finesse Rogue",
                        "type": "Rogue Talent",
                        "description": "<p>A rogue that selects this talent gains Weapon Finesse as a bonus feat.</p>"
                    },
                    "Ledge Walker": {
                        "name": "Ledge Walker",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>This ability allows a rogue to move along narrow surfaces at full speed using the Acrobatics skill without penalty. In addition, a rogue with this talent is not flat-footed when using Acrobatics to move along narrow surfaces.</p>"
                    },
                    "Major Magic": {
                        "name": "Major Magic",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Spell-like",
                        "description": "<p>A rogue with this talent gains the ability to cast a 1st-level spell from the sorcerer/wizard spell list two times a day as a spell-like ability. The caster level for this ability is equal to the rogue's level. The save DC for this spell is 11 + the rogue's Intelligence modifier. The rogue must have an Intelligence of at least 11 to select this talent. A rogue must have the minor magic rogue talent before choosing this talent.</p>"
                    },
                    "Minor Magic": {
                        "name": "Minor Magic",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Spell-like",
                        "description": "<p>A rogue with this talent gains the ability to cast a 0-level spell from the sorcerer/wizard spell list. This spell can be cast three times a day as a spell-like ability. The caster level for this ability is equal to the rogue's level. The save DC for this spell is 10 + the rogue's Intelligence modifier. The rogue must have an Intelligence of at least 10 to select this talent.</p>"
                    },
                    "Quick Disable": {
                        "name": "Quick Disable",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>It takes a rogue with this ability half the normal amount of time to disable a trap using the Disable Device skill (minimum 1 round).</p>"
                    },
                    "Resiliency": {
                        "name": "Resiliency",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this ability can gain a number of temporary hit points equal to the rogue's level. Activating this ability is an immediate action that can only be performed when she is brought to below 0 hit points. This ability can be used to prevent her from dying. These temporary hit points last for 1 minute. If the rogue's hit points drop below 0 due to the loss of these temporary hit points, she falls unconscious and is dying as normal.</p>"
                    },
                    "Rogue Crawl": {
                        "name": "Rogue Crawl",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>While prone, a rogue with this ability can move at half speed. This movement provokes attacks of opportunity as normal. A rogue with this talent can take a 5-foot step while crawling.</p>"
                    },
                    "Slow Reactions": {
                        "name": "Slow Reactions",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Opponents damaged by the rogue's sneak attack can't make attacks of opportunity for 1 round.</p>"
                    },
                    "Stand Up": {
                        "name": "Stand Up",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this ability can stand up from a prone position as a free action. This still provokes attacks of opportunity for standing up while threatened by a foe.</p>"
                    },
                    "Surprise Attack": {
                        "name": "Surprise Attack",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>During the surprise round, opponents are always considered flat-footed to a rogue with this ability, even if they have already acted.</p>"
                    },
                    "Trap Spotter": {
                        "name": "Trap Spotter",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Whenever a rogue with this talent comes within 10 feet of a trap, she receives an immediate Perception skill check to notice the trap. This check should be made in secret by the GM.</p>"
                    },
                    "Weapon Training": {
                        "name": "Weapon Training",
                        "type": "Rogue Talent",
                        "description": "<p>A rogue that selects this talent gains Weapon Focus as a bonus feat.</p>"
                    },
                    "Assault Leader": {
                        "name": "Assault Leader",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, when the rogue misses with an attack on a flanked opponent, she can designate a single ally who is also flanking the target that her attack missed. That ally can make a single melee attack against the opponent as an immediate action.</p>"
                    },
                    "Befuddling Strike": {
                        "name": "Befuddling Strike",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When the rogue deals sneak attack damage against an opponent, that opponent takes a –2 penalty on attack rolls against the rogue for 1d4 rounds.</p>"
                    },
                    "Camouflage": {
                        "name": "Camouflage",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this talent can craft simple but effective camouflage from the surrounding foliage. The rogue needs 1 minute to prepare the camouflage, but once she does, it is good for the rest of the day or until the rogue fails a saving throw against an area effect spell that deals fire, cold, or acid damage, whichever comes first. The rogue gains a +4 bonus on Stealth checks while within terrain that matches the foliage used to make the camouflage. This ability cannot be used in areas without natural foliage.</p>"
                    },
                    "Canny Observer": {
                        "name": "Canny Observer",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent makes a Perception check to hear the details of a conversation or to find concealed or secret objects (including doors and traps), she gains a +4 bonus.</p>"
                    },
                    "Charmer": {
                        "name": "Charmer",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, the rogue can roll two dice while making a Diplomacy check, and take the better result. She must choose to use this talent before making the Diplomacy check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"
                    },
                    "Coax Information": {
                        "name": "Coax Information",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can use Bluff or Diplomacy in place of Intimidate to force an opponent to act friendly toward her.</p>"
                    },
                    "Combat Swipe": {
                        "name": "Combat Swipe",
                        "type": "Rogue Talent",
                        "description": "<p>A rogue who selects this talent gains Improved Steal as a bonus feat.</p>"
                    },
                    "Cunning Trigger": {
                        "name": "Cunning Trigger",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can use a swift action to set off any trap within 30 feet that she constructed.</p>"
                    },
                    "Distracting Attack": {
                        "name": "Distracting Attack",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can make sneak attacks with subtle flourishes that disorient and distract her enemy. When she hits a creature with a melee attack that deals sneak attack damage, she can forgo the additional damage to cause the creature to become flat-footed against one target of her choosing until the beginning of her next turn. The rogue cannot designate herself as the creature gaining the benefit of this talent. Creatures with uncanny dodge are immune to distracting attack.</p>"
                    },
                    "Expert Leaper": {
                        "name": "Expert Leaper",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When making jump checks, the rogue is always considered to have a running start. Also, when the rogue deliberately falls, a DC 15 Acrobatics check allows her to ignore the first 20 feet fallen, instead of the first 10 feet.</p>"
                    },
                    "Fast Fingers": {
                        "name": "Fast Fingers",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this talent can roll two dice while making a Sleight of Hand check and take the better result. She must choose to use this talent before making the Sleight of Hand check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"
                    },
                    "Fast Getaway": {
                        "name": "Fast Getaway",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>After successfully making a sneak attack or Sleight of Hand check, a rogue with this talent can spend a move action to take the withdraw action. She can move no more than her speed during this movement.</p>"
                    },
                    "Fast Picks": {
                        "name": "Fast Picks",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can use the Disable Device skill to attempt to open a lock as a standard action instead of a full-round action.</p>"
                    },
                    "Follow Clues": {
                        "name": "Follow Clues",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can use Perception to follow tracks as per the Survival skill.</p>"
                    },
                    "Guileful Polyglot": {
                        "name": "Guileful Polyglot",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent who has at least one rank in Linguistics gains four additional languages. A rogue with this talent who does not have any ranks in Linguistics gains two additional languages. If the rogue later gains ranks in Linguistics, she gains two additional languages, to a total of four additional languages above those granted by the Linguistics skill itself.</p>"
                    },
                    "Hard to Fool": {
                        "name": "Hard to Fool",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this talent can roll two dice while making a Sense Motive check, and take the better result. She must choose to use this talent before making the Sense Motive check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"
                    },
                    "Honeyed Words": {
                        "name": "Honeyed Words",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, the rogue can roll two dice while making a Bluff check, and take the better result. She must choose to use this talent before making the Bluff check. A rogue can use this ability one additional time per day for every five rogue levels she possesses.</p>"
                    },
                    "Lasting Poison": {
                        "name": "Lasting Poison",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can apply poison to a weapon in such a way that it is effective for two successful attacks instead of one. The poison has a reduced effect, however, and saves made against the poison receive a +2 circumstance bonus. Applying poison in this way requires a full-round action, or a standard action if the rogue has the swift poison talent.</p>"
                    },
                    "Nimble Climber": {
                        "name": "Nimble Climber",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent fails a Climb check by 5 or more, she can immediately make another Climb check at the surface's base DC +10. If successful, she stops her fall by clinging onto the surface. The rogue does not take falling damage when she stops her fall in this manner.</p>"
                    },
                    "Offensive Defense": {
                        "name": "Offensive Defense",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent hits a creature with a melee attack that deals sneak attack damage, the rogue gains a +1 dodge bonus to AC for each sneak attack die rolled for 1 round.</p>"
                    },
                    "Peerless Maneuver": {
                        "name": "Peerless Maneuver",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this talent can roll two dice while making an Acrobatics check, and take the better result. She must choose to use this talent before making the Acrobatics check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"
                    },
                    "Positioning Attack": {
                        "name": "Positioning Attack",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, when a rogue with this talent hits a creature with a melee attack, she can move up to 30 feet without provoking attacks of opportunity. The movement must end in a space adjacent to the creature hit with the melee attack.</p>"
                    },
                    "Powerful Sneak": {
                        "name": "Powerful Sneak",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Whenever a rogue with this talent takes a full attack action, she can elect to take a –2 penalty on all attack rolls until the start of her next turn. If an attack during this time is a sneak attack, she treats all 1s on the sneak attack damage dice as 2s.</p>"
                    },
                    "Quick Disguise": {
                        "name": "Quick Disguise",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can use the items at hand and seemingly innocuous material hidden on her person to create startlingly effective disguises, reducing the amount of time it takes to create a disguise using the Disguise skill.</p><p>The time needed for the rogue to alter her appearance in this manner is based on the complexity of the disguise, as noted on the following table. The times are cumulative, so if a female rogue wants to disguise herself as a male of a different race, that takes 2 minutes.</p><table><tr><th>Disguise</th><th>Time</th></tr><tr><td>Minor details only</td><td>1 full-round action<td></tr><tr><td>Disguise as a different gender</td><td>1 minute<td></tr><tr><td>Disguise as a different race</td><td>1 minute<td></tr><tr><td>Disguise as a different age category</td><td>1 minute<td></tr><tr><td>Disguise as a different size category</td><td>1 minute<td></tr></table>"
                    },
                    "Quick Trapsmith": {
                        "name": "Quick Trapsmith",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>As a full-round action, a rogue with this talent can set a simple trap with a CR no greater than 1/2 her rogue level. To do this, she must purchase the components, spend the required time constructing the trap in advance, and have its components at hand. The type of trap that can be constructed in this way is subject to GM discretion.</p>"
                    },
                    "Snap Shot": {
                        "name": "Snap Shot",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent may treat her intitiative roll as a 20 for a surprise round, regardless of her initiative, but she may only take an attack action with a ranged weapon. Her normal initiative roll is used in subsequent rounds. If two or more rogues possess this talent, their initiative determines the order in which they act, but they all go before any other creature. If a rogue is prevented from acting in the surprise round, this talent has no effect.</p>"
                    },
                    "Sniper's Eye": {
                        "name": "Sniper's Eye",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can apply her sneak attack damage on ranged attacks targeting foes within 30 feet that benefit from concealment. Foes with total concealment are still immune.</p>"
                    },
                    "Strong Impression": {
                        "name": "Strong Impression",
                        "type": "Rogue Talent",
                        "description": "<p>A rogue who selects this talent gains Intimidating Prowess as a bonus feat.</p>"
                    },
                    "Survivalist": {
                        "name": "Survivalist",
                        "type": "Rogue Talent",
                        "description": "<p>A rogue with this talent adds Heal and Survival to her list of class skills.</p>"
                    },
                    "Swift Poison": {
                        "name": "Swift Poison",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can apply poison to a weapon as a move action, instead of a standard action.</p>"
                    },
                    "Black Market Connections": {
                        "name": "Black Market Connections",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains better access to magic items from black market connections. She treats every settlement as one size greater for the purpose of determining the gp limit of the base value of items for sale, as well as the number of minor, medium, and major magic items for sale in the settlement. If the settlement is already a metropolis, all minor and medium magic items are for sale, as well as 3d8 major magic items. With a successful Diplomacy check, the rogue can treat the settlement as two sizes larger. If the settlement is already a metropolis and she succeeds at the check, all magic items are for sale. If the settlement is already a large city and she succeeds at the check, all minor and medium magic items are for sale, as well as 3d8 major magic items. With a successful check, the rogue can also sell stolen items on the black market. If the check fails by 5 or more, the rogue does something to spook the market, and treats the city as normal for 1 week. Furthermore, those in control of the black market may alert the authorities to the rogue's presence in an act of reprisal for spooking the market or to divert attention away from their illicit activities. The DCs of the checks are by settlement size and are given in the table below.</p><table><th><td>Community Size</td><td>DC</td></tr><tr><td>Thorp</td><td>10</td></tr>Hamlet</td><td>12</td></tr>Village</td><td>15</td></tr>Small town</td><td>18</td></tr>Large town</td><td>20</td></tr>Small city</td><td>25</td></tr>Large city</td><td>30</td></tr>Metropolis</td><td>35</td></tr></table>"
                    },
                    "Convincing Lie": {
                        "name": "Convincing Lie",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent lies, she creates fabrications so convincing that others treat them as truth. When a rogue with this talent successfully uses the Bluff skill to convince someone that what she is saying is true, if that individual is questioned later about the statement or story, that person uses the rogue's Bluff skill modifier to convince the questioner, rather than his own. If his Bluff skill modifier is better than the rogue's, the individual can use his own modifier and gain a +2 bonus on any check to convince others of the lie. This effect lasts for a number of days equal to 1/2 the rogue's level + the rogue's Charisma modifier.</p>"
                    },
                    "Deft Palm": {
                        "name": "Deft Palm",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can make a Sleight of Hand check to conceal a weapon while holding it in plain sight, even while she is being observed.</p>"
                    },
                    "Esoteric Scholar": {
                        "name": "Esoteric Scholar",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once a day, a rogue with this talent may attempt a Knowledge check, even when she is not trained in that Knowledge skill.</p>"
                    },
                    "Firearm Training": {
                        "name": "Firearm Training",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains Exotic Weapon Proficiency (firearms).</p>"
                    },
                    "Getaway Artist": {
                        "name": "Getaway Artist",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent adds Fly, Handle Animal, and Ride to her list of class skills, and gains a +2 bonus on all driving checks.</p>"
                    },
                    "Grit": {
                        "name": "Grit",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains the Amateur Gunslinger feat and one grit feat of her choice. She must fulfill the prerequisites of the grit feat in order to choose it. A rogue must have the firearm training talent before choosing this one.</p>"
                    },
                    "Hold Breath": {
                        "name": "Hold Breath",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent increases the number of rounds she can hold her breath by 2. She can take this talent multiple times.</p>"
                    },
                    "Iron Guts": {
                        "name": "Iron Guts",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent has a cast-iron stomach or has trained herself to withstand poisons, especially ingested ones. She gains a +1 bonus on all saves against ingested poisons as well as a +4 bonus on saves against all spells and effects that cause the rogue to be nauseated or sickened.</p>"
                    },
                    "Ki Pool": {
                        "name": "Ki Pool",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains a small ki pool. This ki pool is similar to a ninja's ki pool, but the rogue's ki pool does not grant any extra attacks. The rogue gains a number of ki points equal to her Wisdom modifier (minimum 1). These ki points replenish at the start of each day. If she already has a ki pool, or gains a ki pool later, she gains half her Wisdom bonus (minimum 1) as bonus ki points to her ki pool. She can spend a ki point to gain a +10-foot bonus to movement until the end of her turn.</p>"
                    },
                    "Ninja Trick": {
                        "name": "Ninja Trick",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can choose a trick from the ninja trick list. The rogue can choose but cannot use talents that require ki points, unless she has a ki pool. A rogue can pick this talent more than once. The ninja cannot choose a ninja trick with the same name as a rogue talent.</p>"
                    },
                    "Rope Master": {
                        "name": "Rope Master",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this ability can move at her normal speed when using rope on a Climb check, can take 10 when using Acrobatics to move over narrow surfaces even when in danger or distracted, and gains a +4 bonus when determining the DC to escape bonds when she ties up a creature.</p>"
                    },
                    "Strong Stroke": {
                        "name": "Strong Stroke",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent rolls twice when making Swim checks and takes the better result. If she already rolls twice while making a Swim check because of another ability or effect, she gains a +2 insight bonus on both of those rolls instead. If the rogue is under the effect of a spell or ability that forces her to roll two dice and take the worse result, she only needs to roll 1d20 while making Swim checks.</p>"
                    },
                    "Terrain Mastery": {
                        "name": "Terrain Mastery",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains a favored terrain as the ranger ability of the same name, though the favored terrain ability does not increase with her level as the ranger's ability does. A rogue can take this ability multiple times, each time applying it to a new terrain, and granting all other favored terrains a +2 increase to the favored terrain bonus.</p>"
                    },
                    "Underhanded": {
                        "name": "Underhanded",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains a +4 circumstance bonus on all Sleight of Hand checks made to conceal a weapon. Furthermore, if she makes a sneak attack during the surprise round using a concealed weapon that her opponent didn't know about, she does not have to roll sneak attack damage, and the sneak attack deals maximum damage. A rogue can only use the underhanded talent a number of times per day equal to her Charisma modifier (minimum 0).</p>"
                    },
                    "Wall Scramble": {
                        "name": "Wall Scramble",
                        "type": "Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent rolls twice when making Climb checks and takes the better of the two rolls. If she already rolls twice while making a Climb check because of another ability or effect, she gains a +2 insight bonus on both of those rolls instead. If the rogue is under the effect of a spell or ability that forces her to roll two dice and take the worse result, she only needs to roll 1d20 while making Climb checks.</p>"
                    }
                },
                "Trap Sense": {
                    "name": "Trap Sense",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, a rogue gains an intuitive sense that alerts her to danger from traps, giving her a +1 bonus on Reflex saves made to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses rise to +2 when the rogue reaches 6th level, to +3 when she reaches 9th level, to +4 when she reaches 12th level, to +5 at 15th, and to +6 at 18th level.<p></p>Trap sense bonuses gained from multiple classes stack.</p>"
                },
                "Uncanny Dodge": {
                    "name": "Uncanny Dodge",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Starting at 4th level, a rogue can react to danger before her senses would normally allow her to do so. She cannot be caught flat-footed, nor does she lose her Dex bonus to AC if the attacker is invisible. She still loses her Dexterity bonus to AC if immobilized. A rogue with this ability can still lose her Dexterity bonus to AC if an opponent successfully uses the feint action (see Combat) against her.<p></p>If a rogue already has uncanny dodge from a different class, she automatically gains improved uncanny dodge (see below) instead.</p>"
                },
                "Improved Uncanny Dodge": {
                    "name": "Improved Uncanny Dodge",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A rogue of 8th level or higher can no longer be flanked.<p></p>This defense denies another rogue the ability to sneak attack the character by flanking her, unless the attacker has at least four more rogue levels than the target does.<p></p>If a character already has uncanny dodge (see above) from another class, the levels from the classes that grant uncanny dodge stack to determine the minimum rogue level required to flank the character.</p>"
                },
                "Advanced Talents": {
                    "name": "Advanced Talents",
                    "type": "Class Feature",
                    "description": "<p>At 10th level, and every two levels thereafter, a rogue can choose one of the following advanced talents in place of a rogue talent.</p>",
                    "Crippling Strike": {
                        "name": "Crippling Strike",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this ability can sneak attack opponents with such precision that her blows weaken and hamper them. An opponent damaged by one of her sneak attacks also takes 2 points of Strength damage.</p>"
                    },
                    "Defensive Roll": {
                        "name": "Defensive Roll",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>With this advanced talent, the rogue can roll with a potentially lethal blow to take less damage from it than she otherwise would. Once per day, when she would be reduced to 0 or fewer hit points by damage in combat (from a weapon or other blow, not a spell or special ability), the rogue can attempt to roll with the damage. To use this ability, the rogue must attempt a Reflex saving throw (DC = damage dealt). If the save succeeds, she takes only half damage from the blow; if it fails, she takes full damage. She must be aware of the attack and able to react to it in order to execute her defensive roll—if she is denied her Dexterity bonus to AC, she can't use this ability. Since this effect would not normally allow a character to make a Reflex save for half damage, the rogue's evasion ability does not apply to the defensive roll.</p>"
                    },
                    "Dispelling Attack": {
                        "name": "Dispelling Attack",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Supernatural",
                        "description": "<p>Opponents that are dealt sneak attack damage by a rogue with this ability are affected by a targeted dispel magic, targeting the lowest-level spell effect active on the target. The caster level for this ability is equal to the rogue's level. A rogue must have the major magic rogue talent before choosing dispelling attack.</p>"
                    },
                    "Improved Evasion": {
                        "name": "Improved Evasion",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>This works like evasion, except that while the rogue still takes no damage on a successful Reflex saving throw against attacks, she henceforth takes only half damage on a failed save. A helpless rogue does not gain the benefit of improved evasion.</p>"
                    },
                    "Opportunist": {
                        "name": "Opportunist",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per round, the rogue can make an attack of opportunity against an opponent who has just been struck for damage in melee by another character. This attack counts as an attack of opportunity for that round. Even a rogue with the Combat Reflexes feat can't use the opportunist ability more than once per round.</p>"
                    },
                    "Skill Mastery": {
                        "name": "Skill Mastery",
                        "type": "Advanced Rogue Talent",
                        "description": "<p>The rogue becomes so confident in the use of certain skills that she can use them reliably even under adverse conditions.<p></p>Upon gaining this ability, she selects a number of skills equal to 3 + her Intelligence modifier. When making a skill check with one of these skills, she may take 10 even if stress and distractions would normally prevent her from doing so. A rogue may gain this special ability multiple times, selecting additional skills for skill mastery to apply to each time.</p>"
                    },
                    "Slippery Mind": {
                        "name": "Slippery Mind",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>This ability represents the rogue's ability to wriggle free from magical effects that would otherwise control or compel her. If a rogue with slippery mind is affected by an enchantment spell or effect and fails her saving throw, she can attempt it again 1 round later at the same DC. She gets only this one extra chance to succeed on her saving throw.</p>"
                    },
                    "Feat": {
                        "name": "Feat",
                        "type": "Advanced Rogue Talent",
                        "description": "<p>A rogue may gain any feat that she qualifies for in place of a rogue talent.</p>"
                    },
                    "Another Day": {
                        "name": "Another Day",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, when the rogue would be reduced to 0 or fewer hit points by a melee attack, she can take a 5-foot step as an immediate action. If the movement takes her out of the reach of the attack, she takes no damage from the attack. The rogue is staggered for 1 round on her next turn.</p>"
                    },
                    "Deadly Cocktail": {
                        "name": "Deadly Cocktail",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can apply two doses of poison to a weapon at once. These can be separate poisons, in which case they both affect the target individually, or two doses of the same toxin, in which case the poisons' frequency is extended by 50% and the save DC increases by +2. This talent is an exception to the rule that injury poisons can only be delivered one dose at a time.</p>"
                    },
                    "Deadly Sneak": {
                        "name": "Deadly Sneak",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Whenever a rogue with this talent uses the powerful sneak rogue talent, she treats all 1s and 2s on the sneak attack damage dice as 3s. A rogue must have the powerful sneak rogue talent before choosing this talent.</p>"
                    },
                    "Entanglement of Blades": {
                        "name": "Entanglement of Blades",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent hits a creature with a melee attack that deals sneak attack damage, the target cannot take a 5-foot step until the beginning of the rogue's next turn.</p>"
                    },
                    "Fast Tumble": {
                        "name": "Fast Tumble",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent uses Acrobatics to move at full speed through a threatened square without provoking an attack of opportunity, the DC of the Acrobatics check does not increase by 10.</p>"
                    },
                    "Frugal Trapsmith": {
                        "name": "Frugal Trapsmith",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent constructs a mechanical trap, she only pays 75% of the normal cost.</p>"
                    },
                    "Hunter's Surprise": {
                        "name": "Hunter's Surprise",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this talent can designate a single enemy she is adjacent to as her prey. Until the end of her next turn, she can add her sneak attack damage to all attacks made against her prey, even if she is not flanking it or it is not flat-footed.</p>"
                    },
                    "Knock-Out Blow": {
                        "name": "Knock-Out Blow",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, the rogue can forgo her sneak attack damage to attempt to knock out an opponent. She must declare the use of knock-out blow before she makes the attack. If the attack hits, it does normal damage, but instead of dealing sneak attack damage (and instead of any effect that triggers when the rogue deals sneak attack damage), the target falls unconscious for 1d4 rounds. A successful Fortitude save reduces this effect to staggered for 1 round. The DC of this save is equal to 10 + 1/2 the rogue's level + the rogue's Intelligence modifier.</p>"
                    },
                    "Master of Disguise": {
                        "name": "Master of Disguise",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this talent gains a +10 bonus on a single Disguise check.</p>"
                    },
                    "Redirect Attack": {
                        "name": "Redirect Attack",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, when a rogue with this talent is hit with a melee attack, she can redirect the attack to strike at an adjacent creature with a free action. The creature targeted must be within melee reach of the attack that hit the rogue, and the creature that made the attack against the rogue must make a new attack roll against the new target.</p>"
                    },
                    "Stealthy Sniper": {
                        "name": "Stealthy Sniper",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent uses the Stealth skill to snipe, she only suffers a –10 penalty on the Stealth check, instead of –20.</p>"
                    },
                    "Thoughtful Reexamining": {
                        "name": "Thoughtful Reexamining",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>Once per day, a rogue with this talent can reroll a Knowledge, Sense Motive, or Perception skill check to try to gain new or better information from the roll. This reroll can be made any time during the same day as the original check.</p>"
                    },
                    "Confounding Blades": {
                        "name": "Confounding Blades",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>When a rogue with this talent hits a creature with a melee weapon that deals sneak attack damage, her target cannot make attacks of opportunity for 1d4+1 rounds. The rogue must have the slow reaction rogue talent before she can choose this talent.</p>"
                    },
                    "Familiar": {
                        "name": "Familiar",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains a familiar as the familiar option of the wizard's arcane bond class feature. This ability functions exactly like that part of the class feature, but the rogue's effective wizard level is her rogue level –4. The rogue must have the minor magic and major magic talents before she can choose this trick.</p>"
                    },
                    "Getaway Master": {
                        "name": "Getaway Master",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent gains a +10 bonus on all drive checks. The rogue must have the getaway artist rogue talent before choosing this talent.</p>"
                    },
                    "Hard Minded": {
                        "name": "Hard Minded",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent is hard to fool with mind-affecting effects. At the start of her turn, if she is still subject to any mind-affecting spells or effects, she can make a Will saving throw with a standard DC for the effect's level, and if she succeeds at the check, she is no longer subject to the mind-affecting effect. She can make this saving throw even against mind-affecting effects that normally don't allow a saving throw. In those cases, generate the saving throw as if the spell or effect did allow a saving throw.</p>"
                    },
                    "Hide in Plain Sight": {
                        "name": "Hide in Plain Sight",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can select a single terrain from the ranger's favored terrain list. She is a master at hiding in that terrain, and while within that terrain, she can use the Stealth skill to hide, even while being observed. A rogue may take this advanced talent more than once, each time selecting a different terrain from the favored terrain list.</p>"
                    },
                    "Rumormonger": {
                        "name": "Rumormonger",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can attempt to spread a rumor though a small town or larger settlement by making a Bluff check. She can do so a number of times per week equal to her Charisma modifier (minimum 0). The DC is based on the size of the settlement, and it takes a week for the rumor to propagate through the settlement. If the check succeeds, the rumor is practically accepted as fact within the community; succeeding by 5 or more over the DC decreases the time it takes the rumor to propagate by 1d4 days. A failed check means the rumor failed to gain traction, while failing by 5 or more causes the opposite of the rumor or some other competing theory involving the rumor's subject to take hold.</p><table><th><tr>Community Size</td><td>DC</td</tr><tr><td>Small town</td><td>18</td><tr><tr><td>Large town</td><td>20</td><tr><tr><td>Small city</td><td>25</td><tr><tr><td>Large city</td><td>30</td><tr><tr><td>Metropolis</td><td>35</td><tr></table>"
                    },
                    "Unwitting Ally": {
                        "name": "Unwitting Ally",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can spend a swift action to attempt to make an opponent act like an ally for purposes of providing a flank until the beginning of the rogue's next turn. The opponent must be able to hear and see the rogue, and the rogue must succeed at a Bluff check opposed by the opponent's Sense Motive. If the check succeeds, the opponent acts as an ally for the purpose of providing a flank. Whether or not the check succeeds, the rogue cannot use this trick again on the same opponent for the next 24 hours. If the rogue fails the check by 5 or more, she cannot use the unwitting ally ability on any opponent within line of sight of the failed attempt for 24 hours.</p>"
                    },
                    "Weapon Snatcher": {
                        "name": "Weapon Snatcher",
                        "type": "Advanced Rogue Talent",
                        "specialAbilityType": "Extraordinary",
                        "description": "<p>A rogue with this talent can make a Sleight of Hand check in place of a combat maneuver check when attempting to disarm an opponent.</p>"
                    }
                },
                "Master Strike": {
                    "name": "Master Strike",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Upon reaching 20th level, a rogue becomes incredibly deadly when dealing sneak attack damage. Each time the rogue deals sneak attack damage, she can choose one of the following three effects: the target can be put to sleep for 1d4 hours, paralyzed for 2d6 rounds, or slain. Regardless of the effect chosen, the target receives a Fortitude save to negate the additional effect. The DC of this save is equal to 10 + 1/2 the rogue's level + the rogue's Intelligence modifier. Once a creature has been the target of a master strike, regardless of whether or not the save is made, that creature is immune to that rogue's master strike for 24 hours. Creatures that are immune to sneak attack damage are also immune to this ability.</p>"
                }
            }
        },
        "Sorcerer": {
            "name": "Sorcerer",
            "type": "Class",
            "summary": "<p>The spellcasting sorcerer is born with an innate knack for magic and has strange, eldritch powers.</p>",
            "description": "<p>Scions of innately magical Bloodlines, the chosen of deities, the spawn of monsters, pawns of fate and destiny, or simply flukes of fickle magic, sorcerers look within themselves for arcane prowess and draw forth might few mortals can imagine. Emboldened by lives ever threatening to be consumed by their innate powers, these magic-touched souls endlessly indulge in and refine their mysterious abilities, gradually learning how to harness their birthright and coax forth ever greater arcane feats. Just as varied as these innately powerful spellcasters' abilities and inspirations are the ways in which they choose to utilize their gifts. While some seek to control their abilities through meditation and discipline, becoming masters of their fantastic birthright, others give in to their magic, letting it rule their lives with often explosive results. Regardless, sorcerers live and breathe that which other spellcasters devote their lives to mastering, and for them magic is more than a boon or a field of study; it is life itself.</p>",
            "hitDie": "6",
            "classSkills": [
                "Appraise", "Bluff", "Craft", "Fly", "Intimidate", "Knowledge (arcana)", "Profession", "Spellcraft", "Use Magic Device"
            ],
            "skillsPerLevel": "2",
            "progression": {
                "BAB": [
                    "0", "1", "1", "2", "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10"
                ],
                "Fortitude": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Reflex": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Will": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "spellsPerDay": [
                    ["3"], ["4"], ["5"], [
                        "6", "3"
                    ], [
                        "6", "4"
                    ], [
                        "6", "5", "3"
                    ], [
                        "6", "6", "4"
                    ], [
                        "6", "6", "5", "3"
                    ], [
                        "6", "6", "6", "4"
                    ], [
                        "6", "6", "6", "5", "3"
                    ], [
                        "6", "6", "6", "6", "4"
                    ], [
                        "6", "6", "6", "6", "5", "3"
                    ], [
                        "6", "6", "6", "6", "6", "4"
                    ], [
                        "6", "6", "6", "6", "6", "5", "3"
                    ], [
                        "6", "6", "6", "6", "6", "6", "4"
                    ], [
                        "6", "6", "6", "6", "6", "6", "5", "3"
                    ], [
                        "6", "6", "6", "6", "6", "6", "6", "4"
                    ], [
                        "6", "6", "6", "6", "6", "6", "6", "5", "3"
                    ], [
                        "6", "6", "6", "6", "6", "6", "6", "6", "4"
                    ], [
                        "6", "6", "6", "6", "6", "6", "6", "6", "6"
                    ]
                ],
                "spellsKnown": [
                    [
                        "4", "2"
                    ], [
                        "5", "2"
                    ], [
                        "5", "3"
                    ], [
                        "6", "3", "1"
                    ], [
                        "6", "4", "2"
                    ], [
                        "7", "4", "2", "1"
                    ], [
                        "7", "5", "3", "2"
                    ], [
                        "8", "5", "3", "2", "1"
                    ], [
                        "8", "5", "4", "3", "2"
                    ], [
                        "9", "5", "4", "3", "2", "1"
                    ], [
                        "9", "5", "5", "4", "3", "2"
                    ], [
                        "9", "5", "5", "4", "3", "2", "1"
                    ], [
                        "9", "5", "5", "4", "4", "3", "2"
                    ], [
                        "9", "5", "5", "4", "4", "3", "2", "1"
                    ], [
                        "9", "5", "5", "4", "4", "4", "3", "2"
                    ], [
                        "9", "5", "5", "4", "4", "4", "3", "2", "1"
                    ], [
                        "9", "5", "5", "4", "4", "4", "3", "3", "2"
                    ], [
                        "9", "5", "5", "4", "4", "4", "3", "3", "2", "1"
                    ], [
                        "9", "5", "5", "4", "4", "4", "3", "3", "3", "2"
                    ], [
                        "9", "5", "5", "4", "4", "4", "3", "3", "3", "3"
                    ]
                ]
            },
            "Class Features": {
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "description": "<p>Sorcerers are proficient with all simple weapons. They are not proficient with any type of armor or shield. Armor interferes with a sorcerer's gestures, which can cause her spells with somatic components to fail (see Arcane Spells and Armor).</p>"
                },
                "Spells": {
                    "name": "Spells",
                    "type": "Class Feature",
                    "description": "<p>A sorcerer casts arcane spells drawn primarily from the sorcerer/wizard spell list presented in Spell Lists. She can cast any spell she knows without preparing it ahead of time. To learn or cast a spell, a sorcerer must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a sorcerer's spell is 10 + the spell level + the sorcerer's Charisma modifier.</p><p>Like other spellcasters, a sorcerer can cast only a certain number of spells of each spell level per day. Her base daily spell allotment is given on Table: Sorcerer. In addition, she receives bonus spells per day if she has a high Charisma score (see Table: Ability Modifiers and Bonus Spells).</p><p>A sorcerer's selection of spells is extremely limited. A sorcerer begins play knowing four 0-level spells and two 1st-level spells of her choice. At each new sorcerer level, she gains one or more new spells, as indicated on Table: Sorcerer Spells Known. (Unlike spells per day, the number of spells a sorcerer knows is not affected by her Charisma score; the numbers on Table: Sorcerer Spells Known are fixed.) These new spells can be common spells chosen from the sorcerer/wizard spell list, or they can be unusual spells that the sorcerer has gained some understanding of through study.</p><p>Upon reaching 4th level, and at every even-numbered sorcerer level after that (6th, 8th, and so on), a sorcerer can choose to learn a new spell in place of one she already knows. In effect, the sorcerer loses the old spell in exchange for the new one. The new spell's level must be the same as that of the spell being exchanged. A sorcerer may swap only a single spell at any given level, and must choose whether or not to swap the spell at the same time that she gains new spells known for the level.</p><p>Unlike a wizard or a cleric, a sorcerer need not prepare her spells in advance. She can cast any spell she knows at any time, assuming she has not yet used up her spells per day for that spell level.</p>"
                },
                "Bloodline": {
                    "name": "Bloodline",
                    "type": "Class Feature",
                    "description": "<p>Each sorcerer has a source of magic somewhere in her heritage that grants her spells, bonus feats, an additional class skill, and other special abilities. This source can represent a blood relation or an extreme event involving a creature somewhere in the family's past. For example, a sorcerer might have a dragon as a distant relative or her grandfather might have signed a terrible contract with a devil. Regardless of the source, this influence manifests in a number of ways as the sorcerer gains levels. A sorcerer must pick one bloodline upon taking her first level of sorcerer. Once made, this choice cannot be changed.</p><p>At 3rd level, and every two levels thereafter, a sorcerer learns an additional spell, derived from her bloodline. These spells are in addition to the number of spells given on Table: Sorcerer Spells Known. These spells cannot be exchanged for different spells at higher levels.</p><p>At 7th level, and every six levels thereafter, a sorcerer receives one bonus feat, chosen from a list specific to each bloodline. The sorcerer must meet the prerequisites for these bonus feats.</p>",
                    "Aberrant": {
                        "name": "Aberrant",
                        "type": "Bloodlines",
                        "description": "<p>There is a taint in your blood, one that is alien and bizarre. You tend to think in odd ways, approaching problems from an angle that most would not expect. Over time, this taint manifests itself in your physical form.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Knowledge (dungeoneering).</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>enlarge person (3rd), see invisibility (5th), tongues (7th), black tentacles (9th), feeblemind (11th), veil (13th), plane shift (15th), mind blank (17th), shapechange (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Combat Casting, Improved Disarm, Improved Grapple, Improved Initiative, Improved Unarmed Strike, Iron Will, Silent Spell, Skill Focus (Knowledge [dungeoneering]).</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell of the polymorph subschool, increase the duration of the spell by 50% (minimum 1 round). This bonus does not stack with the increase granted by the Extend Spell feat.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>Aberrant sorcerers show increasing signs of their tainted heritage as they increase in level, although they are only visible when used.</p>",
                            "Acidic Ray": {
                                "name": "Acidic Ray",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>Starting at 1st level, you can fire an acidic ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. The acidic ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"
                            },
                            "Long Limbs": {
                                "name": "Long Limbs",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, your reach increases by 5 feet whenever you are making a melee touch attack. This ability does not otherwise increase your threatened area. At 11th level, this bonus to your reach increases to 10 feet. At 17th level, this bonus to your reach increases to 15 feet.</p>"
                            },
                            "Unusual Anatomy": {
                                "name": "Unusual Anatomy",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 9th level, your anatomy changes, giving you a 25% chance to ignore any critical hit or sneak attack scored against you. This chance increases to 50% at 13th level.</p>"
                            },
                            "Alien Resistance": {
                                "name": "Alien Resistance",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 15th level, you gain spell resistance equal to your sorcerer level + 10.</p>"
                            },
                            "Aberrant Form": {
                                "name": "Aberrant Form",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 20th level, your body becomes truly unnatural. You are immune to critical hits and sneak attacks. In addition, you gain blindsight with a range of 60 feet and damage reduction 5/—.</p>"
                            }
                        }
                    },
                    "Abyssal": {
                        "name": "Abyssal",
                        "type": "Bloodlines",
                        "description": "<p>Generations ago, a demon spread its filth into your heritage. While it does not manifest in all of your kin, for you it is particularly strong. You might sometimes have urges to chaos or evil, but your destiny (and alignment) is up to you.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Knowledge (planes).</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>cause fear (3rd), bull's strength (5th), rage (7th), stoneskin (9th), dismissal (11th), transformation (13th), greater teleport (15th), unholy aura (17th), summon monster IX (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Augment Summoning, Cleave, Empower Spell, Great Fortitude, Improved Bull Rush, Improved Sunder, Power Attack, Skill Focus (Knowledge [planes]).</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/good equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>While some would say that you are possessed, you know better. The demonic influence in your blood grows as you gain power.</p>",
                            "Claws": {
                                "name": "Claws",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. These attacks deal 1d4 points of damage each (1d3 if you are Small) plus your Strength modifier. At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws become flaming weapons, each dealing an additional 1d6 points of fire damage on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.</p>"
                            },
                            "Demon Resistances": {
                                "name": "Demon Resistances",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, you gain resist electricity 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to electricity increases to 10 and your bonus on poison saving throws increases to +4.</p>"
                            },
                            "Strength of the Abyss": {
                                "name": "Strength of the Abyss",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 9th level, you gain a +2 inherent bonus to your Strength. This bonus increases to +4 at 13th level, and to +6 at 17th level.</p>"
                            },
                            "Added Summonings": {
                                "name": "Added Summonings",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 15th level, whenever you summon a creature with the demon subtype or the fiendish template using a summon monster spell, you summon one additional creature of the same kind.</p>"
                            },
                            "Demonic Might": {
                                "name": "Demonic Might",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 20th level, the power of the Abyss flows through you. You gain immunity to electricity and poison. You also gain resistance to acid 10, cold 10, and fire 10, and gain telepathy with a range of 60 feet (allowing you to communicate with any creature that can speak a language).</p>"
                            }
                        }
                    },
                    "Arcane": {
                        "name": "Arcane",
                        "type": "Bloodlines",
                        "description": "<p>Your family has always been skilled in the eldritch art of magic. While many of your relatives were accomplished wizards, your powers developed without the need for study and practice.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Knowledge (any one).</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>identify (3rd), invisibility (5th), dispel magic (7th), dimension door (9th), overland flight (11th), true seeing (13th), greater teleport (15th), power word stun (17th), wish (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Combat Casting, Improved Counterspell, Improved Initiative, Iron Will, Scribe Scroll, Skill Focus (Knowledge [arcana]), Spell Focus, Still Spell.</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you apply a metamagic feat to a spell that increases the slot used by at least one level, increase the spell's DC by +1. This bonus does not stack with itself and does not apply to spells modified by the Heighten Spell feat.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>Magic comes naturally to you, but as you gain levels you must take care to prevent the power from overwhelming you.</p>",
                            "Arcane Bond": {
                                "name": "Arcane Bond",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 1st level, you gain an arcane bond, as a wizard equal to your sorcerer level. Your sorcerer levels stack with any wizard levels you possess when determining the powers of your familiar or bonded object. This ability does not allow you to have both a familiar and a bonded item. Once per day, your bond item allows you to cast any one of our spells known (unlike a wizard's bonded item, which allows him to cast any one spell in his spellbook).</p>"
                            },
                            "Metamagic Adept": {
                                "name": "Metamagic Adept",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, you can apply any one metamagic feat you know to a spell you are about to cast without increasing the casting time. You must still expend a higher-level spell slot to cast this spell. You can use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 19th level. At 20th level, this ability is replaced by arcane apotheosis.</p>"
                            },
                            "New Arcana": {
                                "name": "New Arcana",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 9th level, you can add any one spell from the sorcerer/wizard spell list to your list of spells known. This spell must be of a level that you are capable of casting. You can also add one additional spell at 13th level and 17th level.</p>"
                            },
                            "School Power": {
                                "name": "School Power",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 15th level, pick one school of magic. The DC for any spells you cast from that school increases by +2. This bonus stacks with the bonus granted by Spell Focus.</p>"
                            },
                            "Arcane Apotheosis": {
                                "name": "Arcane Apotheosis",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 20th level, your body surges with arcane power. You can add any metamagic feats that you know to your spells without increasing their casting time, although you must still expend higher-level spell slots. Whenever you use magic items that require charges, you can instead expend spell slots to power the item. For every three levels of spell slots that you expend, you consume one less charge when using a magic item that expends charges.</p>"
                            }
                        }
                    },
                    "Celestial": {
                        "name": "Celestial",
                        "type": "Bloodlines",
                        "description": "<p>Your bloodline is blessed by a celestial power, either from a celestial ancestor or through divine intervention. Although this power drives you along the path of good, your fate (and alignment) is your own to determine.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Heal.</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>bless (3rd), resist energy (5th), magic circle against evil (7th), remove curse (9th), flame strike (11th), greater dispel magic (13th), banishment (15th), sunburst (17th), gate (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Dodge, Extend Spell, Iron Will, Mobility, Mounted Combat, Ride-By Attack, Skill Focus (Knowledge [religion]), Weapon Finesse.</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/evil equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>Your celestial heritage grants you a great many powers, but they come at a price. The lords of the higher planes are watching you and your actions closely.</p>",
                            "Heavenly Fire": {
                                "name": "Heavenly Fire",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>Starting at 1st level, you can unleash a ray of heavenly fire as a standard action, targeting any foe within 30 feet as a ranged touch attack. Against evil creatures, this ray deals 1d4 points of damage + 1 for every two sorcerer levels you possess. This damage is divine and not subject to energy resistance or immunity. This ray heals good creatures of 1d4 points of damage + 1 for every two sorcerer levels you possess. A good creature cannot benefit from your heavenly fire more than once per day. Neutral creatures are neither harmed nor healed by this effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"
                            },
                            "Celestial Resistances": {
                                "name": "Celestial Resistances",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, you gain resist acid 5 and resist cold 5. At 9th level, your resistances increase to 10.</p>"
                            },
                            "Wings of Heaven": {
                                "name": "Wings of Heaven",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 9th level, you can sprout feathery wings and fly for a number of minutes per day equal to your sorcerer level, with a speed of 60 feet and good maneuverability. This duration does not need to be consecutive, but it must be used in 1 minute increments.</p>"
                            },
                            "Conviction": {
                                "name": "Conviction",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 15th level, you can reroll any one ability check, attack roll, skill check, or saving throw you just made. You must decide to use this ability after the die is rolled, but before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability once per day.</p>"
                            },
                            "Ascension": {
                                "name": "Ascension",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 20th level, you become infused with the power of the heavens. You gain immunity to acid, cold, and petrification. You also gain resist electricity 10, resist fire 10, and a +4 racial bonus on saves against poison. Finally, you gain unlimited use of the wings of heaven ability. Finally, you gain the ability to speak with any creature that has a language (as per the tongues spell).</p>"
                            }
                        }
                    },
                    "Destined": {
                        "name": "Destined",
                        "type": "Bloodlines",
                        "description": "<p>Your family is destined for greatness in some way. Your birth could have been foretold in prophecy, or perhaps it occurred during an especially auspicious event, such as a solar eclipse. Regardless of your bloodline's origin, you have a great future ahead.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Knowledge (history).</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>alarm (3rd), blur (5th), protection from energy (7th), freedom of movement (9th), break enchantment (11th), mislead (13th), spell turning (15th), moment of prescience (17th), foresight (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Arcane Strike, Diehard, Endurance, Leadership, Lightning Reflexes, Maximize Spell, Skill Focus (Knowledge [history]), Weapon Focus.</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell with a range of “personal,” you gain a luck bonus equal to the spell's level on all your saving throws for 1 round.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>You are destined for great things, and the powers that you gain serve to protect you.</p>",
                            "Touch of Destiny": {
                                "name": "Touch of Destiny",
                                "type": "Class Feature",
                                "featureType": "Sp",
                                "description": "<p>At 1st level, you can touch a creature as a standard action, giving it an insight bonus on attack rolls, skill checks, ability checks, and saving throws equal to 1/2 your sorcerer level (minimum 1) for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"
                            },
                            "Fated": {
                                "name": "Fated",
                                "type": "Class Feature",
                                "featureType": "Su",
                                "description": "<p>Starting at 3rd level, you gain a +1 luck bonus on all of your saving throws and to your AC during surprise rounds (see Combat) and when you are otherwise unaware of an attack. At 7th level and every four levels thereafter, this bonus increases by +1, to a maximum of +5 at 19th level.</p>"
                            },
                            "It Was Meant To Be": {
                                "name": "It Was Meant To Be",
                                "type": "Class Feature",
                                "featureType": "Su",
                                "description": "<p>At 9th level, you may reroll any one attack roll, critical hit confirmation roll, or level check made to overcome spell resistance. You must decide to use this ability after the first roll is made but before the results are revealed by the GM. You must take the second result, even if it is worse. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day.</p>"
                            },
                            "Within Reach": {
                                "name": "Within Reach",
                                "type": "Class Feature",
                                "featureType": "Su",
                                "description": "<p>At 15th level, your ultimate destiny is drawing near. Once per day, when an attack or spell that causes damage would result in your death, you may attempt a DC 20 Will save. If successful, you are instead reduced to –1 hit points and are automatically stabilized. The bonus from your fated ability applies to this save.</p>"
                            },
                            "Destiny Realized": {
                                "name": "Destiny Realized",
                                "type": "Class Feature",
                                "featureType": "Su",
                                "description": "<p>At 20th level, your moment of destiny is at hand. Any critical threats made against you only confirm if the second roll results in a natural 20 on the die. Any critical threats you score with a spell are automatically confirmed. Once per day, you can automatically succeed at one caster level check made to overcome spell resistance. You must use this ability before making the roll.</p>"
                            }
                        }
                    },
                    "Draconic": {
                        "name": "Draconic",
                        "type": "Bloodlines",
                        "description": "<p>At some point in your family's history, a dragon interbred with your bloodline, and now its ancient power flows through your veins.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Perception.</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>mage armor (3rd), resist energy (5th), fly (7th), fear (9th), spell resistance (11th), form of the dragon I (13th), form of the dragon II (15th), form of the dragon III (17th), wish (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Blind-Fight, Great Fortitude, Improved Initiative, Power Attack, Quicken Spell, Skill Focus (Fly), Skill Focus (Knowledge [arcana]), Toughness.</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell with an energy descriptor that matches your draconic bloodline's energy type, that spell deals +1 point of damage per die rolled.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>The power of dragons flows through you and manifests in a number of ways. At 1st level, you must select one of the chromatic or metallic dragon types. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your dragon type, as noted on the following table.</p><table><th><td>Dragon Type</td><td>Energy Type</td><td>Breath Shape</td></th><tr><td>Black</td><td>Acid</td><td>60-foot line</td></tr><tr><td>Blue</td><td>Electricity</td><td>60-foot line</td></tr><tr><td>Green</td><td>Acid</td><td>30-foot cone</td></tr><tr><td>Red</td><td>Fire</td><td>30-foot cone</td></tr><tr><td>White</td><td>Cold</td><td>30-foot cone</td></tr><tr><td>Brass</td><td>Fire</td><td>60-foot line</td></tr><tr><td>Bronze</td><td>Electricity</td><td>60-foot line</td></tr><tr><td>Copper</td><td>Acid</td><td>60-foot line</td></tr><tr><td>Gold</td><td>Fire</td><td>30-foot cone</td></tr><tr><td>Silver</td><td>Cold</td><td>30-foot cone</td></tr></table>",
                            "Claws": {
                                "name": "Claws",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>Starting at 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. Each of these attacks deals 1d4 points of damage plus your Strength modifier (1d3 if you are Small). At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws deal an additional 1d6 points of damage of your energy type on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.</p>"
                            },
                            "Dragon Resistances": {
                                "name": "Dragon Resistances",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, you gain resist 5 against your energy type and a +1 natural armor bonus. At 9th level, your energy resistance increases to 10 and natural armor bonus increases to +2. At 15th level, your natural armor bonus increases to +4.</p>"
                            },
                            "Breath Weapon": {
                                "name": "Breath Weapon",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 9th level, you gain a breath weapon. This breath weapon deals 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of the breath receive a Reflex save for half damage. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The shape of the breath weapon depends on your dragon type (as indicated on the above chart). At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day.</p>"
                            },
                            "Wings": {
                                "name": "Wings",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 15th level, leathery dragon wings grow from your back as a standard action, giving you a fly speed of 60 feet with average maneuverability. You can dismiss the wings as a free action.</p>"
                            },
                            "Power of Wyrms": {
                                "name": "Power of Wyrms",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 20th level, your draconic heritage becomes manifest. You gain immunity to paralysis, sleep, and damage of your energy type. You also gain blindsense 60 feet.</p>"
                            }
                        }
                    },
                    "Elemental": {
                        "name": "Elemental",
                        "type": "Bloodlines",
                        "description": "<p>The power of the elements resides in you, and at times you can hardly control its fury. This influence comes from an elemental outsider in your family history or a time when you or your relatives were exposed to a powerful elemental force.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Knowledge (planes).</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>burning hands* (3rd), scorching ray* (5th), protection from energy (7th), elemental body I (9th), elemental body II (11th), elemental body III (13th), elemental body IV (15th), summon monster VIII (elementals only) (17th), elemental swarm (19th).</p><p>*These spells always deal a type of damage determined by your element. In addition, the subtype of these spells changes to match the energy type of your element.</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge (planes)), Weapon Finesse.</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell that deals energy damage, you can change the type of damage to match the type of your bloodline. This also changes the spell's type to match the type of your bloodline.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>One of the four elements infuses your being, and you can draw upon its power in times of need. At first level, you must select one of the four elements: air, earth, fire, or water. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your element, as noted below.<table><th><td>Element</td><td>Energy Type</td><td>Elemental Movement</td></tr><tr><td>Air</td><td>Electricity</td><td>Fly 60 feet (average)<tr><td>Earth</td><td>Acid</td><td>Burrow 30 feet</td></tr><tr><td>Fire</td><td>Fire</td><td>+30 feet base speed</td></tr><tr><td>Water</td><td>Cold</td><td>Swim 60 feet</td></tr></table></p>",
                            "Elemental Ray": {
                                "name": "Elemental Ray",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of damage of your energy type + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"
                            },
                            "Elemental Resistance": {
                                "name": "Elemental Resistance",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, you gain energy resistance 10 against your energy type. At 9th level, your energy resistance increases to 20.</p>"
                            },
                            "Elemental Blast": {
                                "name": "Elemental Blast",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>At 9th level, you can unleash a blast of elemental power once per day. This 20-foot-radius burst does 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Creatures that fail their saves gain vulnerability to your energy type until the end of your next turn. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.</p>"
                            },
                            "Elemental Movement": {
                                "name": "Elemental Movement",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 15th level, you gain a special movement type or bonus. This ability is based on your chosen element, as indicated on the above chart.</p>"
                            },
                            "Elemental Body": {
                                "name": "Elemental Body",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 20th level, elemental power surges through your body. You gain immunity to sneak attacks, critical hits, and damage from your energy type.</p>"
                            }
                        }
                    },
                    "Fey": {
                        "name": "Fey",
                        "type": "Bloodlines",
                        "description": "<p>The capricious nature of the fey runs in your family due to some intermingling of fey blood or magic. You are more emotional than most, prone to bouts of joy and rage.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Knowledge (nature).</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>entangle (3rd), hideous laughter (5th), deep slumber (7th), poison (9th), tree stride (11th), mislead (13th), phase door (15th), irresistible dance (17th), shapechange (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Dodge, Improved Initiative, Lightning Reflexes, Mobility, Point Blank Shot, Precise Shot, Quicken Spell, Skill Focus (Knowledge (nature)).</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell of the compulsion subschool, increase the spell's DC by +2.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>You have always had a tie to the natural world, and as your power increases, so does the influence of the fey over your magic.</p>",
                            "Laughing Touch": {
                                "name": "Laughing Touch",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>At 1st level, you can cause a creature to burst out laughing for 1 round as a melee touch attack. A laughing creature can only take a move action but can defend itself normally. Once a creature has been affected by laughing touch, it is immune to its effects for 24 hours. You can use this ability a number of times per day equal to 3 + your Charisma modifier. This is a mind-affecting effect.</p>"
                            },
                            "Woodland Stride": {
                                "name": "Woodland Stride",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, you can move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at your normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect you.</p>"
                            },
                            "Fleeting Glance": {
                                "name": "Fleeting Glance",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>At 9th level, you can turn invisible for a number of rounds per day equal to your sorcerer level. This ability functions as greater invisibility. These rounds need not be consecutive.</p>"
                            },
                            "Fey Magic": {
                                "name": "Fey Magic",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 15th level, you may reroll any caster level check made to overcome spell resistance. You must decide to use this ability before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability at will.</p>"
                            },
                            "Soul of the Fey": {
                                "name": "Soul of the Fey",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 20th level, your soul becomes one with the world of the fey. You gain immunity to poison and DR 10/cold iron. Creatures of the animal type do not attack you unless compelled to do so through magic. Once per day, you can cast shadow walk as a spell-like ability using your sorcerer level as your caster level.</p>"
                            }
                        }
                    },
                    "Infernal": {
                        "name": "Infernal",
                        "type": "Bloodlines",
                        "description": "<p>Somewhere in your family's history, a relative made a deal with a devil, and that pact has influenced your family line ever since. In you, it manifests in direct and obvious ways, granting you powers and abilities. While your fate is still your own, you can't help but wonder if your ultimate reward is bound to the Pit.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Diplomacy.</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>protection from good (3rd), scorching ray (5th), suggestion (7th), charm monster (9th), dominate person (11th), planar binding (devils and creatures with the fiendish template only) (13th), greater teleport (15th), power word stun (17th), meteor swarm (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Blind-Fight, Combat Expertise, Deceitful, Extend Spell, Improved Disarm, Iron Will, Skill Focus (Knowledge [planes]), Spell Penetration.</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Whenever you cast a spell of the charm subschool, increase the spell's DC by +2.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>You can draw upon the power of Hell, although you must be wary of its corrupting influence. Such power does not come without a price.</p>",
                            "Corrupting Touch": {
                                "name": "Corrupting Touch",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>At 1st level, you can cause a creature to become shaken as a melee touch attack. This effect persists for a number of rounds equal to 1/2 your sorcerer level (minimum 1). Creatures shaken by this ability radiate an aura of evil, as if they were an evil outsider (see detect evil). Multiple touches do not stack, but they do add to the duration. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"
                            },
                            "Infernal Resistances": {
                                "name": "Infernal Resistances",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 3rd level, you gain resist fire 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to fire increases to 10 and your bonus on poison saving throws increases to +4.</p>"
                            },
                            "Hellfire": {
                                "name": "Hellfire",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>At 9th level, you can call down a column of hellfire. This 10-foot-radius burst does 1d6 points of fire damage per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Good creatures that fail their saves are shaken for a number of rounds equal to your sorcerer level. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.</p>"
                            },
                            "On Dark Wings": {
                                "name": "On Dark Wings",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 15th level, you can grow fearsome bat wings as a standard action, giving you a fly speed of 60 feet with average maneuverability. The wings can be dismissed as a free action.</p>"
                            },
                            "Power of the Pit": {
                                "name": "Power of the Pit",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 20th level, your form becomes infused with vile power. You gain immunity to fire and poison. You also gain resistance to acid 10 and cold 10, and the ability to see perfectly in darkness of any kind to a range of 60 feet.</p>"
                            }
                        }
                    },
                    "Undead": {
                        "name": "Undead",
                        "type": "Bloodlines",
                        "description": "<p>The taint of the grave runs through your family. Perhaps one of your ancestors became a powerful lich or vampire, or maybe you were born dead before suddenly returning to life. Either way, the forces of death move through you and touch your every action.</p>",
                        "Class Skill": {
                            "name": "Class Skill",
                            "type": "Class Feature",
                            "description": "<p>Knowledge (religion).</p>"
                        },
                        "Bonus Spells": {
                            "name": "Bonus Spells",
                            "type": "Class Feature",
                            "description": "<p>chill touch (3rd), false life (5th), vampiric touch (7th), animate dead (9th), waves of fatigue (11th), undeath to death (13th), finger of death (15th), horrid wilting (17th), energy drain (19th).</p>"
                        },
                        "Bonus Feats": {
                            "name": "Bonus Feats",
                            "type": "Class Feature",
                            "description": "<p>Combat Casting, Diehard, Endurance, Iron Will, Skill Focus (Knowledge [religion]), Spell Focus, Still Spell, Toughness.</p>"
                        },
                        "Bloodline Arcana": {
                            "name": "Bloodline Arcana",
                            "type": "Class Feature",
                            "description": "<p>Some undead are susceptible to your mind-affecting spells. Corporeal undead that were once humanoids are treated as humanoids for the purposes of determining which spells affect them.</p>"
                        },
                        "Bloodline Powers": {
                            "name": "Bloodline Powers",
                            "type": "Class Feature",
                            "description": "<p>You can call upon the foul powers of the afterlife. Unfortunately, the more you draw upon them, the closer you come to joining them.</p>",
                            "Grave Touch": {
                                "name": "Grave Touch",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>Starting at 1st level, you can make a melee touch attack as a standard action that causes a living creature to become shaken for a number of rounds equal to 1/2 your sorcerer level (minimum 1). If you touch a shaken creature with this ability, it becomes frightened for 1 round if it has fewer Hit Dice than your sorcerer level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"
                            },
                            "Death's Gift": {
                                "name": "Death's Gift",
                                "type": "Bloodline Power",
                                "featureType": "Su",
                                "description": "<p>At 3rd level, you gain resist cold 5 and DR 5/— against nonlethal damage. At 9th level, your resistance to cold increases to 10 and your DR increases to 10/— against nonlethal damage.</p>"
                            },
                            "Grasp of the Dead": {
                                "name": "Grasp of the Dead",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>At 9th level, you can cause a swarm of skeletal arms to burst from the ground to rip and tear at your foes. The skeletal arms erupt from the ground in a 20-foot-radius burst. Anyone in this area takes 1d6 points of slashing damage per sorcerer level. Those caught in the area receive a Reflex save for half damage. Those who fail the save are unable to move for 1 round. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The skeletal arms disappear after 1 round. The arms must burst up from a solid surface. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.</p>"
                            },
                            "Incorporeal Form": {
                                "name": "Incorporeal Form",
                                "type": "Bloodline Power",
                                "featureType": "Sp",
                                "description": "<p>At 15th level, you can become incorporeal for 1 round per sorcerer level. While in this form, you gain the incorporeal subtype. You only take half damage from corporeal sources as long as they are magic (you take no damage from non-magic weapons and objects). Likewise, your spells deal only half damage to corporeal creatures. Spells and other effects that do not deal damage function normally. You can use this ability once per day.</p>"
                            },
                            "One of Us": {
                                "name": "One of Us",
                                "type": "Bloodline Power",
                                "featureType": "Ex",
                                "description": "<p>At 20th level, your form begins to rot (the appearance of this decay is up to you) and undead see you as one of them. You gain immunity to cold, nonlethal damage, paralysis, and sleep. You also gain DR 5/—. Unintelligent undead do not notice you unless you attack them. You receive a +4 morale bonus on saving throws made against spells and spell-like abilities cast by undead.</p>"
                            }
                        }
                    }
                },
                "Cantrips": {
                    "name": "Cantrips",
                    "type": "Class Feature",
                    "description": "<p>Sorcerers learn a number of cantrips, or 0-level spells, as noted on Table: Sorcerer Spells Known under “Spells Known.” These spells are cast like any other spell, but they do not consume any slots and may be used again.</p>"
                },
                "Eschew Materials": {
                    "name": "Eschew Materials",
                    "type": "Class Feature",
                    "description": "<p>A sorcerer gains Eschew Materials as a bonus feat at 1st level.</p>"
                }
            }
        },
        "Wizard": {
            "name": "Wizard",
            "type": "Class",
            "description": "The wizard masters magic through constant study that gives him incredible magical power.",
            "hitDie": "6",
            "classSkills": [
                "Appraise", "Craft", "Fly", "Knowledge (all)", "Linguistics", "Profession", "Spellcraft"
            ],
            "skillsPerLevel": "2",
            "progression": {
                "BAB": [
                    "0", "1", "1", "2", "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10"
                ],
                "Fortitude": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Reflex": [
                    "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
                ],
                "Will": [
                    "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
                ],
                "spellsPerDay": [
                    [
                        "3", "1"
                    ], [
                        "4", "2"
                    ], [
                        "4", "2", "1"
                    ], [
                        "4", "3", "2"
                    ], [
                        "4", "3", "2", "1"
                    ], [
                        "4", "3", "3", "2"
                    ], [
                        "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "3", "2", "1"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "3", "3", "2"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "4", "3", "3"
                    ], [
                        "4", "4", "4", "4", "4", "4", "4", "4", "4", "4"
                    ]
                ]
            },
            "Class Features": {}
        }
    },
    "source": {
        "name": "Core Rulebook",
        "date": "2009-08-01"
    }
}
