{
    "Barbarian": {
        "name": "Barbarian",
        "type": "Class",
        "summary": "<p>The barbarian is a brutal berserker from beyond the edge of civilized lands.</p>",
        "description": "<p>For some, there is only rage. In the ways of their people, in the fury of their passion, in the howl of battle, conflict is all these brutal souls know. Savages, hired muscle, masters of vicious martial techniques, they are not soldiers or professional warriorsthey are the battle possessed, creatures of slaughter and spirits of war. Known as barbarians, these warmongers know little of training, preparation, or the rules of warfare; for them, only the moment exists, with the foes that stand before them and the knowledge that the next moment might hold their death. They possess a sixth sense in regard to danger and the endurance to weather all that might entail. These brutal warriors might rise from all walks of life, both civilized and savage, though whole societies embracing such philosophies roam the wild places of the world. Within barbarians storms the primal spirit of battle, and woe to those who face their rage.</p>",
        "Role": "<p>Barbarians excel in combat, possessing the martial prowess and fortitude to take on foes seemingly far superior to themselves. With rage granting them boldness and daring beyond that of most other warriors, barbarians charge furiously into battle and ruin all who would stand in their way.</p>",
        "hitDie": "12",
        "classSkills": [
            "Acrobatics", "Climb", "Craft", "Handle Animal", "Intimidate", "Knowledge (nature)", "Perception", "Ride", "Survival", "Swim"
        ],
        "skillsPerLevel": "4",
        "progression": {
            "BAB": [
                "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"
            ],
            "Fortitude": [
                "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
            ],
            "Reflex": [
                "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
            ],
            "Will": [
                "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
            ]
        },
        "source": {
            "name": "Core Rulebook",
            "date": "2009-08-01"
        },
        "alignmentRestrictions": ["Lawful"],
        "ageCategory": "Intuitive",
        "Class Features": {
            "Weapon and Armor Proficiency": {
                "name": "Weapon and Armor Proficiency",
                "type": "Class Feature",
                "description": "<p>A barbarian is proficient with all simple and martial weapons, light armor, medium armor, and shields (except tower shields).</p>",
                "addFeats": [
                    "Simple Weapons Proficiency", "Martial Weapons Proficiency", "Light Armor Proficiency", "Medium Armor Proficiency", "Shield Proficiency"
                ]
            },
            "Fast Movement": {
                "name": "Fast Movement",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>A barbarian's land speed is faster than the norm for her race by +10 feet. This benefit applies only when she is wearing no armor, light armor, or medium armor, and not carrying a heavy load. Apply this bonus before modifying the barbarian's speed because of any load carried or armor worn. This bonus stacks with any other bonuses to the barbarian's land speed.</p>",
                "speed": "10",
                "stacks": "true",
                "conditions": {
                    "armor": [
                        "none", "light", "medium"
                    ],
                    "encumberance": ["!heavyLoad"]
                }
            },
            "Rage": {
                "name": "Rage",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>A barbarian can call upon inner reserves of strength and ferocity, granting her additional combat prowess. Starting at 1st level, a barbarian can rage for a number of rounds per day equal to 4 + her Constitution modifier. At each level after 1st, she can rage for 2 additional rounds. Temporary increases to Constitution, such as those gained from rage and spells like bear's endurance, do not increase the total number of rounds that a barbarian can rage per day. A barbarian can enter rage as a free action. The total number of rounds of rage per day is renewed after resting for 8 hours, although these hours do not need to be consecutive.</p><p>While in rage, a barbarian gains a +4 morale bonus to her Strength and Constitution, as well as a +2 morale bonus on Will saves. In addition, she takes a –2 penalty to Armor Class. The increase to Constitution grants the barbarian 2 hit points per Hit Dice, but these disappear when the rage ends and are not lost first like temporary hit points. While in rage, a barbarian cannot use any Charisma-, Dexterity-, or Intelligence-based skills (except Acrobatics, Fly, Intimidate, and Ride) or any ability that requires patience or concentration.</p><p>A barbarian can end her rage as a free action and is fatigued after rage for a number of rounds equal to 2 times the number of rounds spent in the rage. A barbarian cannot enter a new rage while fatigued or exhausted but can otherwise enter rage multiple times during a single encounter or combat. If a barbarian falls unconscious, her rage immediately ends, placing her in peril of death.</p>"
            },
            "Rage Powers": {
                "name": "Rage Powers",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>As a barbarian gains levels, she learns to use her rage in new ways. Starting at 2nd level, a barbarian gains a rage power. She gains another rage power for every two levels of barbarian attained after 2nd level. A barbarian gains the benefits of rage powers only while raging, and some of these powers require the barbarian to take an action first. Unless otherwise noted, a barbarian cannot select an individual power more than once.</p><p>Totem rage powers grant powers in a theme. A barbarian cannot select from more than one group of totem rage powers. For example, a barbarian that selects a beast totem rage power cannot later chose to gain any of the spirit totem rage powers.</p>",
                "Animal Fury": {
                    "name": "Animal Fury",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian gains a bite attack. If used as part of a full attack action, the bite attack is made at the barbarian's full base attack bonus –5. If the bite hits, it deals 1d4 points of damage (assuming the barbarian is Medium; 1d3 points of damage if Small) plus half the barbarian's Strength modifier. A barbarian can make a bite attack as part of the action to maintain or break free from a grapple. This attack is resolved before the grapple check is made. If the bite attack hits, any grapple checks made by the barbarian against the target this round are at a +2 bonus.</p>"
                },
                "Clear Mind": {
                    "name": "Clear Mind",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A barbarian may reroll a failed Will save. This power is used as an immediate action after the first save is attempted, but before the results are revealed by the GM. The barbarian must take the second result, even if it is worse. A barbarian must be at least 8th level before selecting this power. This power can only be used once per rage.</p>"
                },
                "Fearless Rage": {
                    "name": "Fearless Rage",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian is immune to the shaken and frightened conditions. A barbarian must be at least 12th level before selecting this rage power.</p>"
                },
                "Guarded Stance": {
                    "name": "Guarded Stance",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian gains a +1 dodge bonus to her Armor Class against melee attacks for a number of rounds equal to the barbarian's current Constitution modifier (minimum 1). This bonus increases by +1 for every 6 levels the barbarian has attained. Activating this ability is a move action that does not provoke an attack of opportunity.</p>"
                },
                "Increased Damage Reduction": {
                    "name": "Increased Damage Reduction",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian's damage reduction increases by 1/—. This increase is always active while the barbarian is raging. A barbarian can select this rage power up to three times. Its effects stack. A barbarian must be at least 8th level before selecting this rage power.</p>"
                },
                "Internal Fortitude": {
                    "name": "Internal Fortitude",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian is immune to the sickened and nauseated conditions. A barbarian must be at least 8th level before selecting this rage power.</p>"
                },
                "Intimidating Glare": {
                    "name": "Intimidating Glare",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian can make an Intimidate check against one adjacent foe as a move action. If the barbarian successfully demoralizes her opponent, the foe is shaken for 1d4 rounds + 1 round for every 5 points by which the barbarian's check exceeds the DC.</p>"
                },
                "Knockback": {
                    "name": "Knockback",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per round, the barbarian can make a bull rush attempt against one target in place of a melee attack. If successful, the target takes damage equal to the barbarian's Strength modifier and is moved back as normal. The barbarian does not need to move with the target if successful. This does not provoke an attack of opportunity.</p>"
                },
                "Low-Light Vision": {
                    "name": "Low-Light Vision",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian's senses sharpen and she gains low-light vision while raging.</p>"
                },
                "Mighty Swing": {
                    "name": "Mighty Swing",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian automatically confirms a critical hit. This power is used as an immediate action once a critical threat has been determined. A barbarian must be at least 12th level before selecting this power. This power can only be used once per rage.</p>"
                },
                "Moment of Clarity": {
                    "name": "Moment of Clarity",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian does not gain any benefits or take any of the penalties from rage for 1 round. Activating this power is a swift action. This includes the penalty to Armor Class and the restriction on what actions can be performed. This round still counts against her total number of rounds of rage per day. This power can only be used once per rage.</p>"
                },
                "Night Vision": {
                    "name": "Night Vision",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian's senses grow incredibly sharp while raging and she gains darkvision 60 feet. A barbarian must have low-light vision as a rage power or a racial trait to select this rage power.</p>"
                },
                "No Escape": {
                    "name": "No Escape",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian can move up to double her normal speed as an immediate action but she can only use this ability when an adjacent foe uses a withdraw action to move away from her. She must end her movement adjacent to the enemy that used the withdraw action. The barbarian provokes attacks of opportunity as normal during this movement. This power can only be used once per rage.</p>"
                },
                "Powerful Blow": {
                    "name": "Powerful Blow",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian gains a +1 bonus on a single damage roll. This bonus increases by +1 for every 4 levels the barbarian has attained. This power is used as a swift action before the roll to hit is made. This power can only be used once per rage.</p>"
                },
                "Quick Reflexes": {
                    "name": "Quick Reflexes",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian can make one additional attack of opportunity per round.</p>"
                },
                "Raging Climber": {
                    "name": "Raging Climber",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When raging, the barbarian adds her level as an enhancement bonus on all Climb skill checks.</p>"
                },
                "Raging Leaper": {
                    "name": "Raging Leaper",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When raging, the barbarian adds her level as an enhancement bonus on all Acrobatics skill checks made to jump. When making a jump in this way, the barbarian is always considered to have a running start.</p>"
                },
                "Raging Swimmer": {
                    "name": "Raging Swimmer",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When raging, the barbarian adds her level as an enhancement bonus on all Swim skill checks.</p>"
                },
                "Renewed Vigor": {
                    "name": "Renewed Vigor",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>As a standard action, the barbarian heals 1d8 points of damage + her Constitution modifier. For every four levels the barbarian has attained above 4th, this amount of damage healed increases by 1d8, to a maximum of 5d8 at 20th level. A barbarian must be at least 4th level before selecting this power. This power can be used only once per day and only while raging.</p>"
                },
                "Rolling Dodge": {
                    "name": "Rolling Dodge",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian gains a +1 dodge bonus to her Armor Class against ranged attacks for a number of rounds equal to the barbarian's current Constitution modifier (minimum 1). This bonus increases by +1 for every 6 levels the barbarian has attained. Activating this ability is a move action that does not provoke an attack of opportunity.</p>"
                },
                "Roused Anger": {
                    "name": "Roused Anger",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian may enter a rage even if fatigued. While raging after using this ability, the barbarian is immune to the fatigued condition. Once this rage ends, the barbarian is exhausted for 10 minutes per round spent raging.</p>"
                },
                "Scent": {
                    "name": "Scent",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian gains the scent ability while raging and can use this ability to locate unseen foes (see Special Abilities for rules on the scent ability).</p>"
                },
                "Strength Surge": {
                    "name": "Strength Surge",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian adds her barbarian level on one Strength check or combat maneuver check, or to her Combat Maneuver Defense when an opponent attempts a maneuver against her. This power is used as an immediate action. This power can only be used once per rage.</p>"
                },
                "Superstition": {
                    "name": "Superstition",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian gains a +2 morale bonus on saving throws made to resist spells, supernatural abilities, and spell-like abilities. This bonus increases by +1 for every 4 levels the barbarian has attained. While raging, the barbarian cannot be a willing target of any spell and must make saving throws to resist all spells, even those cast by allies.</p>"
                },
                "Surprise Accuracy": {
                    "name": "Surprise Accuracy",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian gains a +1 morale bonus on one attack roll. This bonus increases by +1 for every 4 levels the barbarian has attained. This power is used as a swift action before the roll to hit is made. This power can only be used once per rage.</p>"
                },
                "Swift Foot": {
                    "name": "Swift Foot",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian gains a 5-foot enhancement bonus to her speed. This increase is always active while the barbarian is raging. A barbarian can select this rage power up to three times. Its effects stack.</p>"
                },
                "Terrifying Howl": {
                    "name": "Terrifying Howl",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian unleashes a terrifying howl as a standard action. All shaken enemies within 30 feet must make a Will save (DC equal to 10 + 1/2 the barbarian's level + the barbarian's Strength modifier) or be panicked for 1d4+1 rounds. Once an enemy has made a save versus terrifying howl (successful or not), it is immune to this power for 24 hours. A barbarian must have the intimidating glare rage power to select this rage power. A barbarian must be at least 8th level before selecting this power.</p>"
                },
                "Unexpected Strike": {
                    "name": "Unexpected Strike",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The barbarian can make an attack of opportunity against a foe that moves into any square threatened by the barbarian, regardless of whether or not that movement would normally provoke an attack of opportunity. This power can only be used once per rage. A barbarian must be at least 8th level before selecting this power.</p>"
                },
                "Beast Totem": {
                    "name": "Beast Totem",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian gains a +1 natural armor bonus. This bonus increases by +1 for every four levels the barbarian has attained. A barbarian must have the lesser beast totem rage power to select this rage power. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Beast Totem, Greater": {
                    "name": "Beast Totem, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian gains the pounce special ability, allowing her to make a full attack at the end of a charge. In addition, the damage from her claws increases to 1d8 (1d6 if Small) and the claws deal ×3 damage on a critical hit. A barbarian must have the beast totem rage power to select this rage power. A barbarian must be at least 10th level to select this rage power.</p>"
                },
                "Beast Totem, Lesser": {
                    "name": "Beast Totem, Lesser",
                    "type": "Class Feature",
                    "specialAbilityType": "Su)",
                    "description": "<p>While raging, the barbarian gains two claw attacks. These attacks are considered primary attacks and are made at the barbarian's full base attack bonus. The claws deal 1d6 points of slashing damage (1d4 if Small) plus the barbarian's Strength modifier.</p>"
                },
                "Boasting Taunt": {
                    "name": "Boasting Taunt",
                    "type": "Class Feature",
                    "specialAbilityType": "Ex)",
                    "description": "<p>While raging, the barbarian can incite a creature to attack her by making an Intimidate check to demoralize. If the check succeeds, the target is also shaken as long as the barbarian is visible and raging or until it makes a melee attack against the barbarian. The barbarian receives a +2 circumstance bonus on this check for every alcoholic drink she has consumed during this rage. This is a language-dependent mind-affecting effect, and it relies on audible components. The barbarian must be at least 6th level to select this power.</p>"
                },
                "Brawler": {
                    "name": "Brawler",
                    "type": "Class Feature",
                    "description": "<p>While raging, the barbarian is treated as if she has Improved Unarmed Strike. If she already has the feat, her unarmed strikes deal 1d6 points of damage (1d4 if she is Small).</p>"
                },
                "Brawler, Greater": {
                    "name": "Brawler, Greater",
                    "type": "Class Feature",
                    "description": "<p>While raging, the barbarian is treated as if she has Two-Weapon Fighting when making unarmed strike attacks. A barbarian must have the brawler rage power to select this rage power.</p>"
                },
                "Chaos Totem": {
                    "name": "Chaos Totem",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian's form becomes infused with chaos. She gains a +4 bonus on Escape Artist checks and has a 25% chance to ignore extra damage from critical hits and sneak attacks. A barbarian must have the lesser chaos totem rage power to select this rage power. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Chaos Totem, Greater": {
                    "name": "Chaos Totem, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian gains DR/lawful equal to 1/2 her barbarian level. Her weapons and natural weapons are considered chaotic for the purpose of overcoming damage reduction. A barbarian must have the chaos totem rage power to select this rage power. A barbarian must be at least 10th level to select this rage power.</p>"
                },
                "Chaos Totem, Lesser": {
                    "name": "Chaos Totem, Lesser",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian gains a +1 deflection bonus to AC against the attacks of lawful creatures and a +1 resistance bonus on saving throws against confusion, insanity, polymorph, and effects with the lawful descriptor. This bonus increases by +1 for each chaos totem rage power she possesses.</p>"
                },
                "Come and Get Me": {
                    "name": "Come and Get Me",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, as a free action the barbarian may leave herself open to attack while preparing devastating counterattacks. Enemies gain a +4 bonus on attack and damage rolls against the barbarian until the beginning of her next turn, but every attack against the barbarian provokes an attack of opportunity from her, which is resolved prior to resolving each enemy attack. A barbarian must be at least 12th level to select this rage power.</p>"
                },
                "Disruptive": {
                    "name": "Disruptive",
                    "type": "Class Feature",
                    "description": "<p>When raging, the barbarian gains Disruptive as a bonus feat. The barbarian must have the superstition* rage power to select this rage power. A barbarian must be at least 8th level to select this rage power.</p>"
                },
                "Elemental Rage": {
                    "name": "Elemental Rage",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, all of the barbarian's melee attacks deal an additional 1d6 points of energy damage (acid, cold, electricity, or fire). The type is chosen when the barbarian begins her rage. A barbarian must have the lesser elemental rage power to select this rage power. A barbarian must be at least 8th level to select this rage power. Note that the barbarian can still use her lesser elemental rage power while using this rage power, but she must select a different energy type.</p>"
                },
                "Elemental Rage, Greater": {
                    "name": "Elemental Rage, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, all of the barbarian's critical hits made with melee weapons deal an additional 1d10 points of energy damage (2d10 if the weapon deals ×3 damage on a critical hit, 3d10 if the weapon deals ×4 on a critical hit). The type of this damage is the same as the type chosen for the elemental rage power. A barbarian must have the elemental rage power to select this rage power. A barbarian must be at least 12th level to select this rage power.</p>"
                },
                "Elemental Rage, Lesser": {
                    "name": "Elemental Rage, Lesser",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>As a swift action, the barbarian can cause her melee attacks to deal an additional 1d6 points of energy damage (acid, cold, electricity, or fire) for 1 round. A barbarian must be at least 4th level to select this rage power. This power can only be used once per rage.</p>"
                },
                "Energy Absorption": {
                    "name": "Energy Absorption",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian can absorb energy from a single attack of her chosen energy type once per rage. She does not make a saving throw against the effect but takes no damage from it, instead gaining 1 temporary hit point per 3 points of damage the attack would have inflicted. These temporary hit points last until the end of the barbarian's rage. A barbarian must have the greater energy resistance rage power to select this rage power. A barbarian must be at least 12th level to select this rage power.</p>"
                },
                "Energy Eruption": {
                    "name": "Energy Eruption",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian can absorb energy from a single attack and unleash it upon her enemies once per rage. She does not make a saving throw against the effect but takes no damage from it. At any point during the remainder of her rage she can unleash the stored energy as a breath weapon in either a 60-foot line or 30-foot cone. The breath weapon inflicts damage equal to the damage from the attack absorbed by the barbarian, but creatures within the area may make a Reflex save (DC 10 + 1/2 the barbarian's level + the barbarian's Constitution modifier) for half damage even if the original effect did not allow a save. A barbarian must have the energy absorption rage power to select this rage power. A barbarian must be at least 16th level to select this rage power.</p>"
                },
                "Energy Resistance": {
                    "name": "Energy Resistance",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian gains resistance to one energy type (acid, cold, electricity, fire, or sonic) equal to 1/2 her barbarian level (minimum 1). The energy type is chosen when this rage power is selected and it cannot be changed. This rage power can be selected more than once. Its effects do not stack. Each time is applies to a different energy type.</p>"
                },
                "Energy Resistance, Greater": {
                    "name": "Energy Resistance, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per rage, a barbarian can reduce damage by half from a single attack against which she has energy resistance (halve the damage, then apply resistance). A barbarian must have the energy resistance rage power to select this rage power. A barbarian must be at least 8th level to select this rage power.</p>"
                },
                "Ferocious Mount": {
                    "name": "Ferocious Mount",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging and mounted, the barbarian's mount also gains the benefits of rage (including greater rage and mighty rage) as long as the barbarian is mounted or adjacent to it. While her mount is raging in this way, she must spend one additional round of rage per round. She can elect not to pay this cost, in which case her mount does not rage.</p>"
                },
                "Ferocious Mount, Greater": {
                    "name": "Ferocious Mount, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging and mounted, the barbarian's mount gains the benefits of any rage powers that are constant in effect when the barbarian is raging. It does not gain the benefit of any rage powers that require actions to activate, even if they are free actions. A barbarian must have the ferocious mount rage power to select this rage power. A barbarian must be at least 8th level to select this rage power.</p>"
                },
                "Ferocious Trample": {
                    "name": "Ferocious Trample",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging and mounted, the barbarian's mount gains the trample special attack (Pathfinder RPG Bestiary 305). This attack inflicts 1d8 points of damage for a Medium mount, 2d6 for a Large mount, or 2d8 for a Huge mount, plus 1–1/2 times the mount's Strength modifier. A successful Reflex save (DC 10 + 1/2 the barbarian's level + the mount's Strength modifier) halves this damage. Creatures in the mount's path or that threaten squares it passes through may make attacks of opportunity against either the barbarian or the mount, but not both. A barbarian must have the ferocious mount rage power to select this rage power. A barbarian must be at least 8th level to select this rage power.</p>"
                },
                "Ferocious Trample, Greater": {
                    "name": "Ferocious Trample, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A barbarian's mount can affect creatures up to its own size with its ferocious trample. In addition, it can make an overrun combat maneuver check as a free action against a creature that fails its Reflex save (or chooses not to save in order to take an attack of opportunity) against its trample. A barbarian must have the ferocious trample rage power to select this rage power. A barbarian must be at least 12th level to select this rage power.</p>"
                },
                "Fiend Totem": {
                    "name": "Fiend Totem",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian sprouts dozens of wicked barbs from her body. Anyone striking the barbarian with a melee weapon, an unarmed strike, or a natural weapon takes 1d6 points of piercing damage. A barbarian must have the lesser fiend totem rage power to select this rage power. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Fiend Totem, Greater": {
                    "name": "Fiend Totem, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian is surrounded by an aura of menace. Good creatures adjacent to the barbarian are shaken and take 2d6 points of slashing damage at the beginning of the barbarian's turn as dozens of small cuts open across their flesh. Neutral creatures that are adjacent to the barbarian are shaken, but do not take any damage. Evil creatures are unaffected. A barbarian must have the fiend totem rage power to select this rage power. A barbarian must be at least 10th level to select this rage power.</p>"
                },
                "Fiend Totem, Lesser": {
                    "name": "Fiend Totem, Lesser",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian grows a pair of large horns, gaining a gore attack. This attack is a primary attack (unless she is also attacking with weapons, in which case it is a secondary attack) and is made at the barbarian's full base attack bonus (–5 if it is a secondary attack). The gore attack deals 1d8 points of piercing damage (1d6 if Small) plus the barbarian's Strength modifier (1/2 if it is a secondary attack).</p>"
                },
                "Flesh Wound": {
                    "name": "Flesh Wound",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per rage, the barbarian can try to avoid serious harm from an attack. The barbarian must make a Fortitude save with a DC equal to the damage that would be dealt by the attack. The barbarian's armor check penalty applies on this saving throw. If the save succeeds, the barbarian takes half damage from the attack and the damage is nonlethal. The barbarian must elect to use this ability after the attack roll is made, but before the damage is rolled. A barbarian must be at least 10th level to select this rage power.</p>"
                },
                "Good for What Ails You": {
                    "name": "Good for What Ails You",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian who takes a drink of alcohol may attempt a new saving throw against one of the following conditions that may be affecting her: blinded, confused, dazzled, deafened, exhausted, fatigued, frightened, nauseated, panicked, shaken, or sickened. If she succeeds at the save, the effect is suppressed for the duration of the rage. She also may attempt a new saving throw if poisoned; a successful save counts against those required for a cure, but a failed save has no ill effect.</p>"
                },
                "Ground Breaker": {
                    "name": "Ground Breaker",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per rage, the barbarian can attack the floor around her as a standard action. This attack automatically hits and deals damage normally. If the barbarian manages to deal more damage than the floor's hardness, the space she occupies and all of the squares adjacent to her become difficult terrain. Creatures in these squares, except the barbarian, must make a DC 15 Reflex save or be knocked prone. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Guarded Life": {
                    "name": "Guarded Life",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, if the barbarian is reduced below 0 hit points, 1 hit point of lethal damage per barbarian level is converted to nonlethal damage. If the barbarian is at negative hit points due to lethal damage, she immediately stabilizes.</p>"
                },
                "Hurling": {
                    "name": "Hurling",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>As lesser hurling, but the barbarian can increase the range increment to 20 feet or increase the size of a hurled object by one size category. A barbarian must have the lesser hurling rage power to select this rage power. A barbarian must be at least 8th level to select this rage power.</p>"
                },
                "Hurling, Greater": {
                    "name": "Hurling, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>As hurling, but the barbarian can increase the range increment to 30 feet or increase the size of a hurled object by two size categories. A barbarian must have the hurling rage power to select this rage power. A barbarian must be at least 12th level to select this rage power.</p>"
                },
                "Hurling, Lesser": {
                    "name": "Hurling, Lesser",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>As a full-round action while raging, the barbarian can lift and hurl an object up to one size category smaller than herself with both hands or two size categories smaller with one hand as an improvised weapon with a range increment of 10 feet. This inflicts damage as a falling object (Core Rulebook 443) plus the barbarian's Strength bonus. This damage is halved if the object is not made of stone, metal, or similar material. This is a ranged touch attack, and the target may attempt a Reflex save (DC 10 + 1/2 the barbarian's level + the barbarian's Strength modifier) for half damage. The barbarian may apply Power Attack to this attack as a one- or two-handed weapon, as appropriate.</p>"
                },
                "Hurling Charge": {
                    "name": "Hurling Charge",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging and making a charge attack, the barbarian may draw and throw a hurled weapon during her charge, gaining the normal +2 attack roll bonus on the thrown weapon attack as well as on the melee attack at the end of the charge. The barbarian must move at least 10 feet before using a thrown weapon and at least 10 additional feet before making a melee attack at the end of her charge. The barbarian must have a thrown weapon in hand or have one hand free at the beginning of her charge. A barbarian must have the lesser hurling rage power to select this rage power. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Inspire Ferocity": {
                    "name": "Inspire Ferocity",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian can use a move action to impart her reckless abandon modifier to all willing allies within 30 feet for a number of rounds equal to her Charisma modifier (minimum 1). A barbarian must have the reckless abandon rage power to select this rage power.</p>"
                },
                "Knockdown": {
                    "name": "Knockdown",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per rage, the barbarian can make a trip attack against one target in place of a melee attack. If successful, the target takes damage equal to the barbarian's Strength modifier and is knocked prone. This does not provoke an attack of opportunity.</p>"
                },
                "Liquid Courage": {
                    "name": "Liquid Courage",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian increases her morale bonus on saving throws against mind-affecting effects by +1 for each alcoholic drink she consumes during her rage, to a maximum of +1 increase per four barbarian levels.</p>"
                },
                "Overbearing Advance": {
                    "name": "Overbearing Advance",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian inflicts damage equal to her Strength bonus whenever she succeeds at an overrun combat maneuver.</p>"
                },
                "Overbearing Onslaught": {
                    "name": "Overbearing Onslaught",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian may overrun more than one target per round, with a –2 penalty on her CMB for each overrun check after the first. A barbarian must have the overbearing advance rage power to select this rage power. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Reckless Abandon": {
                    "name": "Reckless Abandon",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian can take a –1 penalty to AC to gain a +1 bonus on attack rolls. The AC penalty increases by –1 and the attack roll bonus increases by +1 at 4th level and every four levels thereafter.</p>"
                },
                "Roaring Drunk": {
                    "name": "Roaring Drunk",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian gains a +1 morale bonus on Intimidate checks and to the save DC of any fear effects she creates for each alcoholic drink she has consumed during her rage, to a maximum of +1 per four barbarian levels.</p>"
                },
                "Smasher": {
                    "name": "Smasher",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per rage, whenever the barbarian makes an attack against an unattended object or a sunder combat maneuver, she can ignore the object's hardness. This ability must be used before the attack roll or sunder check is made.</p>"
                },
                "Spellbreaker": {
                    "name": "Spellbreaker",
                    "type": "Class Feature",
                    "description": "<p>When raging, the barbarian gains Spellbreaker as a bonus feat. A barbarian must have the disruptive rage power and be at least 12th level to select this rage power.</p>"
                },
                "Spirit Steed": {
                    "name": "Spirit Steed",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging and mounted, the barbarian's mount gains DR/magic equal to 1/2 the barbarian's level. The mount's natural weapons count as magical for the purpose of overcoming damage reduction. A barbarian must have the ferocious mount rage power to select this rage power. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Spirit Totem": {
                    "name": "Spirit Totem",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the spirits that surround the barbarian make it difficult for her enemies to see her. The spirits grant the barbarian a 20% miss chance against ranged attacks and melee attacks made by creatures that are not adjacent to the barbarian (typically due to reach). A barbarian must have the lesser spirit totem rage power to select this rage power. A barbarian must be at least 6th level to select this rage power.</p>"
                },
                "Spirit Totem, Greater": {
                    "name": "Spirit Totem, Greater",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the spirits that surround the barbarian become dangerous to any enemy adjacent to the barbarian. Living enemies adjacent to the barbarian at the start of her turn take 1d8 points of negative energy damage. In addition, the spirit wisps can now attack foes that are up to 15 feet away from the barbarian and the slam attack deals 1d6 points of negative energy damage. A barbarian must have the spirit totem rage power and be at least 10th level to select this rage power.</p>"
                },
                "Spirit Totem, Lesser": {
                    "name": "Spirit Totem, Lesser",
                    "type": "Class Feature",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian is surrounded by spirit wisps that harass her foes. These spirits make one slam attack each round against a living foe that is adjacent to the barbarian. This slam attack is made using the barbarian's full base attack bonus, plus the barbarian's Charisma modifier. The slam deals 1d4 points of negative energy damage, plus the barbarian's Charisma modifier.</p>"
                },
                "Staggering Drunk": {
                    "name": "Staggering Drunk",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, a barbarian gains a +1 dodge bonus to AC against attacks of opportunity for each alcoholic drink she has consumed during her rage, to a maximum of +1 per four barbarian levels.</p>"
                },
                "Witch Hunter": {
                    "name": "Witch Hunter",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian gains a +1 bonus on damage rolls against creatures possessing spells or spell-like abilities. This damage bonus increases by +1 for every four levels the barbarian has obtained. A barbarian must have the superstition* rage power to select this rage power.</p>"
                },
                "Auspicious Mark": {
                    "name": "Auspicious Mark",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>The barbarian has been marked by the spirits, as indicated by an impressive tattoo, scar, or birthmark she possesses. Once per rage, as a swift action that costs 2 rounds of rage, the barbarian can call upon the spirits' favor. Using auspicious mark grants her a +1d6 bonus on one d20 roll she has just made. She can call on the auspicious mark after seeing the result of the d20 roll.</p>"
                },
                "Bestial Climber": {
                    "name": "Bestial Climber",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian gains a natural climb speed equal to her land speed. A barbarian must have the raging climber rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Bestial Leaper": {
                    "name": "Bestial Leaper",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian can take a move action to move and can take her normal standard action at any point during the move. A barbarian must have the raging leaper rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Bestial Swimmer": {
                    "name": "Bestial Swimmer",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian gains a natural swim speed equal to her normal land speed. A barbarian must have the raging swimmer rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Bleeding Blow": {
                    "name": "Bleeding Blow",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When she uses her powerful blow rage power, the barbarian also deals bleed damage equal to her bonus damage with the powerful blow. This bleed damage bypasses damage reduction. A barbarian must have the powerful blow rage power and be at least 8th level before selecting this rage power.</p>"
                },
                "Body Bludgeon": {
                    "name": "Body Bludgeon",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, if the barbarian pins an opponent that is smaller than her, she can then use that opponent as a two-handed improvised weapon that deals 1d8 points of bludgeoning damage, assuming the opponent is sized Small. Larger or smaller creatures used as a bludgeon deal damage based on their size using this base damage. A size Tiny creature deals 1d6 points of damage, a size Medium creature deals 1d10 points of damage, and so on. The barbarian can make a single attack using the pinned opponent as part of the action she uses to maintain the grapple, using her highest attack bonus. Whenever the barbarian hits using the pinned opponent as a weapon, she deals damage to her target normally, and the grappled opponent used as a bludgeon also takes the same damage she dealt to the target. If the pinned opponent is unable to resist being pinned for any reason, the barbarian can use that opponent as an improvised weapon without grappling or pinning the opponent, until the creature is reduced to 0 or fewer hit points, at which point the creature becomes useless as an improvised weapon. A barbarian must be at least 10th level before selecting this rage power.</p>"
                },
                "Crippling Blow": {
                    "name": "Crippling Blow",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When using her powerful blow rage power, the barbarian can forgo the normal bonus to damage (including any bleed damage granted by the bleeding blow rage power or similar boosts to the damage of the powerful blow rage power) and instead deals 1 point of ability damage to the target's Strength or Dexterity score for every four class levels the barbarian has attained. The target can attempt a Fortitude saving throw (DC 10 + 1/2 the barbarian's level + the barbarian's Strength modifier) to halve this ability damage. A barbarian must have the powerful blow rage power and be at least 8th level before selecting this rage power.</p>"
                },
                "Deadly Accuracy": {
                    "name": "Deadly Accuracy",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>If the barbarian scores a critical threat when using her surprise accuracy rage power, she applies double the surprise accuracy bonus when rolling to confirm the critical. A barbarian must have the surprise accuracy rage power and be at least 4th level before selecting this rage power.</p>"
                },
                "Dragon Totem": {
                    "name": "Dragon Totem",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>The barbarian must select a single color of dragon (black, blue, brass, bronze, copper, gold, green, red, silver, or white) as her totem. While raging, she gains a +1 bonus on Perception checks and a +1 morale bonus on saving throws against fear, paralysis, and sleep effects. This bonus increases by +1 for each additional dragon totem rage power (such as dragon totem resilience and dragon totem wings) the barbarian possesses. A barbarian must have the animal fury and intimidating glare rage powers and be at least 6th level before selecting this rage power.</p>"
                },
                "Dragon Totem Resilience": {
                    "name": "Dragon Totem Resilience",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian gains resistance to the energy type that is associated with her dragon totem—acid (black, copper, green), cold (silver, white), electricity (blue, bronze), or fire (brass, gold, red). This resistance equals double her current DR/— from her barbarian damage reduction class feature; this DR increases by 2 for each dragon totem rage power she possesses, including this one. A barbarian must have the dragon totem rage power and be at least 8th level before selecting this rage power.</p>"
                },
                "Dragon Totem Wings": {
                    "name": "Dragon Totem Wings",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>When a barbarian selects this rage power, the Fly (Dex) skill becomes a class skill for her. While raging and wearing medium or lighter armor, the barbarian can spend a standard action to manifest a pair of spiritual dragon wings that grant her a fly speed equal to her base speed (average maneuverability). She can expend 2 rounds of her rage to instead spend an immediate action to gain this fly speed. She can end her fly speed at any time, even when it is not her turn. Each round she spends raging and flying counts as 2 rounds of rage. Her ability to fly ends automatically when she ceases raging. A barbarian must have the dragon totem and dragon totem resilience rage powers, and she must be at least 10th level before selecting this rage power.</p>"
                },
                "Eater of Magic": {
                    "name": "Eater of Magic",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>Once per rage, when a barbarian fails a saving throw against a spell, supernatural ability, or spell-like ability, she can reroll the saving throw against the effect (this is not an action). If she succeeds at the second saving throw, she is not affected by the spell, supernatural ability, or spell-like ability and gains a number of temporary hit points equal to the effect's caster level (in the case of spell or spell-like abilities) or the CR of the effect's creator (in the case of supernatural abilities). These temporary hit points last until damage is applied to them or 1 minute, whichever occurs first. A barbarian must have the superstition rage power and be at least 10th level before selecting this rage power.</p>"
                },
                "Ghost Rager": {
                    "name": "Ghost Rager",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian deals normal damage to incorporeal creatures even when using nonmagical weapons. She also gains a morale bonus to touch AC equal to her saving throw bonus from her superstition rage power. A barbarian must have the superstition rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Ground Breaker, Greater": {
                    "name": "Ground Breaker, Greater",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When using the ground breaker rage power, the barbarian can extend the radius of the effect by 5 feet. This rage power can be selected up to three times, and its effects stack. A barbarian must have the ground breaker rage power and be at least 8th level before selecting this rage power.</p>"
                },
                "Guarded Life, Greater": {
                    "name": "Guarded Life, Greater",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When using the guarded life rage power, 1 additional hit point of lethal damage per barbarian level is converted to nonlethal damage. A barbarian must have the guarded life rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Hive Totem": {
                    "name": "Hive Totem",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian takes half damage from attacks by swarms of vermin, including spells and effects that act like a swarm of vermin (like summon swarm used to summon spiders or insect plague). She also gains a +1 bonus on Strength ability checks and to CMD against bull rush, drag, and trip attacks for every four barbarian levels she has (maximum +5). A barbarian must have the animal fury power and be at least 4th level before selecting this rage power.</p>"
                },
                "Hive Totem Resilience": {
                    "name": "Hive Totem Resilience",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian takes no damage from attacks by swarms of vermin, preventing harmful secondary effects of such attacks like poison or bleed. She also gains a +1 bonus on combat maneuver checks and to CMD when grappling for every four barbarian levels she has (maximum +5). A barbarian must have the hive totem rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Hive Totem Toxicity": {
                    "name": "Hive Totem Toxicity",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian increases her bite damage die type with the animal fury rage power by one die type and decreases the penalty on attack rolls with that bite to –2. Once per rage, a bite that hits can deliver an injury toxin that has a frequency of once per round for 4 rounds, deals 1d3 points of Constitution damage, and has a cure of one save. The saving throw has a Fortitude save DC of 10 + 1/2 the barbarian's level + the barbarian's Constitution modifier. A barbarian must have the hive totem and hive totem resilience rage powers and be at least 8th level before selecting this rage power.</p>"
                },
                "Lethal Accuracy": {
                    "name": "Lethal Accuracy",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When using her surprise accuracy rage power, the barbarian's critical multiplier for damage increases by 1 (a ×2 multiplier becomes ×3, a 19–20/×2 multiplier becomes 19–20/×3, a ×3 multiplier becomes ×4, and a ×4 multiplier becomes ×5). A barbarian must have the surprise accuracy and deadly accuracy rage powers and be 16th level before selecting this rage power.</p>"
                },
                "Perfect Clarity": {
                    "name": "Perfect Clarity",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While using her moment of clarity rage power, the barbarian can roll twice for any miss chance or Will saving throws to disbelieve illusions, taking the better result. A barbarian must have the moment of clarity rage power before selecting this rage power.</p>"
                },
                "Primal Scent": {
                    "name": "Primal Scent",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When using her scent rage power, the barbarian adds half her barbarian level on Survival checks made to track by scent and on Perception checks to pinpoint the location of creatures she cannot see. If she pinpoints the location of a creature that has total concealment, she treats it as having concealment. A barbarian must have the scent rage power and be at least 8th level before selecting this rage power.</p>"
                },
                "Reflexive Dodge": {
                    "name": "Reflexive Dodge",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While using her rolling dodge rage power, the barbarian may apply her dodge bonus to AC as a bonus on Reflex saving throws. A barbarian must have the rolling dodge rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Regenerative Vigor": {
                    "name": "Regenerative Vigor",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>After using her renewed vigor rage power until her current rage ends, the barbarian gains fast healing 1 for every 6 barbarian levels she has (maximum fast healing 3). She regains hit points from fast healing at the start of each of her turns. A barbarian must have the renewed vigor rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Renewed Life": {
                    "name": "Renewed Life",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian ignores the effect of one temporary negative level per four barbarian levels she has (maximum 5). Once per day, when a barbarian with temporary negative levels ends her rage, she can attempt saving throws to remove a number of negative levels equal to the number of levels she could ignore while raging. A barbarian must have the renewed vitality rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Renewed Vitality": {
                    "name": "Renewed Vitality",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the barbarian ignores the effect of 1 point of ability penalty or damage per two barbarian levels she has (maximum 10). Once per day, when a barbarian with ability penalties or damage ends her rage, she can reroll a saving throw, if any, against an effect that imposed an ability penalty or dealt her ability damage. If successful, she removes an amount of ability penalty or damage equal to the amount she can ignore while raging. A barbarian must have the renewed vigor rage power and be at least 4th level before selecting this rage power.</p>"
                },
                "Sharpened Accuracy": {
                    "name": "Sharpened Accuracy",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When using her surprise accuracy rage power, the barbarian ignores the miss chance for concealment and treats total concealment as concealment. She also ignores cover penalties except those from total cover. A barbarian must have the surprise accuracy rage power and be at least 8th level before selecting this rage power.</p>"
                },
                "Spell Sunder": {
                    "name": "Spell Sunder",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>Once per rage, the barbarian can attempt to sunder an ongoing spell effect by succeeding at a combat maneuver check. For any effect other than one on a creature, the barbarian must make her combat maneuver check against a CMD of 15 plus the effect's caster level. To sunder an effect on a creature, the barbarian must succeed at a normal sunder combat maneuver against the creature's CMD + 5, ignoring any miss chance caused by a spell or spell-like ability. If successful, the barbarian suppresses the effect for 1 round, or 2 rounds if she exceeded the CMD by 5 to 9. If she exceeds the CMD by 10 or more, the effect is dispelled. A barbarian must have the witch hunter rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "Sprint": {
                    "name": "Sprint",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per rage, the barbarian can use a single full-round run action to move up to 6 times her speed or a single full-round charge action to move up to 3 times her speed. A barbarian must have the swift foot rage power and be at least 4th level before selecting this rage power.</p>"
                },
                "Sunder Enchantment": {
                    "name": "Sunder Enchantment",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, whenever the barbarian succeeds at a sunder combat maneuver on a magical item, that item's magical abilities are suppressed for 1 round, plus 1 round for every 5 points by which her combat maneuver check exceeded the target's CMD. A barbarian must have the spell sunder rage power and be at least 8th level before selecting this rage power.</p>"
                },
                "World Serpent Totem": {
                    "name": "World Serpent Totem",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian gains a +1 insight bonus to AC against outsiders and aberrations. This bonus increases by +1 for each world serpent rage power the barbarian possesses, excluding this one.</p>"
                },
                "World Serpent Spirit": {
                    "name": "World Serpent Spirit",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian considers her weapons to be chaotic-, evil-, good-, and lawful-aligned for the purposes of overcoming damage reduction. She also gains a +1 resistance bonus on saving throws against spells and effects that have an alignment descriptor or come from an outsider or aberration. This bonus increases by +1 for each world serpent rage power the barbarian possesses, excluding this one. A barbarian must have the world serpent totem rage power and be at least 6th level before selecting this rage power.</p>"
                },
                "World Serpent Totem Unity": {
                    "name": "World Serpent Totem Unity",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>While raging, the barbarian doubles her fast movement bonus to land speed and cannot be knocked prone. She also doubles her world serpent totem insight bonus to AC against attack rolls made by an outsider or aberration to confirm a critical hit against her. A barbarian must have the world serpent totem and world serpent totem spirit rage powers and be at least 10th level before selecting this rage power.</p>"
                }
            },
            "Uncanny Dodge": {
                "name": "Uncanny Dodge",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 2nd level, a barbarian gains the ability to react to danger before her senses would normally allow her to do so. She cannot be caught flat-footed, even if the attacker is invisible. She still loses her Dexterity bonus to AC if immobilized. A barbarian with this ability can still lose her Dexterity bonus to AC if an opponent successfully uses the feint action against her.</p><p>If a barbarian already has uncanny dodge from a different class, she automatically gains improved uncanny dodge (see below) instead.</p>"
            },
            "Trap Sense": {
                "name": "Trap Sense",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 3rd level, a barbarian gains a +1 bonus on Reflex saves made to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses increase by +1 every three barbarian levels thereafter (6th, 9th, 12th, 15th, and 18th level). Trap sense bonuses gained from multiple classes stack.</p>"
            },
            "Improved Uncanny Dodge": {
                "name": "Improved Uncanny Dodge",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 5th level and higher, a barbarian can no longer be flanked. This defense denies a rogue the ability to sneak attack the barbarian by flanking her, unless the attacker has at least four more rogue levels than the target has barbarian levels.</p><p>If a character already has uncanny dodge (see above) from another class, the levels from the classes that grant uncanny dodge stack to determine the minimum rogue level required to flank the character.</p>"
            },
            "Damage Reduction": {
                "name": "Damage Reduction",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 7th level, a barbarian gains damage reduction. Subtract 1 from the damage the barbarian takes each time she is dealt damage from a weapon or a natural attack. At 10th level, and every three barbarian levels thereafter (13th, 16th, and 19th level), this damage reduction rises by 1 point. Damage reduction can reduce damage to 0 but not below 0.</p>"
            },
            "Greater Rage": {
                "name": "Greater Rage",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 11th level, when a barbarian enters rage, the morale bonus to her Strength and Constitution increases to +6 and the morale bonus on her Will saves increases to +3.</p>"
            },
            "Indomitable Will": {
                "name": "Indomitable Will",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>While in rage, a barbarian of 14th level or higher gains a +4 bonus on Will saves to resist enchantment spells. This bonus stacks with all other modifiers, including the morale bonus on Will saves she also receives during her rage.</p>"
            },
            "Tireless Rage": {
                "name": "Tireless Rage",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>Starting at 17th level, a barbarian no longer becomes fatigued at the end of her rage.</p>"
            },
            "Mighty Rage": {
                "name": "Mighty Rage",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 20th level, when a barbarian enters rage, the morale bonus to her Strength and Constitution increases to +8 and the morale bonus on her Will saves increases to +4.</p>"
            }
        },
        "Archetypes": {
            "Breaker": {
                "name": "Breaker",
                "type": "Archetype",
                "description": "<p>While most barbarians are skilled at breaking things, some find the need to destroy their surroundings an almost uncontrollable urge when in the middle of a rage. These barbarians are a danger not only to their foes, but also to the very environment around them. A breaker barbarian has the following class features.</p>",
                "Destructive": {
                    "name": "Destructive",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Whenever the breaker barbarian makes a melee attack that targets an unattended object or makes a sunder combat maneuver, she adds half her barbarian level (minimum +1) on the damage roll.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Battle Scavenger": {
                    "name": "Battle Scavenger",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, the breaker barbarian suffers no penalty on attack rolls when using an improvised weapon or a weapon with the broken condition. In addition, she gains a +1 bonus on damage rolls with improvised or broken weapons for every three levels beyond 3rd.</p>",
                    "replaces": ["Trap Sense"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Brutal Pugilist": {
                "name": "Brutal Pugilist",
                "type": "Archetype",

                "description": "<p>Some barbarians focus on using their bare hands to tear their opponents limb from limb. These brutal pugilists also learn a great deal about various combat maneuvers, using them to cripple or crush their foes.</p>",
                "Savage Grapple": {
                    "name": "Savage Grapple",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, the brutal pugilist takes only half the normal penalties to Dexterity, attack rolls, and combat maneuver checks when she has the grappled condition. She can make an attack of opportunity against creatures trying to grapple her even if they possess the Improved Grapple feat or the grab special attack. If she hits with this attack of opportunity, she gains a +2 circumstance bonus to her CMD against the grapple attempt. She cannot make these attacks of opportunity once a grapple has succeeded.</p>",
                    "replaces": ["Uncanny Dodge"]
                },
                "Pit Fighter": {
                    "name": "Pit Fighter",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, the brutal pugilist has learned combat tricks from fighting in pit brawls and gladiatorial arenas. She selects one combat maneuver and gains a +1 insight bonus on her CMB or to her CMD in that maneuver. This bonus increases to +2 if the barbarian is wearing no armor (shields are allowed). At every three levels after 3rd, the barbarian may select another combat maneuver and add this bonus on her CMB or to her CMD. This bonus can be applied to each maneuver no more than twice, once on CMB and once to CMD.</p>",
                    "replaces": ["Trap Sense"]
                },
                "Improved Savage Grapple": {
                    "name": "Improved Savage Grapple",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, the brutal pugilist takes no penalties to Dexterity, attack rolls, and combat maneuver checks when she has the grappled condition. She also is treated as one size larger than her actual size when determining whether she can be grappled using the grab ability or swallowed by another creature.</p>",
                    "replaces": ["Improved Uncanny Dodge"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Drunken Brute": {
                "name": "Drunken Brute",
                "type": "Archetype",
                "description": "<p>Barbarians are known for their ability to consume potent drink, but drunken brutes turn drinking into a combat tactic, using the potent liquor to fuel their rage and grant them additional powers. A drunken brute has the following class feature.</p>",
                "Raging Drunk": {
                    "name": "Raging Drunk",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While raging, the drunken brute can drink a potion, or a tankard of ale or similar quantity of alcohol, as a move action that does not provoke attacks of opportunity. A potion has its normal effect, while an alcoholic drink allows the barbarian to maintain her rage that round without expending a round of rage for the day (instead of the alcohol's normal effects). For each alcoholic drink consumed while raging, the barbarian is nauseated for 1 round when her rage expires, in addition to the normal fatigue that follows a rage. Tireless rage does not negate this nauseated condition but the internal fortitude rage power does.</p>",
                    "replaces": ["Fast Movement"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Elemental Kin": {
                "name": "Elemental Kin",
                "type": "Archetype",
                "description": "<p>Some barbarian tribes have strong ties to the elemental forces of nature. Their shamans anoint the warriors at birth, tying them to the patron element of the tribe and granting them lasting boons against such forces. </p>",
                "Elemental Fury": {
                    "name": "Elemental Fury",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, whenever the elemental kin takes an amount of energy damage equal to or greater than her barbarian level while raging, she adds 1 to the total number of rounds that she can rage that day. At 6th level, and every three levels thereafter, the number of extra rounds per energy attack increases by +1, to a maximum of +6 rounds per energy attack at at 18th level.</p>",
                    "replaces": ["Trap Sense"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Hurler": {
                "name": "Hurler",
                "type": "Archetype",
                "description": "<p>A raging barbarian is frightening enough in melee, but some become skilled at throwing objects at their foes before closing in for the kill.</p>",
                "Skilled Thrower": {
                    "name": "Skilled Thrower",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The hurler is skilled at throwing objects in combat. Increase the range increment of any thrown weapon or object by 10 feet.</p>",
                    "replaces": ["Fast Movement"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Invulnerable Rager": {
                "name": "Invulnerable Rager",
                "type": "Archetype",
                "description": "<p>Some barbarians learn to take whatever comes their way, shrugging off mortal wounds with ease. These barbarians invite their enemies to attack them, and use pain to fuel their rage.</p>",
                "Invulnerability": {
                    "name": "Invulnerability",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, the invulnerable rager gains DR/— equal to half her barbarian level. This damage reduction is doubled against nonlethal damage.</p>",
                    "replaces": ["uncanny dodge, improved uncanny dodge, and damage reduction"]
                },
                "Extreme Endurance": {
                    "name": "Extreme Endurance",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, the invulnerable rager is inured to either hot or cold climate effects (choose one) as if using endure elements. In addition, the barbarian gains 1 point of fire or cold resistance for every three levels beyond 3rd.</p>",
                    "replaces": ["Trap Sense"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Mounted Fury": {
                "name": "Mounted Fury",
                "type": "Archetype",
                "description": "<p>Many barbarian tribes are masters of the horse, teaching their members how to ride from a young age. As a result, barbarians from such tribes are even more terrifying when mounted, using their steeds' speed and strength to great advantage.</p>",
                "Fast Rider": {
                    "name": "Fast Rider",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>The speed of any mount the barbarian rides is increased by 10 feet.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Bestial Mount": {
                    "name": "Bestial Mount",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, the mounted fury gains the service of a feral mount. This ability functions as a druid's animal companion, using the barbarian's level –4 as her effective druid level. This companion must be one that she is capable of riding and is suitable as a mount. A Medium barbarian can select a camel or a horse. A Small barbarian can select a pony or a wolf, but can also select a boar or a dog if she is at least 8th level. Whenever a barbarian is raging while mounted on her bestial mount, the mount gains a +2 morale bonus to its Strength.</p>",
                    "replaces": ["uncanny dodge and improved uncanny dodge"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Savage Barbarian": {
                "name": "Savage Barbarian",
                "type": "Archetype",
                "description": "<p>Some barbarians are truly savage, having little training in modern arms. These savage barbarians learn to avoid blows and toughen up their skin.</p>",
                "Naked Courage": {
                    "name": "Naked Courage",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, the savage barbarian gains a +1 dodge bonus to AC and a +1 morale bonus on saving throws against fear when wearing no armor (shields are allowed). This bonus increases by +1 for every six levels after 3rd.</p>",
                    "replaces": ["Trap Sense"]
                },
                "Natural Toughness": {
                    "name": "Natural Toughness",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 7th level, the savage barbarian gains a +1 natural armor bonus to AC when wearing no armor (shields are allowed). This bonus increases by +1 for every three levels beyond 7th.</p>",
                    "replaces": ["Damage Reduction"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Superstitious": {
                "name": "Superstitious",
                "type": "Archetype",
                "description": "<p>Many barbarians distrust magic. While most just shy away from magic, others focus their rage on users of such foul arts. These barbarians are naturally distrusting, and develop keen senses to protect them from harm.</p>",
                "Sixth Sense": {
                    "name": "Sixth Sense",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, the superstitious barbarian gains a +1 bonus on initiative and a +1 insight bonus to AC during surprise rounds. This bonus increases by +1 for every three levels after 3rd.</p>",
                    "replaces": ["Trap Sense"]
                },
                "Keen Senses": {
                    "name": "Keen Senses",
                    "type": "Class Feature",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 7th level, the superstitious barbarian gains low-light vision (triple normal vision range in dim light if she already has low-light vision). At 10th level, she gains darkvision 60 feet (or adds 60 feet to the range of any darkvision already possessed). At 13th level, she gains scent. At 16th level, she gains blindsense 30 feet. At 19th level, she gains blindsight 30 feet.</p>",
                    "replaces": ["Damage Reduction"]
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Totem Warrior": {
                "name": "Totem Warrior",
                "type": "Archetype",
                "description": "<p>A barbarian often has a special totem that is the patron of her tribe. While individual totems vary, those in the tribe that call upon a totem receive similar abilities.</p>",
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Armored Hulk": {
                "name": "Armored Hulk",
                "type": "Archetype",
                "description": "<p>Some barbarians disdain the hides and leather used as armor by most of their kin. Instead they master the heaviest of armors, even those created by more civilized people, to gain greater protection and stability in battle.</p>",
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Rage Power",
                    "specialAbilityType": "",
                    "description": "<p>An armored hulk gains proficiency in heavy armor.</p>"
                },
                "Indomitable Stance": {
                    "name": "Indomitable Stance",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>An armored hulk gains a +1 bonus on combat maneuver checks and to CMD for overrun combat maneuvers, and on Reflex saves against trample attacks. She also gains a +1 bonus to her AC against charge attacks and on attack and damage rolls against charging creatures.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Armored Swiftness": {
                    "name": "Armored Swiftness",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, an armored hulk moves faster in medium and heavy armor. When wearing medium or heavy armor, an armored hulk can move 5 feet faster than normal, to a maximum of her speed.</p>",
                    "replaces": ["Uncanny Dodge"]
                },
                "Resilience of Steel": {
                    "name": "Resilience of Steel",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, an armored hulk is able to use her armor to help avoid deadly hits. While wearing heavy armor, she gains a +1 bonus to AC that applies only on critical hit confirmation rolls. This bonus increases by +1 every 3 levels beyond 3rd (maximum +6 at 18th level).</p>",
                    "replaces": ["Trap Sense"]
                },
                "Improved Armored Swiftness": {
                    "name": "Improved Armored Swiftness",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, an armored hulk's land speed is faster than the norm for her race by +10 feet. This benefit applies when she is wearing any armor, including heavy armor, but not while carrying a heavy load. Apply this bonus before modifying the armored hulk's speed because of any load carried or armor worn. This bonus stacks with any other bonuses to the barbarian's land speed.</p>",
                    "replaces": ["Improved Uncanny Dodge"]
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Scarred Rager": {
                "name": "Scarred Rager",
                "type": "Archetype",
                "description": "<p>Some barbarians wear marks of prowess and savagery upon their bodies. The scarred rager believes each wound tells the tales of her prowess and bravery. She augments these ragged trophies with brands and tattoos in order to win the notice and favor of her gods, ancestors, or totem spirits. The scarred rager's gnarled and exotic appearance terrifies civilized onlookers, but is awe-inspiring to her savage kin.</p>",
                "Terrifying Visage": {
                    "name": "Terrifying Visage",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A scarred rager adds 1/2 her barbarian level on Intimidate checks against humanoids who are not members of barbarian tribes. When dealing with barbarians, the scarred rager may choose to add this bonus on Diplomacy checks instead. The DC of any fear effect created by the scarred rager also increases by 1.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Tolerance": {
                    "name": "Tolerance",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, a scarred rager who fails a save against an effect that causes her to become nauseated, sickened, fatigued, or exhausted can make a second save to negate the effect on the start of her next turn. Only one additional save is allowed. If the effect does not allow a saving throw, its duration is halved instead (minimum of 1 round).</p>",
                    "replaces": ["Uncanny Dodge"]
                },
                "Scarification": {
                    "name": "Scarification",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, a scarred rager can ignore 1 point of bleed damage per round. This amount increases by 1 every three levels beyond 3rd. At 15th level, a scarred rager can ignore 1 bleed effect each round.</p>",
                    "replaces": ["Trap Sense"]
                },
                "Improved Tolerance": {
                    "name": "Improved Tolerance",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, a scarred rager's tolerance ability also applies to effects that would cause her to become dazed, frightened, shaken, or stunned. This replaces improved uncanny dodge.</p>"
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Sea Reaver": {
                "name": "Sea Reaver",
                "type": "Archetype",
                "description": "<p>Not all barbarians hunt forests, plains, and mountains. Some are raiding terrors on the sea and coasts, pillaging those who hoard treasure and pursuing monsters of the deep. Some sea reavers are no more than hunters of the open sea, while others are raiders striking fear into coastal settlements within reach of the sea reavers' longships.</p>",
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Rage Power",
                    "specialAbilityType": "",
                    "description": "<p>A sea reaver is not proficient with medium armor.</p>"
                },
                "Marine Terror": {
                    "name": "Marine Terror",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A sea reaver can hold her breath for a number of rounds equal to four times her Constitution score. In addition, a sea reaver can move normally though squares of standing water or bog that is 1 foot deep. It does not cost her extra movement to traverse these terrains. Lastly, a sea reaver ignores the normal cover bonus to AC when attacking creatures that are partially immersed in water.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Eyes of the Storm": {
                    "name": "Eyes of the Storm",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, a sea reaver ignores any concealment provided by fog, rain, sleet, mist, wind, or other weather effects that is less than total concealment, and any penalties weather applies on Perception checks are halved.</p>",
                    "replaces": ["Uncanny Dodge"]
                },
                "Savage Sailor": {
                    "name": "Savage Sailor",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, a sea reaver gains a +1 bonus on Acrobatics, Climb, Profession (sailor), Survival, and Swim checks made in aquatic terrain, including aboard a ship or along shorelines. These bonuses improve by +1 every three levels after 3rd.</p>",
                    "replaces": ["Trap Sense"]
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Titan Mauler": {
                "name": "Titan Mauler",
                "type": "Archetype",
                "description": "<p>In lands overrun by giants, dragons, and other hulking beasts, entire fellowships of barbarians hone tactics and traditions with one purpose—to bring low these massive foes. While her enemies' size makes the creatures strong, the titan mauler is even stronger, taking up weapons from her fallen foes that no lesser warrior can lift, and using them when she beseeches the spirits to grant her increased size and greater ferocity against her titanic foes.</p>",
                "Big Game Hunter": {
                    "name": "Big Game Hunter",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A titan mauler gains a +1 bonus on attack rolls and a +1 dodge bonus to AC in melee with creatures larger than themselves.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Jotungrip": {
                    "name": "Jotungrip",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, a titan mauler may choose to wield a two-handed weapon in one hand with a –2 penalty on attack rolls while doing so. The weapon must be appropriately sized for her, and it is treated as one-handed when determining the effect of Power Attack, Strength bonus to damage, and the like.</p>",
                    "replaces": ["Uncanny Dodge"]
                },
                "Massive Weapons": {
                    "name": "Massive Weapons",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, a titan mauler becomes skilled in the use of massive weapons looted from her titanic foes. The attack roll penalty for using weapons too large for her size is reduced by 1, and this reduction increases by 1 for every three levels beyond 3rd (to a minimum of 0).</p>",
                    "replaces": ["Trap Sense"]
                },
                "Evade Reach": {
                    "name": "Evade Reach",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, as a swift action, a titan mauler may choose one creature within her line of sight. Until the end of her turn, that target's reach is treated as if it were 5 feet shorter with respect to reaching the titan mauler, and this reduction increases by 5 feet for every five levels beyond 5th.</p>",
                    "replaces": ["Improved Uncanny Dodge"]
                },
                "Titanic Rage": {
                    "name": "Titanic Rage",
                    "type": "Rage Power",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>At 14th level, a titan mauler may choose to gain the benefits of enlarge person when she enters a rage. While using titanic rage, she must spend 2 rounds of rage per round, and she becomes exhausted rather than fatigued when the rage ends.</p>",
                    "replaces": ["Indomitable Will"]
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "True Primitive": {
                "name": "True Primitive",
                "type": "Archetype",
                "description": "<p>Isolated and xenophobic tribes that dwell in areas untouched by civilization often see anything from cities and organized settlements as strange, dangerous, and decadent. They gain power from their truly primitive nature; their bodies and spirits are hardened by the wild and untainted existence far from the pathetic softness of so-called civilization. Even when forced to mingle with civilization, the true primitive stays apart in both traditions and trappings.</p>",
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Rage Power",
                    "specialAbilityType": "",
                    "description": "<p>A true primitive is proficient with hide armor and armors made from bone. A true primitive is also proficient with bone shields and the following weapons: battleaxe, blowgun, club, greatclub, handaxe, longspear, shortspear, sling, and spear.</p>"
                },
                "Illiteracy": {
                    "name": "Illiteracy",
                    "type": "Rage Power",
                    "specialAbilityType": "",
                    "description": "<p>A true primitive cannot read or write, and her superstition about such things leads her to refuse to ever learn to read or write, even if she multiclasses into other classes.</p>"
                },
                "Favored Terrain": {
                    "name": "Favored Terrain",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A true primitive has a favored terrain representing her native homeland. This ability functions as the ranger class feature, and the true primitive's bonuses in that terrain improve by +2 at 5th level and every five levels thereafter. However, she does not gain any additional favored terrains.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Trophy Fetish": {
                    "name": "Trophy Fetish",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A true primitive collects teeth, bones, hair, and other trophies from vanquished enemies, representing their power and strength. At 3rd level, a true primitive can attach a trophy fetish to one of the traditional true primitive weapons listed above. When wielding that weapon, the true primitive gains a +1 morale bonus on damage rolls. Furthermore, if that weapon has the fragile property, once per day, the true primitive can ignore the effects of a single natural 1 roll. A trophy fetish can also be attached to a suit of hide armor, granting the true primitive a +1 morale bonus on saving throws. Furthermore, if that armor has the fragile property, once per day, the true primitive can chose not to have the armor break on the confirmation of a critical hit made against her. Every five levels beyond 3rd, a true primitive can use an additional trophy fetish. Multiple trophy fetishes can be attached to the same armor or weapon; their effects stack. A trophy fetish can be sundered (hardness 5, 1 hit point) but is not damaged by area attacks or attacks that do not specifically target it. It has no effect if attached to other types of weapons or armor.</p>",
                    "replaces": ["Trap Sense"]
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Urban Barbarian": {
                "name": "Urban Barbarian",
                "type": "Archetype",
                "description": "<p>Every barbarian knows that city life can soften the spirit and the body, but some barbarians take on the trappings and ways of their adoptive homes and bend their savage powers to its challenges. While these urban barbarians' rough edges are smoothed into civility, they can use their primal nature and upbringing to move with the ebb and flow of civilization's natural rhythms.</p>",
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Rage Power",
                    "specialAbilityType": "",
                    "description": "<p>An urban barbarian is not proficient with medium armor.</p>"
                },
                "Skills": {
                    "name": "Skills",
                    "type": "Rage Power",
                    "specialAbilityType": "",
                    "description": "<p>An urban barbarian does not gain Handle Animal (Cha), Knowledge (nature) (Int), or Survival (Wis) as class skills; instead, she gains Diplomacy (Cha), Knowledge (local) (Int), Knowledge (nobility) (Int), Linguistics (Int), and Profession (Wis) as class skills.</p>"
                },
                "Crowd Control": {
                    "name": "Crowd Control",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 1st level, an urban barbarian gains a +1 bonus on attack rolls and a +1 dodge bonus to AC when adjacent to two or more enemies. In addition, her movement is not impeded by crowds, and she gains a bonus equal to 1/2 her barbarian level on Intimidate checks to influence crowds.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Controlled Rage": {
                    "name": "Controlled Rage",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>When an urban barbarian rages, instead of making a normal rage she may apply a +4 morale bonus to her Strength, Dexterity, or Constitution. This bonus increases to +6 when she gains greater rage and +8 when she gains mighty rage. She may apply the full bonus to one ability score or may split the bonus between several scores in increments of +2. When using a controlled rage, an urban barbarian gains no bonus on Will saves, takes no penalties to AC, and can still use Intelligence-, Dexterity-, and Charisma-based skills. This ability otherwise follows the normal rules for rage.</p>"
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Wild Rager": {
                "name": "Wild Rager",
                "type": "Archetype",
                "description": "<p>Rages are barely controlled, but there are those who wholly give in to their more savage side, letting their rages take them to a confusing and uncontrolled place of terrible savagery. These barbarians become beasts, consumed with absolute bloodlust to the point where they cannot tell friend from foe.</p>",
                "Uncontrolled Rage": {
                    "name": "Uncontrolled Rage",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A wild rager's rage functions as normal, except that when she reduces a creature to 0 or fewer hit points, she must attempt a Will save (DC 10 + 1/2 the barbarian's level + the barbarian's Constitution modifier) or become confused. For the remainder of her current turn, she attacks the nearest creature other than herself. On the following round, refer to the confusion spell to determine her actions. At the end of this round, and each round thereafter, she can attempt a new saving throw to end the confusion effect. The rounds during which she is confused do not count against the rounds she has spent raging that day, but she cannot end her rage voluntarily, nor can she use rage powers while confused.</p>"
                },
                "Wild Fighting": {
                    "name": "Wild Fighting",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, even when not raging, wild ragers often fight with reckless, savage abandon. A wild rager using the full-attack action can make one extra attack per round at her highest base attack bonus. Until the beginning of her next turn, however, she takes a –2 penalty on attack rolls and –4 penalty to AC.</p>",
                    "replaces": ["Uncanny Dodge"]
                },
                "Rage Conversion": {
                    "name": "Rage Conversion",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, a wild rager who fails a saving throw against any mind-affecting effect can attempt a new saving throw at the beginning of her next turn. If the save succeeds, that effect ends and she instead rages and becomes confused as noted above.</p>",
                    "replaces": ["Improved Uncanny Dodge"]
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Feral Gnasher": {
                "name": "Feral Gnasher",
                "type": "Archetype",
                "description": "<p>Feral gnashers grow up in the wild, either raised by animals or scraping by on their own, and soon learn to fend for themselves. These barbarians often utilize pieced-together armor and fight with their sharp teeth and whatever improvised weapons are within reach.</p>",
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Rage Power",
                    "specialAbilityType": "",
                    "description": "<p>A feral gnasher loses all martial weapon proficiencies except for greatclub and loses proficiency with medium armor.</p>"
                },
                "Savage Bite": {
                    "name": "Savage Bite",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 1st level, a feral gnasher gains a savage bite attack. This is a primary natural attack that deals 1d4 points of damage. If the goblin already has the hard head, big teeth racial trait, the damage increases to 1d6. At 10th level, the damage from a feral gnasher's bite increases to 1d6 (or 1d8 if the goblin has the hard head, big teeth racial trait) and deals ×3 damage on a critical hit.</p>",
                    "replaces": ["Fast Movement"]
                },
                "Impromptu Armament": {
                    "name": "Impromptu Armament",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, a feral gnasher gains Throw Anything as a bonus feat and can pick up an unattended object that can be wielded in one hand as a free action. Additionally, the feral gnasher can take Catch Off-Guard in place of a rage power. This replaces the rage power gained at second level.</p>"
                },
                "Lockjaw": {
                    "name": "Lockjaw",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 3rd level, a feral gnasher gains the grab ability with her bite attack. A feral gnasher can use this ability on a creature up to one size category larger than she is. This replaces trap sense +1.</p>"
                },
                "Improvised Weapon Mastery": {
                    "name": "Improvised Weapon Mastery",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, a feral gnasher gains Improvised Weapon Mastery as a bonus feat. This replaces improved uncanny dodge.</p>"
                },
                "Improved Lockjaw": {
                    "name": "Improved Lockjaw",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 6th level, as long as a feral gnasher is controlling the grapple with her lockjaw attack, she does not gain the grappled condition, but is unable to move or use her mouth for anything other than grappling.</p>",
                    "replaces": ["trap sense +2"]
                },
                "Greater Lockjaw": {
                    "name": "Greater Lockjaw",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 9th level and again at 15th level, the size of a creature a feral gnasher is able to use her lockjaw's grab ability on increases by one size increment.</p>",
                    "replaces": ["trap sense +3 and trap sense +5"]
                },
                "Wicked Improvisation": {
                    "name": "Wicked Improvisation",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 12th level, a feral gnasher becomes more capable with improvised weapons and natural attacks. The feral gnasher gains a +1 competence bonus on damage rolls when using natural attacks or improvised weapons while raging. At 14th level and every two levels thereafter, the damage bonus increases by +1. This increase is not precision damage and is thus multiplied on a critical hit.</p>",
                    "replaces": ["trap sense +4"]
                },
                "requirements": [
                    {
                        "race": "Goblin"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            },
            "Hateful Rager": {
                "name": "Hateful Rager",
                "type": "Archetype",
                "description": "<p>From a young age, many half-orcs are treated cruelly, bullied, ridiculed, and made outcasts. While some hide their shame, others foster a deep, burning hatred that they channel into a raw fury and unleash against their enemies. These half-orcs are called hateful ragers.</p>",
                "Reduced Rage": {
                    "name": "Reduced Rage",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level and every level thereafter, a hateful rager only gains 1 additional round of rage per day instead of the normal 2 additional rounds of rage per day.</p>"
                },
                "Favored Enemy": {
                    "name": "Favored Enemy",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 2nd level, a hateful rager selects a favored enemy. This ability works identically to the ranger ability of the same name. At 8th, 14th, and 20th level, the hateful rager selects another favored enemy and increases her bonus against one favored enemy type, as described in the ranger class.</p><p>While raging, the hateful rager makes every effort to fight a favored enemy rather than other opponents. If aware of the presence of a favored enemy, the hateful rager must make a DC 20 Will save each round to attack another creature; failure means the barbarian must attack the favored enemy or move closer to that enemy. She may freely attack creatures preventing her from reaching that favored enemy (regardless of whether they are actively trying to prevent her attacks or merely in the way). She can avoid harmful obstacles normally in her attempts to reach the target and is not forced to take the shortest route.</p><p>This ability replaces the barbarian's rage power gained at 2nd level. At 8th, 14th, and 20th levels, in place of a rage power she gains another favored enemy and increases her bonus against one favored enemy type.</p>"
                },
                "Feed the Rage": {
                    "name": "Feed the Rage",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 5th level, a hateful rager gains 1 additional round of rage for each favored enemy she knocks unconscious or kills in combat. These current rounds of rage can only be used to add to the duration of her rage, and disappear when the rage ends.</p>",
                    "replaces": ["Improved Uncanny Dodge"]
                },
                "Amplified by Hate": {
                    "name": "Amplified by Hate",
                    "type": "Rage Power",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>At 9th level, a hateful rager adds half her favored enemy bonus to the DC of any rage power she uses against a favored enemy.</p>",
                    "replaces": ["trap sense +3"]
                },
                "requirements": [
                    {
                        "race": "Half-orc"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            }
        }
    }
}
