{
    "Paladin": {
        "name": "Paladin",
        "type": "Class",
        "summary": "<p>The paladin is the knight in shining armor, a devoted follower of law and good.</p>",
        "description": "<p>Through a select, worthy few shines the power of the divine. Called paladins, these noble souls dedicate their swords and lives to the battle against evil. Knights, crusaders, and law-bringers, paladins seek not just to spread divine justice but to embody the teachings of the virtuous deities they serve. In pursuit of their lofty goals, they adhere to ironclad laws of morality and discipline. As reward for their righteousness, these holy champions are blessed with boons to aid them in their quests: powers to banish evil, heal the innocent, and inspire the faithful. Although their convictions might lead them into conflict with the very souls they would save, paladins weather endless challenges of faith and dark temptations, risking their lives to do right and fighting to bring about a brighter future.</p>",
        "hitDie": "10",
        "classSkills": [
            "Craft", "Diplomacy", "Handle Animal", "Heal", "Knowledge (nobility)", "Knowledge (religion)", "Profession", "Ride", "Sense Motive", "Spellcraft"
        ],
        "skillsPerLevel": "2",
        "alignmentRestrictions": [
            "!Lawful", "!Good"
        ],
        "progression": {
            "BAB": [
                "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"
            ],
            "Fortitude": [
                "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
            ],
            "Reflex": [
                "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
            ],
            "Will": [
                "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
            ],
            "spellsPerDay": [
                [], [], [], ["0"], ["1"], ["1"], [
                    "1", "0"
                ], [
                    "1", "1"
                ], [
                    "2", "1"
                ], [
                    "2", "1", "0"
                ], [
                    "2", "1", "1"
                ], [
                    "2", "2", "1"
                ], [
                    "3", "2", "1", "0"
                ], [
                    "3", "2", "1", "1"
                ], [
                    "3", "2", "2", "1"
                ], [
                    "3", "3", "2", "1"
                ], [
                    "4", "3", "2", "1"
                ], [
                    "4", "3", "2", "2"
                ], [
                    "4", "3", "3", "2"
                ], [
                    "4", "4", "3", "3"
                ]
            ]
        },
        "Class Features": {
            "Weapon and Armor Proficiency": {
                "name": "Weapon and Armor Proficiency",
                "type": "Class Feature",
                "featureType": "",
                "description": "<p>Paladins are proficient with all simple and martial weapons, with all types of armor (heavy, medium, and light), and with shields (except tower shields).</p>"
            },
            "Aura of Good": {
                "name": "Aura of Good",
                "type": "Class Feature",
                "featureType": "Ex",
                "description": "<p>The power of a paladin's aura of good (see the detect good spell) is equal to her paladin level.</p>"
            },
            "Detect Evil": {
                "name": "Detect Evil",
                "type": "Class Feature",
                "featureType": "Sp",
                "description": "<p>At will, a paladin can use detect evil, as the spell. A paladin can, as a move action, concentrate on a single item or individual within 60 feet and determine if it is evil, learning the strength of its aura as if having studied it for 3 rounds. While focusing on one individual or object, the paladin does not detect evil in any other object or individual within range.</p>"
            },
            "Smite Evil": {
                "name": "Smite Evil",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>Once per day, a paladin can call out to the powers of good to aid her in her struggle against evil. As a swift action, the paladin chooses one target within sight to smite. If this target is evil, the paladin adds her Charisma bonus (if any) to her attack rolls and adds her paladin level to all damage rolls made against the target of her smite. If the target of smite evil is an outsider with the evil subtype, an evil-aligned dragon, or an undead creature, the bonus to damage on the first successful attack increases to 2 points of damage per level the paladin possesses. Regardless of the target, smite evil attacks automatically bypass any DR the creature might possess.</p><p>In addition, while smite evil is in effect, the paladin gains a deflection bonus equal to her Charisma modifier (if any) to her AC against attacks made by the target of the smite. If the paladin targets a creature that is not evil, the smite is wasted with no effect.</p>"
            },
            "The smite evil effect remains until the target of the smite is dead or the next " + "time the paladin rests and regains her uses of this ability. At 4th level, and a" + "t every three levels thereafter, the paladin may smite evil one additional time " + "per day, as indicated on Table": {
                "name": "The smite evil effect remains until the target of the smite is dead or the next time the paladin rests and regains her uses of this ability. At 4th level, and at every three levels thereafter, the paladin may smite evil one additional time per day, as indicated on Table",
                "type": "Class Feature",
                "featureType": "",
                "description": "<p>Paladin, to a maximum of seven times per day at 19th level.</p>"
            },
            "Divine Grace": {
                "name": "Divine Grace",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 2nd level, a paladin gains a bonus equal to her Charisma bonus (if any) on all saving throws.</p>"
            },
            "Lay On Hands": {
                "name": "Lay On Hands",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>Beginning at 2nd level, a paladin can heal wounds (her own or those of others) by touch. Each day she can use this ability a number of times equal to 1/2 her paladin level plus her Charisma modifier. With one use of this ability, a paladin can heal 1d6 hit points of damage for every two paladin levels she possesses. Using this ability is a standard action, unless the paladin targets herself, in which case it is a swift action. Despite the name of this ability, a paladin only needs one free hand to use this ability.</p><p>Alternatively, a paladin can use this healing power to deal damage to undead creatures, dealing 1d6 points of damage for every two levels the paladin possesses. Using lay on hands in this way requires a successful melee touch attack and doesn't provoke an attack of opportunity. Undead do not receive a saving throw against this damage.</p>"
            },
            "Aura of Courage": {
                "name": "Aura of Courage",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 3rd level, a paladin is immune to fear (magical or otherwise). Each ally within 10 feet of her gains a +4 morale bonus on saving throws against fear effects. This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
            },
            "Divine Health": {
                "name": "Divine Health",
                "type": "Class Feature",
                "featureType": "Ex",
                "description": "<p>At 3rd level, a paladin is immune to all diseases, including supernatural and magical diseases, including mummy rot.</p>"
            },
            "Mercy": {
                "name": "Mercy",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 3rd level, and every three levels thereafter, a paladin can select one mercy. Each mercy adds an effect to the paladin's lay on hands ability. Whenever the paladin uses lay on hands to heal damage to one target, the target also receives the additional effects from all of the mercies possessed by the paladin. A mercy can remove a condition caused by a curse, disease, or poison without curing the affliction. Such conditions return after 1 hour unless the mercy actually removes the affliction that causes the condition.<p>At 3rd level, the paladin can select from the following initial mercies.</p><li>Fatigued: The target is no longer fatigued.</li><li>Shaken: The target is no longer shaken.</li><li>Sickened: The target is no longer sickened.</li><p>At 6th level, a paladin adds the following mercies to the list of those that can be selected.</p><ul><li>Dazed: The target is no longer dazed.</li><li>Diseased: The paladin's lay on hands ability also acts as remove disease, using the paladin's level as the caster level.</li><li>Staggered: The target is no longer staggered, unless the target is at exactly 0 hit points.</li></ul><p>At 9th level, a paladin adds the following mercies to the list of those that can be selected.</p><ul><li>Cursed: The paladin's lay on hands ability also acts as remove curse, using the paladin's level as the caster level.</li><li>Exhausted: The target is no longer exhausted. The paladin must have the fatigue mercy before selecting this mercy.</li><li>Frightened: The target is no longer frightened. The paladin must have the shaken mercy before selecting this mercy.</li><li>Nauseated: The target is no longer nauseated. The paladin must have the sickened mercy before selecting this mercy.</li><li>Poisoned: The paladin's lay on hands ability also acts as neutralize poison, using the paladin's level as the caster level.</li></ul><p>At 12th level, a paladin adds the following mercies to the list of those that can be selected.</p><ul><li>Blinded: The target is no longer blinded.</li><li>Deafened: The target is no longer deafened.</li><li>Paralyzed: The target is no longer paralyzed.</li><li>Stunned: The target is no longer stunned.</li></ul><p>These abilities are cumulative. For example, a 12th-level paladin's lay on hands ability heals 6d6 points of damage and might also cure fatigued and exhausted conditions as well as removing diseases and neutralizing poisons. Once a condition or spell effect is chosen, it can't be changed.</p></p>"
            },
            "Channel Positive Energy": {
                "name": "Channel Positive Energy",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>When a paladin reaches 4th level, she gains the supernatural ability to channel positive energy like a cleric. Using this ability consumes two uses of her lay on hands ability. A paladin uses her level as her effective cleric level when channeling positive energy. This is a Charisma-based ability.</p>"
            },
            "Spells": {
                "name": "Spells",
                "type": "Class Feature",
                "featureType": "",
                "description": "<p>Beginning at 4th level, a paladin gains the ability to cast a small number of divine spells which are drawn from the paladin spell list presented in Spell Lists. A paladin must choose and prepare her spells in advance.</p><p>To prepare or cast a spell, a paladin must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a paladin's spell is 10 + the spell level + the paladin's Charisma modifier.</p>"
            },
            "Like other spellcasters, a paladin can cast only a certain number of spells of e" + "ach spell level per day. Her base daily spell allotment is given on Table": {
                "name": "Like other spellcasters, a paladin can cast only a certain number of spells of each spell level per day. Her base daily spell allotment is given on Table",
                "type": "Class Feature",
                "featureType": "",
                "description": "<p>Paladin. In addition, she receives bonus spells per day if she has a high Charisma score (see Table: Ability Modifiers and Bonus Spells). When Table: Paladin indicates that the paladin gets 0 spells per day of a given spell level, she gains only the bonus spells she would be entitled to based on her Charisma score for that spell level.</p><p>A paladin must spend 1 hour each day in quiet prayer and meditation to regain her daily allotment of spells. A paladin may prepare and cast any spell on the paladin spell list, provided that she can cast spells of that level, but she must choose which spells to prepare during her daily meditation.</p><p>Through 3rd level, a paladin has no caster level. At 4th level and higher, her caster level is equal to her paladin level – 3.</p>"
            },
            "Divine Bond": {
                "name": "Divine Bond",
                "type": "Class Feature",
                "featureType": "Sp",
                "description": "<p>Upon reaching 5th level, a paladin forms a divine bond with her god. This bond can take one of two forms. Once the form is chosen, it cannot be changed.</p>"
            },
            "The first type of bond allows the paladin to enhance her weapon as a standard ac" + "tion by calling upon the aid of a celestial spirit for 1 minute per paladin leve" + "l. When called, the spirit causes the weapon to shed light as a torch. At 5th le" + "vel, this spirit grants the weapon a +1 enhancement bonus. For every three level" + "s beyond 5th, the weapon gains another +1 enhancement bonus, to a maximum of +6 " + "at 20th level. These bonuses can be added to the weapon, stacking with existing " + "weapon bonuses to a maximum of +5, or they can be used to add any of the followi" + "ng weapon properties": {
                "name": "The first type of bond allows the paladin to enhance her weapon as a standard action by calling upon the aid of a celestial spirit for 1 minute per paladin level. When called, the spirit causes the weapon to shed light as a torch. At 5th level, this spirit grants the weapon a +1 enhancement bonus. For every three levels beyond 5th, the weapon gains another +1 enhancement bonus, to a maximum of +6 at 20th level. These bonuses can be added to the weapon, stacking with existing weapon bonuses to a maximum of +5, or they can be used to add any of the following weapon properties",
                "type": "Class Feature",
                "featureType": "",
                "description": "<p>axiomatic, brilliant energy, defending, disruption, flaming, flaming burst, holy, keen, merciful, and speed. Adding these properties consumes an amount of bonus equal to the property's cost (see Table: Melee Weapon Special Abilities). These bonuses are added to any properties the weapon already has, but duplicate abilities do not stack. If the weapon is not magical, at least a +1 enhancement bonus must be added before any other properties can be added. The bonus and properties granted by the spirit are determined when the spirit is called and cannot be changed until the spirit is called again. The celestial spirit imparts no bonuses if the weapon is held by anyone other than the paladin but resumes giving bonuses if returned to the paladin. These bonuses apply to only one end of a double weapon. A paladin can use this ability once per day at 5th level, and one additional time per day for every four levels beyond 5th, to a total of four times per day at 17th level.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.The second type of bond allows a paladin to gain the service of an unusually intelligent, strong, and loyal steed to serve her in her crusade against evil. This mount is usually a heavy horse (for a Medium paladin) or a pony (for a Small paladin), although more exotic mounts, such as a boar, camel, or dog are also suitable. This mount functions as a druid's animal companion, using the paladin's level as her effective druid level. Bonded mounts have an Intelligence of at least 6.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.Once per day, as a full-round action, a paladin may magically call her mount to her side. This ability is the equivalent of a spell of a level equal to one-third the paladin's level. The mount immediately appears adjacent to the paladin. A paladin can use this ability once per day at 5th level, and one additional time per day for every 4 levels thereafter, for a total of four times per day at 17th level.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.At 11th level, the mount gains the celestial template and becomes a magical beast for the purposes of determining which spells affect it. At 15th level, a paladin's mount gains spell resistance equal to the paladin's level + 11.</p><p>If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.Should the paladin's mount die, the paladin may not summon another mount for 30 days or until she gains a paladin level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.</p>"
            },
            "Aura of Resolve": {
                "name": "Aura of Resolve",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 8th level, a paladin is immune to charm spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against charm effects.</p><p>This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
            },
            "Aura of Justice": {
                "name": "Aura of Justice",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 11th level, a paladin can expend two uses of her smite evil ability to grant the ability to smite evil to all allies within 10 feet, using her bonuses. Allies must use this smite evil ability by the start of the paladin's next turn and the bonuses last for 1 minute. Using this ability is a free action. Evil creatures gain no benefit from this ability.</p>"
            },
            "Aura of Faith": {
                "name": "Aura of Faith",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 14th level, a paladin's weapons are treated as good-aligned for the purposes of overcoming damage reduction. Any attack made against an enemy within 10 feet of her is treated as good-aligned for the purposes of overcoming damage reduction.</p><p>This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
            },
            "Aura of Righteousness": {
                "name": "Aura of Righteousness",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 17th level, a paladin gains DR 5/evil and immunity to compulsion spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against compulsion effects.</p><p>This ability functions only while the paladin is conscious, not if she is unconscious or dead.</p>"
            },
            "Holy Champion": {
                "name": "Holy Champion",
                "type": "Class Feature",
                "featureType": "Su",
                "description": "<p>At 20th level, a paladin becomes a conduit for the power of her god. Her DR increases to 10/evil. Whenever she uses smite evil and successfully strikes an evil outsider, the outsider is also subject to a banishment, using her paladin level as the caster level (her weapon and holy symbol automatically count as objects that the subject hates). After the banishment effect and the damage from the attack is resolved, the smite immediately ends. In addition, whenever she channels positive energy or uses lay on hands to heal a creature, she heals the maximum possible amount.</p>"
            },
            "Code of Conduct": {
                "name": "Code of Conduct",
                "type": "Class Feature",
                "featureType": "",
                "description": "<p>A paladin must be of lawful good alignment and loses all class features except proficiencies if she ever willingly commits an evil act.</p><p>Additionally, a paladin's code requires that she respect legitimate authority, act with honor (not lying, not cheating, not using poison, and so forth), help those in need (provided they do not use the help for evil or chaotic ends), and punish those who harm or threaten innocents</p>"
            },
            "Associates": {
                "name": "Associates",
                "type": "Class Feature",
                "featureType": "",
                "description": "<p>While she may adventure with good or neutral allies, a paladin avoids working with evil characters or with anyone who consistently offends her moral code. Under exceptional circumstances, a paladin can ally with evil associates, but only to defeat what she believes to be a greater evil. A paladin should seek an atonement spell periodically during such an unusual alliance, and should end the alliance immediately should she feel it is doing more harm than good. A paladin may accept only henchmen, followers, or cohorts who are lawful good.</p>"
            }
        },
        "archetype": {
            "Divine Defender": {
                "name": "Divine Defender",
                "type": "Archetype",
                "description": "<p>Some paladins see themselves as the last line of defense between the teeming hordes of evil and the innocent folk trying to make a living in a harsh, unforgiving world. These defenders spend their lives protecting others and taking on foes that the common man should not even know exist. To aid them in their holy mission, they have special powers to protect themselves and those around them. The divine defender has the following class features.</p>",
                "Shared Defense": {
                    "name": "Shared Defense",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 3rd level, a divine defender can spend one use of her lay on hands ability as a standard action to grant all adjacent allies (including paladins) a bonus. At 3rd level, adjacent allies receive a +1 sacred bonus to their AC and CMD and on their saving throws. These bonuses last for a number of rounds equal to the divine defender's Charisma modifier. At 9th level and 15th level, this bonus increases by +1. At 6th level, these bonuses are granted to all allies within 10 feet, and allies that are at fewer than 0 hit points within this area are automatically stabilized. At 12th level, these bonuses are granted to all allies within 15 feet, and allies within this area are immune to bleed damage. At 18th level, these bonuses are granted to all allies within 20 feet, and allies within this area gain a 25% chance to negate any sneak attack or critical hit scored against them. This ability does not stack with the chance provided from the light, medium, or heavy fortification armor special abilities. These bonuses are cumulative with each other. Allies only benefit from these bonuses while in the listed area. This ability replaces mercy.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 5th level, instead of forming a divine bond with her weapon or a mount, a divine defender can form a bond with her armor. As a standard action, a divine defender can enhance her armor by calling upon the aid of a celestial spirit. This bond lasts for 1 minute per paladin level. When called, the spirit causes the armor to shed light like a torch. At 5th level, the spirit grants the armor a +1 enhancement bonus. For every three levels beyond 5th, the armor gains another +1 enhancement bonus, to a maximum of +6 at 20th level. These bonuses can be added to the armor, stacking with existing armor bonuses to a maximum of +3, or they can be used to add any of the following armor properties (asterisks note new armor properties found in Chapter 7): champion*, ghost touch, heavy fortification, invulnerability, light fortification, moderate fortification, spell resistance (13, 15, 17, or 19). Adding these properties consumes an amount of bonus equal to the property's cost (see Table 15–4 of the Core Rulebook). In addition, the bonuses can be consumed at the listed amount to add any of the following armor properties: energy resistance for +3 bonus, improved energy resistance for +5 bonus, or righteous* for +4 bonus. These bonuses are added to any properties the armor already has, but duplicate abilities do not stack. If the armor is not magical, at least a +1 enhancement bonus must be added before any other properties can be added. The bonus and properties granted by the spirit are determined when the spirit is called and cannot be changed until the spirit is called again. The celestial spirit imparts no bonuses if the armor is worn by anyone other than the divine defender, but it resumes giving bonuses if the divine defender dons the armor again. A divine defender can use this ability once per day at 5th level, and one additional time per day for every four levels beyond 5th, to a total of four times per day at 17th level.</p><p>If a suit of armor with a celestial spirit is destroyed, the divine defender loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the divine defender takes a –1 penalty on attack and weapon damage rolls.</p>"
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Hospitaler": {
                "name": "Hospitaler",
                "type": "Archetype",
                "description": "<p>Paladins are known for their charity and for tending to the sick. The hospitaler takes to this calling above all others, spending much of her time healing the poor, and giving aid and succor to those in need. The hospitaler has the following class features.</p>",
                "Smite Evil": {
                    "name": "Smite Evil",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>This functions as the paladin ability, but the hospitaler can smite evil one additional time per day at 7th level, and every six levels thereafter (instead of 4th level and every three levels thereafter).</p>"
                },
                "Channel Positive Energy": {
                    "name": "Channel Positive Energy",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>When a hospitaler reaches 4th level, she gains the ability to channel positive energy as a cleric equal to her paladin level –3. She can use this ability a number of times per day equal to 3 + her Charisma modifier. Using this ability does not expend uses of lay on hands, as it does with other paladins. This replaces the standard paladin's channel positive energy ability.</p>"
                },
                "Aura of Healing": {
                    "name": "Aura of Healing",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, a hospitaler can expend one use of her channel positive energy ability to emit a 30-foot aura of healing for a number of rounds equal to her paladin level. Allies in this aura (including the hospitaler) automatically stabilize if below 0 hit points and are immune to bleed damage. In addition, allies (including the paladin) that spend at least 1 full round inside the aura are healed an amount of damage equal to their total number of Hit Dice and may make a saving throw against any afflictions they are suffering from, such as a curse, disease, or poison. This saving throw only counts toward curing the affliction and does not impose any penalty on a failed save. Allies can only be healed once by a use of this ability and they can only attempt additional saving throws once per day, even if they are exposed to this aura multiple times. This ability replaces aura of justice.</p>"
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Sacred Servant": {
                "name": "Sacred Servant",
                "type": "Archetype",
                "description": "<p>Paladins as a general rule, venerate the gods of good and purity, but some take this a step further, dedicating themselves to a specific deity and furthering the cause of the faith. These sacred servants are rewarded for their devotion with additional spells and powerful allies. A sacred servant must select one deity to worship. This deity's alignment must be lawful good, lawful neutral, or neutral good. A sacred servant has the following class features.</p>",
                "Smite Evil": {
                    "name": "Smite Evil",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>This functions as the paladin ability, but the sacred servant can smite evil one additional time per day at 7th level, and every six levels thereafter (instead of 4th level and every three levels thereafter). This replaces smite evil.</p>"
                },
                "Spells": {
                    "name": "Spells",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 4th level, when a sacred servant gains the ability to cast spells, she also chooses one domain associated with her deity. Her effective cleric level for this domain is equal to her paladin level –3. In addition, she also gains one domain spell slot for each level of paladin spells she can cast. Every day she must prepare the domain spell from her chosen domain in that spell slot.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 5th level, instead of forming a divine bond with her weapon or a mount, a sacred servant forms a bond with her holy symbol. As a standard action, a sacred servant can bind a celestial spirit to her holy symbol for 1 minute per paladin level. When called, the spirit causes the sacred servant's holy symbol to shed light like a torch. At 5th level, the spirit grants one bonus. For every three levels beyond 5th, the spirit grants one additional bonus. These bonuses can be spent in a number of ways to grant the paladin enhanced abilities to channel positive energy and to cast spells. Each bonus can be used to grant one of the following enhancements: +1 caster level to any paladin spell cast, +1 to the DC to halve the damage of channel positive energy when used to harm undead, +1d6 to channel positive energy, +1 use/day of lay on hands. These enhancements stack and can be selected multiple times. The enhancements granted by the spirit are determined when the spirit is called and cannot be changed until the spirit is called again. If the sacred servant increases her number of uses of lay on hands per day in this way, that choice is set for the rest of the day, and once used, these additional uses are not restored (even if the spirit is called again that day). The celestial spirit imparts no enhancements if the holy symbol is held by anyone other than the sacred servant, but resumes giving enhancements if returned to the sacred servant. A sacred servant can use this ability once per day at 5th level, and one additional time per day for every four levels beyond 5th, to a total of four times per day at 17th level.</p><p>If a holy symbol with a celestial spirit is destroyed, the sacred servant loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the sacred servant takes a –1 penalty on attack and weapon damage rolls.</p>"
                },
                "Call Celestial Ally": {
                    "name": "Call Celestial Ally",
                    "type": "Class Feature",
                    "featureType": "Sp",
                    "description": "<p>At 8th level, a sacred servant can call upon her deity for aid, in the form of a powerful servant. This allows the sacred servant to cast lesser planar ally once per week as a spell-like ability without having to pay the material component cost or the servant (for reasonable tasks). At 12th level, this improves to planar ally and at 16th level, this improves to greater planar ally. The sacred servant's caster level for this effect is equal to her paladin level. This ability replaces aura of resolve.</p>"
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Shining Knight": {
                "name": "Shining Knight",
                "type": "Archetype",
                "description": "<p>While paladins often are seen mounted atop a loyal steed, the shining knight is the true symbol of mounted bravery. They are never far from their steeds and are always clad in brightly polished armor. The shining knight has the following class features.</p>",
                "Skilled Rider (Ex and Su)": {
                    "name": "Skilled Rider (Ex and Su)",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 3rd level, a shining knight does not take any penalty to her Ride skill due to her armor check penalty. In addition, any mount she is riding gains the benefit of her divine grace class feature, adding her Charisma bonus (if any) to its saving throws. This ability replaces divine health.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>Upon reaching 5th level, a shining knight must form a bond with a mount. This ability otherwise functions as the paladin ability.</p>"
                },
                "Knight's Charge": {
                    "name": "Knight's Charge",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, whenever a mounted shining knight charges a foe, her movement does not provoke attacks of opportunity, for either her or her mount. In addition, if her target is also the target of her smite evil ability and the charge attack hits, the target must make a Will save or be panicked for a number of rounds equal to 1/2 the shining knight's level. The DC of this save is equal to 10 + 1/2 the shining knight's level + the shining knight's Charisma modifier. This ability replaces aura of justice.</p>"
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Undead Scourge": {
                "name": "Undead Scourge",
                "type": "Archetype",
                "description": "<p>Undead are an abomination in the eyes of the just and righteous. It is no surprise then that there are some paladins that dedicate themselves to wiping these unholy terrors from the world. The following are the class features of the undead scourge.</p>",
                "Smite Evil": {
                    "name": "Smite Evil",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>This functions as the paladin ability of the same name, but the undead scourge does not deal 2 points of damage per level on the first successful attack against evil dragons and evil outsiders. She does deal 2 points of damage per level on all smite attacks made against evil undead creatures.</p>"
                },
                "Aura of Life": {
                    "name": "Aura of Life",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 8th level, an undead scourge emits a 10-foot aura of life around her that weakens undead creatures. Undead in this aura take a –4 penalty on Will saves made to resist positive energy. In addition, undead in this aura do not regain hit points from channeled negative energy. This ability replaces aura of resolve.</p>"
                },
                "Undead Annihilation": {
                    "name": "Undead Annihilation",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, an undead scourge can expend one use of her smite evil ability as a standard action and make a single melee attack against an undead creature. If this attack hits, the undead creature must make a Will save or be destroyed. The save DC is equal to 10 + 1/2 the undead scourge's level + the undead scourge's Charisma modifier. Undead with twice as many Hit Dice as the undead scourge are unaffected by this ability. If the attack misses, the smite evil is wasted without effect. This ability replaces aura of justice.</p>"
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Warrior of the Holy Light": {
                "name": "Warrior of the Holy Light",
                "type": "Archetype",
                "description": "<p>Some paladins use their gifts to focus on the holy light that shines within their souls. With the gifts of purity and redemption, these paladins spend much of their lives helping others find the true path. Unleashing this power takes patience and comes at a steep price. Warriors of the holy light have the following class features.</p>",
                "Power of Faith": {
                    "name": "Power of Faith",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 4th level, a warrior of the holy light learns to use the power of her faith to bolster her defenses and aid her allies. This class feature replaces the paladin's spells class feature. A warrior of the holy light does not gain any spells or spellcasting abilities, does not have a caster level, and cannot use spell trigger or spell completion magic items.</p><p>At 4th level, the warrior of the holy light gains one additional use of her lay on hands ability per day. She gains one additional use of lay on hands per day for every four levels she attains beyond 4th. She can spend a use of her lay on hands ability to call upon the power of her faith as a standard action. This causes a nimbus of light to emanate from the warrior of the holy light in a 30-foot radius. All allies in this area (including the warrior of the holy light) receive a +1 morale bonus to AC and on attack rolls, damage rolls, and saving throws against fear as long as they remain in the area of light. This power lasts for 1 minute.</p><p>At 8th level, the nimbus of light heals the paladin and her allies, curing of them of 1d4 points of ability damage, as per the spell lesser restoration. A creature can only be healed in this way once per day.</p><p>At 12th level, the nimbus of light is treated as daylight for the purposes of affecting creatures with sensitivity to light. In addition, the nimbus grants the warrior of the holy light and her allies in the area resistance 10 to one type of energy, selected by the warrior of the holy light when this power is activated.</p><p>At 16th level, the nimbus of light grants the warrior of the holy light and her allies protection from critical hits. There is a 25% chance that critical hits made against the warrior of the holy light and her allies in the area are instead treated as normal hits. This does not stack with other abilities that grant similar protection (such as light fortification).</p><p>At 20th level, the nimbus of light increases in size out to a range of 60 feet. In addition, all of its bonuses increase. The morale bonus to AC and on attack rolls, damage rolls, and saving throws against fear increases to +2. The amount of ability damage healed increases to 2d4. The energy resistance increases to 20 against one energy type. Finally, protection against critical hits increases to 50%.</p>"
                },
                "Shining Light": {
                    "name": "Shining Light",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 14th level, a warrior of the holy light can unleash a 30-foot burst of pure, white light as a standard action. Evil creatures within this burst take 1d6 points of damage for every two paladin levels and are blinded for 1 round. Evil dragons, evil outsiders, and evil undead are blinded for 1d4 rounds on a failed save. A Reflex save halves this damage and negates the blindness. The DC of this save is equal to 10 + 1/2 the warrior of the holy light's level + the warrior of the holy light's Charisma modifier. Good creatures within this burst are healed 1d6 points of damage per two paladin levels and receive a +2 sacred bonus on ability checks, attack rolls, saving throws, and skill checks for 1 round. A warrior of the holy light can use this ability once per day at 14th level plus one additional time per day at 17th and 20th levels. This ability replaces aura of faith.</p>"
                },
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Oathbound Paladin": {
                "name": "Oathbound Paladin",
                "type": "Archetype",
                "description": "<p>While all paladins have their own codes of conduct, either taught by an order, handed down from the gods, or inspired by personal conviction, an oathbound paladin devotes herself to a singular cause, which grants her additional powers but also gives further edicts she must follow. An oathbound paladin swears an oath to eradicate a certain kind of evil. This powerful oath gives her access to new spells and adds to or alters typical paladin abilities.</p><p>An oathbound paladin can take multiple oaths, but none of the other oaths can replace or alter the same class feature from the paladin class as another alternate class feature. For example, a paladin cannot take the Oath against Corruption and the Oath against the Wyrm because they both replace the aura of courage class feature.</p><p>Paladins who take up an oath may make a sacred promise to their god or temple to perform some specific and grand action associated with the oath. For example, an oathbound paladin who takes the Oath of Vengeance may be tasked with killing the orc warlord who razed her home city, while a paladin with the Oath against the Wyrm may be asked to secure a nonaggression pact with a family of dragons. When a paladin completes the sacred promise, the oath is fulfilled, and she may abandon the oath if she so chooses; she may then select another oath or become a standard paladin or a different paladin archetype.</p><p>If a paladin violates the code of her oath, she loses the class abilities associated with that oath until she atones. If she violates her paladin's code, she loses her oath abilities as well as her other paladin abilities.</p>",
                "Deity": {
                    "name": "Deity",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>Some oaths are especially compatible with the faiths of certain deities; these deities are listed here. Other deities may allow these oaths as well, though only rarely do deities allow oaths conflicting with their teachings.</p>"
                },
                "Code of Conduct": {
                    "name": "Code of Conduct",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>The oathbound paladin must abide by the listed tenets of her oath in addition to the specifics of her god's code of conduct. In some cases, a deity's or paladin order's code may conflict with the oath's tenets; in most cases, these conflicts mean the oath is unsuitable for a paladin of that deity or order (such as the Oath against the Wyrm with respect to a good dragon deity or a dragon-riding order of paladins) and cannot be selected by the paladin.</p>"
                },
                "Oath Spells": {
                    "name": "Oath Spells",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>A paladin's oath influences what magic she can perform. An oathbound paladin adds one spell to the paladin spell list at each paladin spell level she can cast (including spell levels for which she would only gain spells per day if her Charisma were high enough to grant bonus spells of that level). Her oath determines what spell is added to the spell list. If the paladin has multiple oaths, the spells from each oath are added to her spell list.</p><p>If an oathbound paladin has more than one oath, she may prepare any one of her oath's spells in that slot (similar to a cleric choosing one of her two domain spells to prepare in a domain spell slot).</p>"
                },
                "Oath against Corruption": {
                    "name": "Oath against Corruption",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>More insidious than meddling devils and more destructive than rampaging hordes are the strange alien entities that bubble up from the deep earth and the strange places beyond the sky. When a paladin takes this oath, she becomes a hunter of aberrations, protecting the common people from these bizarre threats. Often the paladin works in secret, not wanting to spread panic about her mission. Within cities they sometimes have underground bases that give access through the sewers and passages to strange vaults where the aberrant creatures live.</p>",
                    "Aura of Purity": {
                        "name": "Aura of Purity",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 3rd level, you gain a +4 sacred bonus on saves against spells and effects from creatures of the aberration type. Allies within 10 feet gain a +1 sacred bonus on these saves. This ability functions only while the paladin is conscious, not if she is unconscious or dead. This ability replaces aura of courage.</p>"
                    },
                    "Cleansing Flame": {
                        "name": "Cleansing Flame",
                        "type": "Class Feature",
                        "featureType": "Sp",
                        "description": "<p>At 11th level, you may expend two uses of your smite evil ability to ignite your weapon with a cleansing blue flame for 1 minute. This flame sheds light as a torch. Aberrations within 20 feet of the flame take a –4 penalty on attack rolls against you and your allies, and your allies within 20 feet of the flame gain a +2 sacred bonus on saving throws against spells and effects from aberrations. This ability replaces aura of justice.</p>"
                    },
                    "Cast into the Void": {
                        "name": "Cast into the Void",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 20th level, a paladin becomes a conduit for the power of her god. Her DR increases to 10/evil. Whenever she uses smite evil and successfully strikes an aberration, the creature must make a Will save (DC 10 + 1/2 the paladin's level + the paladin's Charisma modifier) or be banished to oblivion. This ability does not kill the creature, but it is sent to a remote place, such as deep underground or far into space (if it is a creature native to space), and cannot return under its own power for at least 100 years.</p><p>Whenever the paladin channels positive energy or uses lay on hands to heal a creature, she heals the maximum possible amount. This ability replaces holy champion.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Hunt aberrations and do not allow them to roam freely or harm others. Destroy them if you can, or banish them if you cannot.</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—true strike; 2nd—acute senses; 3rd—touch of idiocy; 4th—spell immunity.</p>"
                    }
                },
                "Oath against Fiends": {
                    "name": "Oath against Fiends",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>A paladin who takes an oath against demons, devils, daemons, and other evil outsiders is constantly on the lookout for malicious fiendish insurgence into the world, and faces it with swift and unwavering defiance. Often she works closely with inquisitors, searching for signs of outsider manipulation and possession.</p>",
                    "Anchoring Aura": {
                        "name": "Anchoring Aura",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 8th level, a paladin's aura hampers extradimensional travel by evil outsiders. The aura extends 20 feet from the paladin. Evil outsiders attempting to use abilities such as dimension door, plane shift, or teleport to leave or enter the aura must succeed at a Will save (DC 10 + 1/2 the paladin's level + the paladin's Charisma modifier); failure means the ability does not function, as if the outsider were affected by dimensional anchor. The aura functions only while the paladin is conscious, not if she is unconscious or dead.</p><p>Alternatively, as an immediate action, the paladin can expend one use of her smite evil ability to target an evil outsider within 30 feet with dimensional anchor. A targeted dimensional anchor persists even if the paladin is unconscious or dead.</p><p>This ability replaces aura of resolve.</p>"
                    },
                    "Holy Vessel": {
                        "name": "Holy Vessel",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 9th level, a paladin whose divine bond is with a weapon can also use her divine bond to augment her armor or shield with enhancement bonuses, or add any of the following armor or shield properties: bashing, fortification, and spell resistance. Adding these properties consumes an amount of bonus equal to the property's cost (see the armor special abilities and shield special abilities tables). She can divide her bonuses from the divine bond ability among her weapon, armor, and shield as she sees fit. This ability has no effect for a paladin whose divine bond is with a mount. This ability replaces the mercy gained at 9th level.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Never suffer an evil outsider to live if it is in your power to destroy it. Banish fiends you cannot kill. Purge the evil from those possessed by fiends</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—resist energy; 2nd—detect thoughts; 3rd—invisibility purge; 4th—plane shift.</p>"
                    }
                },
                "Oath against Savagery": {
                    "name": "Oath against Savagery",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>Some paladins are champions of order, pledging to battle the hordes of goblinoids, orcs, hostile barbarians, and similar savages that nip at the heels of civilization, as well as those who gnaw on society from within, such as thieves' and assassins' guilds. More so than other paladins, those who take this oath expect to fight many creatures at once, and develop special abilities to deal with these numbers.</p>",
                    "Holy Reach": {
                        "name": "Holy Reach",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 2nd level, an oathbound paladin can expend one use of her smite evil ability to extend her natural reach by 5 feet for 1 minute. This does not stack with the Lunge feat. This ability replaces divine grace.</p>"
                    },
                    "Hordebreaker": {
                        "name": "Hordebreaker",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 11th level, when the paladin hits an evil humanoid with an attack of opportunity, she deals an additional 1d6 points of damage. When using holy reach, the paladin may make a number of additional attacks of opportunity per round equal to her Charisma bonus. This increase stacks with similar increases from other sources such as Combat Reflexes. This ability replaces aura of justice.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Always heed the call of a community in danger from savages. Be the first in line to defend a settlement and the last to retreat.</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—deathwatch; 2nd—protection from arrows; 3rd—haste; 4th—divine power.</p>"
                    }
                },
                "Oath against Undeath": {
                    "name": "Oath against Undeath",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>A paladin with this oath vows to restore the natural state of death to any animate corpse she encounters, and destroy the undead energy in the process. While a few paladins who take this oath recognize that not all undead are evil, others are quite willing to purge neutral and good undead along with all the evil ones.</p>",
                    "Detect Undead": {
                        "name": "Detect Undead",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>This ability works like the standard paladin ability to detect evil, except as detect undead instead of detect evil. This ability replaces detect evil.</p>"
                    },
                    "Ghost Touch Aura": {
                        "name": "Ghost Touch Aura",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 3rd level, the paladin's armor is treated as if it had the ghost touch armor property. This does not affect the cost or effect of any other abilities of the armor. At 9th level, this ability also applies to the paladin's shield. This ability replaces the paladin's 3rd-level and 9th-level mercies.</p>"
                    },
                    "Aura of Life": {
                        "name": "Aura of Life",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 8th level, the paladin gains a +4 morale bonus on saves against attacks that grant negative levels and saves to overcome negative levels. Each ally within 10 feet of her gains a +2 morale bonus on these saves.</p><p>This ability functions only while the paladin is conscious, not if she is unconscious or dead. This ability replaces aura of resolve.</p>"
                    },
                    "Superior Channeler": {
                        "name": "Superior Channeler",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 11th level, a paladin can channel positive energy to harm undead by expending a single usage of her lay on hands ability instead of two. This ability replaces aura of justice.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Destroy all undead. Put to rest the poor souls turned against their will. Prevent the taint of undeath from spreading to the newly dead, blessing or burning the corpses as necessary.</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—sanctify corpse; 2nd—darkvision; 3rd—searing light; 4th—halt undead.</p>"
                    }
                },
                "Oath against the Wyrm": {
                    "name": "Oath against the Wyrm",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>Few dragons see the smaller races of the world as their equals—to most, humanoids are either food or an annoyance. Some paladins swear to protect others against the predation of dragonkind. Some include dragon-blooded creatures (such as half-dragons or even sorcerers with the draconic bloodline) in their oath and team up with inquisitors to root out those whose ancestry carries the taint of dragon magic. Many paladins with this oath are thrill-seekers for the cause of good, channeling their divine power in ways that allow them to take on their powerful foes head on.</p>",
                    "Breath Evasion": {
                        "name": "Breath Evasion",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 4th level, a paladin with this oath gains evasion, but only against the breath weapons of creatures with the dragon type. This ability replaces channel positive energy.</p>"
                    },
                    "Divine Bond": {
                        "name": "Divine Bond",
                        "type": "Class Feature",
                        "featureType": "Sp",
                        "description": "<p>This works like the paladin's normal divine bond ability, except as follows. If the paladin's bond is with a weapon, she cannot use that ability to add the brilliant energy, disruption, or merciful weapon properties, but she can add the bane weapon property (but only against dragons). If the paladin's bond is with her steed, the steed gains the paladin's aura-based immunities and her aura does not affect allies. This replaces the standard divine bond ability.</p>"
                    },
                    "Dragon-Slaying Strike": {
                        "name": "Dragon-Slaying Strike",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 20th level, an oathbound paladin becomes a conduit of holy power. Her DR increases to 10/evil. Whenever she uses smite evil and successfully strikes a dragon, the dragon is also subject to a single-target holy word, using her paladin level +10 as the caster level. After the banishment effect and the damage from the attack are resolved, the smite immediately ends. In addition, whenever she channels positive energy or uses lay on hands to heal a creature, she heals the maximum possible amount. This ability replaces holy champion.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Slay evil dragons, as well as other dangerous dragons whether or not they are evil. Prevent the bloodlines of other creatures from being corrupted with draconic power. Protect the innocent against the predation of dragons.</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—enlarge person; 2nd—bear's endurance; 3rd—fly; 4th—stoneskin.</p>"
                    }
                },
                "Oath of Charity": {
                    "name": "Oath of Charity",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>Charity is more than just giving money to a temple or a cause—it is about the necessity of sacrifice to help others. Those who take this oath dedicate their lives to protecting those who can't protect themselves and giving to those who are in need. They are generous to a fault, the most steadfast of friends, and give without anyone needing to ask. Paladins who take the oath of charity often turn over a fifth or more of their acquired wealth gained through adventuring to their temples or community.</p>",
                    "Charitable Hands": {
                        "name": "Charitable Hands",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 2nd level, a paladin with this oath heals 50% less when she uses lay on hands on herself, but 50% more than the normal amount when she uses it to heal others. Using lay on hands to harm undead deals the normal amount of damage. This ability otherwise works like and replaces lay on hands.</p>"
                    },
                    "Charitable Mercy": {
                        "name": "Charitable Mercy",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 5th level, a paladin with this oath is more flexible with her mercies than other paladins. At the start of each day, a paladin with this oath can select her mercies anew from the list of available mercies. This ability replaces divine bond.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Always offer help to good creatures who need it. Always offer help to the poor and destitute. (In settlements, this help is often handled by donating to charitable religious organizations, rather than the paladin being required to dole out coppers to every beggar in the street.)</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—magic stone; 2nd—make whole; 3rd—magic vestment; 4th—imbue with spell ability.</p>"
                    }
                },
                "Oath of Chastity": {
                    "name": "Oath of Chastity",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>A chaste paladin proves her purity by way of her action and her abstinence from romantic activities. Many believe that this oath is only about sex, but it is really an oath about the romantic notion that a single person could be more important than all the evils facing the world—it is this perceived selfishness that the bearer of the Oath of Chastity strives to reject. In doing so, she gains purifying power.</p>",
                    "Pure of Mind": {
                        "name": "Pure of Mind",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 2nd level, the paladin gains a +4 sacred bonus on saves against charm effects and figments, and gains a bonus equal to her Charisma modifier on Will saving throws. This ability replaces divine grace.</p>"
                    },
                    "Pure of Body": {
                        "name": "Pure of Body",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>Upon reaching 8th level, the paladin has a 50% chance to turn any critical hit or sneak attack against her into a normal hit, as if she were wearing fortification armor. This ability replaces aura of resolve.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Never engage in a romantic relationship or a sexual act.</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—remove fear; 2nd—confess; 3rd—heroism; 4th—freedom of movement.</p>"
                    }
                },
                "Oath of Loyalty": {
                    "name": "Oath of Loyalty",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>To most paladins, their word is everything. When they say something, it will be done. Those who take this oath put that ideal to the test every day. The oathbound paladin's word is a promise, a sacred bond, and also greater power in the cause of law and good. She is careful with her words, lest she agree to something she cannot fully support.</p>",
                    "Loyal Oath": {
                        "name": "Loyal Oath",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>Starting at 1st level, once per day as a swift action, an oathbound paladin can choose a willing creature within line of sight as the target of her loyal oath. When the paladin is adjacent to the target of her loyal oath, she grants the target a sacred bonus on saving throws and to Armor Class equal to the paladin's Charisma bonus. The loyal oath lasts 1 minute, or until the paladin dismisses it (a free action) or discharges it (see below), whichever comes first.</p><p>If the target is struck by an enemy and the paladin is adjacent to that enemy, as an immediate action she may make a single melee attack against that enemy; making this attack ends the loyal oath. At 4th level and every three levels thereafter, the paladin may use her loyal oath one additional time per day. This ability replaces smite evil.</p>"
                    },
                    "Loyal Guardian": {
                        "name": "Loyal Guardian",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 8th level, whenever the target of the paladin's loyal oath is hit with a melee or ranged attack, if the paladin is adjacent to the target, she can spend an immediate action to have the attack automatically hit her instead of the intended target. This ends the loyal oath.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Keep all promises. Never make an oath or promise lightly. Never go back on an oath.</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—wrath; 2nd—aid; 3rd—helping hand; 4th—sending.</p>"
                    }
                },
                "Oath of Vengeance": {
                    "name": "Oath of Vengeance",
                    "type": "Oath",
                    "featureType": "",
                    "description": "<p>While all paladins uphold the principals of law and good, sometimes these ideas must have a ruthless and dangerous side. It often falls upon a paladin to bring justice in the form of vengeance upon heinous transgressors against law and good. These oathbound paladins are always on the hunt for those who have perpetrated evil, and are the instrument of Heaven's most definitive and implacable judgment.</p>",
                    "Channel Wrath": {
                        "name": "Channel Wrath",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>When an oathbound paladin reach 4th level, she can spend two uses of her lay on hands ability to gain an extra use of smite evil that day. This ability has no effect for a paladin who does not have the smite evil ability. This ability replaces channel positive energy.</p>"
                    },
                    "Powerful Justice": {
                        "name": "Powerful Justice",
                        "type": "Class Feature",
                        "featureType": "Su",
                        "description": "<p>At 11th level, an oathbound paladin may spends one use of her smite evil ability to grant her allies within 10 feet the ability to smite evil, except they only gain the paladin's bonus to damage, not her smite's attack bonus or ability to bypass DR. This ability replaces aura of justice.</p>"
                    },
                    "Code of Conduct": {
                        "name": "Code of Conduct",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>Never let lesser eveils distract you from your pursuit of just vengeance.</p>"
                    },
                    "Oath Spells": {
                        "name": "Oath Spells",
                        "type": "Class Feature",
                        "featureType": "",
                        "description": "<p>1st—wrath; 2nd—confess; 3rd—blessing of fervor; 4th—order's wrath.</p>"
                    }
                },
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Divine Hunter": {
                "name": "Divine Hunter",
                "type": "Archetype",
                "description": "<p>Most paladins rush into battle, meeting evil toe-to-toe. The divine hunter prefers to engage evil from afar, striking down her foes before they can threaten her allies.</p>",
                "Precise Shot": {
                    "name": "Precise Shot",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>A divine hunter gains Precise Shot as a bonus feat at 1st level, even if she doesn't meet the prerequisites. This ability replaces her Heavy Armor Proficiency.</p>"
                },
                "Shared Precision": {
                    "name": "Shared Precision",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 3rd level, when a divine hunter hits a creature with a ranged attack, she grants her allies within 10 feet of her the benefit of the Precise Shot feat against that target until the start of her next turn. Her allies must remain within 10 feet of her, and must be able both to see and hear the divine hunter to gain this benefit. This ability replaces aura of courage.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 5th level, a divine hunter forms a bond with her deity. This functions as the paladin's divine bond ability, except the bond must always take the form of a ranged or throwing weapon (excluding ammunition). In addition to the listed abilities, a divine hunter can add the distance, returning, or seeking special abilities to her weapon, but she cannot add the defending or disruption special abilities. Special abilities added to throwing weapons function normally when the weapon is used in melee. This ability replaces the standard paladin's divine bond.</p>"
                },
                "Distant Mercy": {
                    "name": "Distant Mercy",
                    "type": "Class Feature",
                    "featureType": "Sp",
                    "description": "<p>At 6th level, a divine hunter can expend two uses of her lay on hand abilities to use her lay on hands ability on a target within 5 feet per paladin level. Distant mercy has no effect on creatures harmed by positive energy, such as undead. This ability replaces the paladin's 6th-level mercy.</p>"
                },
                "Aura of Care": {
                    "name": "Aura of Care",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 8th level, a divine hunter and her allies gain a preternatural awareness of each other's position in battle. She and any allies within 10 feet of her no longer provide cover against each other's ranged attacks unless they wish to. Allies who cannot move or otherwise take actions still provide cover, as do flat-footed allies. The divine hunter and her allies must be able to see or hear each other to use this ability. This ability replaces aura of resolve.</p>"
                },
                "Hunter's Blessing": {
                    "name": "Hunter's Blessing",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, a divine hunter can expend a use of her smite evil ability as a swift action to grant herself and all allies within 10 feet the Deadly Aim, Precise Shot, and Improved Precise Shot feats, even if they lack the prerequisites. The effects last for 1 minute. Evil creatures gain no benefit from this ability. This ability replaces aura of justice.</p>"
                },
                "Righteous Hunter": {
                    "name": "Righteous Hunter",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 14th level, a divine hunter's ranged weapons are treated as good-aligned for the purposes of overcoming damage reduction. Any ranged attacks made by an ally within 10 feet of her are likewise treated as good-aligned for the purposes of overcoming damage reduction.</p><p>This ability functions only while the divine hunter is conscious. This ability replaces aura of faith.</p>"
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Empyreal Knight": {
                "name": "Empyreal Knight",
                "type": "Archetype",
                "description": "<p>The empyreal knight dedicates her life to serving the celestial beings that guide mortals in their struggle toward the light.</p>",
                "Voices of the Spheres": {
                    "name": "Voices of the Spheres",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 2nd level, an empyreal knight learns to speak and read Celestial, if she could not already. This ability replaces divine grace.</p>"
                },
                "Celestial Heart": {
                    "name": "Celestial Heart",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>As an empyreal knight advances, her ties with the celestial realms grant her a portion of the abilities and defenses of true angels. At 3rd level, she gains resistance 5 against acid, cold, and electricity. At 6th level, she gains a +4 racial bonus on saves against poison. At 9th level, her defenses improve to resistance 10 against acid, cold, and electricity. At 12th level, she gains immunity to petrification.</p><p>At 15th level, she gains truespeech, the ability to speak with any creature that has a language as though using a tongues spell. This ability functions with a caster level equal to her character level, and is always active.</p><p>At 18th level, as a swift action, the empyreal knight can manifest a protective aura against evil. Against abilities or effects created by evil creatures, this ability provides a +4 deflection bonus to AC and a +4 resistance bonus on saving throws to anyone within 20 feet of her. It otherwise functions as a magic circle against evil. She can use this ability for a maximum of 1 round per day per paladin level. These rounds do not need to be consecutive. These abilities replace mercy.</p>"
                },
                "Celestial Ally": {
                    "name": "Celestial Ally",
                    "type": "Class Feature",
                    "featureType": "Sp",
                    "description": "<p>At 4th level, an empyreal knight can summon a celestial ally as a full-round action. This functions as summon monster I, except it can only be used to summon celestial creatures, archons, and angels. At 6th level, this improves to summon monster II, increasing by one spell level for every two levels thereafter, to a maximum of summon monster IX at 20th level. This ability can be used a number of times per day equal to the empyreal knight's Charisma modifier (minimum 1), but only one ally can be summoned at a time. This ability replaces lay on hands and channel positive energy.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 5th level, an empyreal knight forms a bond with a mount, as the standard paladin ability. Her mount gains the celestial template at 8th level. At 12th level, her mount sprouts wings if it cannot already fly, and gains a fly speed of twice its land speed and good maneuverability. If the mount could already fly, its fly speed and maneuverability improve to at least this level. This ability otherwise functions as the paladin ability of the same name.</p>"
                },
                "Empyreal Champion": {
                    "name": "Empyreal Champion",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 20th level, an empyreal knight transcends her mortal self. Her DR increases to 10/evil. Her type is treated as outsider for the purposes of spells and magical effects. She gains darkvision 60 feet and low-light vision. As a standard action and a supernatural ability, she can sprout wings that allow her to fly at twice her land speed with average maneuverability. Any armor or clothing reshapes to allow her to fly when she uses this ability. She can retract the wings as a free action. Unlike other outsiders, an empyreal knight can still be brought back from the dead as if she were a member of her previous creature type. This ability replaces holy champion.</p>"
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Holy Gun": {
                "name": "Holy Gun",
                "type": "Archetype",
                "description": "<p>Not all paladins are knights in shining armor. Holy guns roam the world searching for evil. And where they find it, they put it down.</p>",
                "Weapon and Armor Proficiency": {
                    "name": "Weapon and Armor Proficiency",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>Holy guns are proficient with all simple and martial weapons, firearms, and light armor.</p>"
                },
                "Have Gun": {
                    "name": "Have Gun",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 1st level, the holy gun gains the Amateur Gunslinger feat and Gunsmithing as a bonus feat. She also gains a battered gun identical to the one gained by the gunslinger. This ability replaces detect evil.</p>"
                },
                "Divine Deed": {
                    "name": "Divine Deed",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 2nd level, the holy gun gains the following deed. This deed works and interacts with grit the same way as gunslinger deeds, but only the holy gun can use it. If the holy gun also has levels in gunslinger, she can spend grit points from that class to use this deed.</p>"
                },
                "Smiting Shot": {
                    "name": "Smiting Shot",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>A holy gun can spend 1 grit point to make a smiting shot with a firearm attack as a standard action. If the target is evil, the holy gun adds her Charisma bonus and her paladin level to the damage of the firearm attack. If the target of the smiting shot is an outsider with the evil subtype, an evil-aligned dragon, or an undead creature, the bonus to damage increases to the Charisma modifier plus 2 points of damage per level the paladin possess. Regardless of the target, smiting shot automatically bypasses any DR the creature might have. This ability replaces smite evil.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 5th level, a holy gun forms a bond with her deity. This functions as the paladin's divine bond ability, except the bond must always take the form of a firearm. In addition to the listed abilities, a holy gun can add the distance, reliable, or seeking special abilities to her weapon, but she cannot add the defending or disruption special abilities. This ability replaces the standard paladin's divine bond.</p>"
                },
                "Holy Grit": {
                    "name": "Holy Grit",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 11th level, a holy gun gains a number of grit points equal to her Charisma modifier (minimum 1) and gains the use of a single gunslinger deed. She can select any deed that a gunslinger of her paladin level –4 could use. At 14th level, and every three levels beyond 14th, the holy gun gains another point of grit and another gunslinger deed that a gunslinger of her level –4 could use. If she already has levels in gunslinger, she gains a bonus to the maximum amount of grit she can have each day, equal to her Charisma bonus (if any) but gains no extra grit as the start of each day.</p>"
                },
                "Holy Slinger": {
                    "name": "Holy Slinger",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>This ability function like the holy champion paladin class feature, but the banishment occurs when she hits an evil outsider with the smiting shot deed.</p>"
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Holy tactician": {
                "name": "Holy tactician",
                "type": "Archetype",
                "description": "<p>The holy tactician inspires her allies on the field of battle. Her place is at their side against overwhelming odds, and her guidance brings out their true potential.</p>",
                "Weal's Champion": {
                    "name": "Weal's Champion",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>Once per day as swift action, a holy tactician can call on the powers of good to aid her against evil. Against evil targets, the holy tactician gains her Charisma bonus (if any) on her attack rolls against evil creatures, and if she hits, she adds 1/2 her paladin level on her weapon damage rolls as well. These bonuses last for 1 round for every two paladin levels the holy tactician has attained (minimum 1 round).</p><p>In addition, for 1 round after the holy tactician successfully strikes an evil creature, all non-evil allies within 30 feet of her gain a competence bonus on attack rolls equal to 1/2 her Charisma bonus against that creature as well as a +1 competence bonus on damage rolls. The bonus on damage rolls increases by +1 for every five levels the holy tactician attains (to a maximum of +5 at 20th level). She can grant this bonus against more than one creature at a time. To gain this benefit, the holy tactician's allies must be able to see or hear her, and she must be conscious.</p><p>At 4th level, and every three levels thereafter, the holy tactician may use weal's champion one additional time per day (to a maximum of seven times per day at 19th level). This ability replaces smite evil.</p>"
                },
                "Tactical Acumen": {
                    "name": "Tactical Acumen",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 3rd level, a holy tactician gains a teamwork feat as a bonus feat. She must meet the prerequisites for this feat. She gains an additional bonus feat for every four levels attained after 3rd, to a maximum of five bonus feats at 19th level. This ability replaces divine health and divine bond.</p>"
                },
                "Battlefield Presence": {
                    "name": "Battlefield Presence",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 3rd level, a tactician can direct her allies in battle, granting each ally within 30 feet one teamwork feat she possesses as a bonus feat as a standard action. All allies must receive the same feat, but do not need to meet the prerequisites of this bonus feat. This ability does not function if the paladin is flat-footed or unconscious. Allies must be able to see and hear the holy tactician in order to gain this benefit. Changing the bonus feat granted is a swift action. This ability replaces aura of courage.</p>"
                },
                "Guide the Battle": {
                    "name": "Guide the Battle",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 8th level, the paladin can direct her allies into an advantageous position once per round as a move action. Each ally (if physically able to) can move 5 feet without expending an action. This movement does not provoke attacks of opportunity. The allies must be able to see or hear the paladin in order to make this movement and cannot be flat-footed. At 15th level, her allies can make this 5-foot move and ignore difficult terrain. This ability replaces aura of resolve.</p>"
                },
                "Weal's Wrath": {
                    "name": "Weal's Wrath",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, a tactician can expend two uses of her weal's champion ability at once to enhance its effects. This functions as weal's champion, except the bonus she provides to her allies lasts until each creature she strikes is slain, her weal's champion ability expires, or the paladin herself is slain or knocked unconscious, whichever happens first. This ability replaces aura of justice.</p>"
                },
                "Masterful Presence": {
                    "name": "Masterful Presence",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 20th level, a tactician gains the ability to grant a different bonus feat to each ally affected by her battlefield presence. In addition, all critical threats made by her and her allies against creatures affected by her weal's champion ability are automatically confirmed (no confirmation roll is needed). This ability replaces holy champion.</p>"
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Sacred Shield": {
                "name": "Sacred Shield",
                "type": "Archetype",
                "description": "<p>When faced by evil, the sacred shield reaches first not for a weapon, but for her trusty shield. With her faith, she can ward others from harm.</p>",
                "Bastion of Good": {
                    "name": "Bastion of Good",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 1st level, a sacred shield can call upon the powers of good to defend her and her allies against evil. This ability functions as smite evil, except that the paladin gains no benefit on attack or damage rolls against her target. Instead, any attacks the target makes against allies within 10 feet of the paladin deal half damage. Attacks against the paladin deal full damage, but the paladin gains a deflection bonus to her AC equal to her Charisma bonus (if any) against attacks made by the target of the smite. This bonus increases by +1 for every four paladin levels (to a maximum of +6 at 20th level). As with smite evil, if the paladin targets a creature that is not evil, her bastion of good ability is wasted with no effect. Feats, abilities, and the like that increase a paladin's number of uses of smite evil per day increase a sacred shield's uses of bastion of good per day. This ability replaces smite evil.</p>"
                },
                "Holy Shield": {
                    "name": "Holy Shield",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 4th level, a sacred shield can channel her faith into her shield, protecting any nearby allies. All allies adjacent to the paladin gain a shield bonus equal to the sacred shield's own shield bonus, including any increase from the shield's enhancement bonus. This bonus does not stack with any existing shield bonuses. The paladin herself radiates light as a light spell while the shielding is active. At 11th level, this protection expands to cover any allies within 10 feet and the radiance increases to the effects of a daylight spell. At 20th level, any allies within 20 feet are protected. Using this ability consumes two uses of the sacred shield's lay on hands ability, and the effects last for 3 rounds plus a number of rounds equal to her Charisma bonus (if any). This ability replaces channel positive energy.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 5th level, instead of forming a divine bond with her weapon or a mount, a sacred shield forms a bond with her shield. As a standard action, a sacred shield can enhance her shield by calling on the aid of a celestial spirit. This bond lasts for 1 minute per paladin level. When called, the spirit causes the shield to shed light like a torch. At 5th level, the spirit grants the shield a +1 enhancement bonus. For every three levels beyond 5th, the shield gains another +1 enhancement bonus, to a maximum of +6 at 20th level. These bonuses can be added to the shield, stacking with existing enhancement bonuses to a maximum of +5, or they can be used to add any of the following armor special abilities: arrow deflection, bashing, blinding, fortification (any), reflecting, and spell resistance (any). The reflecting enhancement may be used once each time the sacred shield makes use of her divine bond. Adding these armor special abilities consumes an amount of bonus equal to the property's cost. These bonuses are added to any properties the shield already has, but duplicate special abilities do not grant any extra benefit. If the shield is not magical, at least a +1 enhancement bonus must be added before any other special abilities can be added. The bonus and special abilities granted by the spirit are determined when the spirit is called and cannot be changed until the spirit is called again. The celestial spirit imparts no bonuses if the shield is used by anyone other than the sacred shield, but it resumes giving bonuses if the sacred shield resumes using the shield. A sacred shield can use this ability once per day at 5th level, and one additional time per day for every four levels beyond 5th, to a maximum of four times per day at 17th level.</p><p>If a shield with a celestial spirit is destroyed, the sacred shield loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this period, the sacred shield takes a –1 penalty to her armor class and on saving throws.</p>"
                },
                "Improved Bastion": {
                    "name": "Improved Bastion",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 11th level, the radius of a sacred shield's bastion of good ability increases to 20 feet. This ability replaces the paladin's aura of justice.</p>"
                },
                "Perfect Bastion": {
                    "name": "Perfect Bastion",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>At 20th level, a sacred shield and her allies within 20 feet gain regeneration 10 against the target of her bastion of good ability (essentially regeneration that is overcome by any damage not caused by the target). This ability replaces the sacred shield's holy champion ability.</p>"
                },
                "source": {
                    "name": "Ultimate Combat",
                    "date": "2011-09-01"
                }
            },
            "Redeemer": {
                "name": "Redeemer",
                "type": "Archetype",
                "description": "<p>As most half-orcs are outcasts, a half-orc paladin recognizes that often those who are monstrous are not necessarily evil and that sometimes even those who are evil became that way because of circumstances and misfortune. Some half-orc paladins take up these misunderstood creatures as their cause, standing up for the monstrous creatures and, when possible, leading them to the light. These paladins are called redeemers. A redeemer has the following class features.</p>",
                "Merciful Smite": {
                    "name": "Merciful Smite",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 1st level, when a redeemer chooses to smite a creature, she can have all of her attacks against the target deal nonlethal damage. She does not take the normal –4 attack roll penalty for using a lethal weapon to deal nonlethal damage. She cannot use this ability to deal nonlethal damage to outsiders with the evil subtype, evil-aligned dragons, or undead creatures (these creatures take lethal damage from her smite). This otherwise works like and replaces the standard paladin's smite evil.</p>"
                },
                "Monstrous Rapport": {
                    "name": "Monstrous Rapport",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 1st level, redeemers gain a +2 bonus on Diplomacy checks to influence creatures who are commonly considered monstrous. This includes but is not limited to \"monstrous\" races such as goblins and orcs, monstrous humanoids, and other intelligent non-humanoid monsters. This ability replaces detect evil.</p>"
                },
                "Pact of Peace": {
                    "name": "Pact of Peace",
                    "type": "Class Feature",
                    "featureType": "Sp",
                    "description": "<p>At 8th level, a redeemer can force a defeated creature to accept a binding pact of peace as a condition of its surrender, as if using lesser geas. Her caster level for this ability is equal to her paladin level. Rather than assigning a mission or task, the redeemer gives the creature a simple set of prohibitions to protect others. Example geas include \"Leave this city and do not return\" or \"Do not attack caravans.\" The prohibition must be against an area no larger than 300 square miles or one specific group of people (such as a tribe or citizens of a particular city). This ability lasts 1 month per paladin level. This replaces aura of resolve.</p>"
                },
                "Aura of Mercy": {
                    "name": "Aura of Mercy",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, a redeemer can expend two uses of her merciful smite ability to grant the merciful smite ability to all allies within 10 feet, using her bonuses. Allies must use this merciful smite ability by the start of the paladin's next turn and the bonuses last for 1 minute. Using this ability is a free action. Evil creatures gain no benefit from this ability. This replaces aura of justice.</p>"
                },
                "Associates": {
                    "name": "Associates",
                    "type": "Class Feature",
                    "featureType": "",
                    "description": "<p>A redeemer may ally with an evil creature as long as she feels the creature is capable of redemption. A redeemer may accept henchmen, followers, or cohorts who are not lawful good provided they demonstrate they are willing to follow her and seek betterment under her tutelage.</p>"
                },
                "requirements": [
                    {
                        "race": "Half-Orc"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            },
            "Stonelord": {
                "name": "Stonelord",
                "type": "Archetype",
                "description": "<p>A stonelord is a devoted sentinel of dwarven enclaves, drawing the power of the earth and ancient stone to protect her people.</p>",
                "Stonestrike": {
                    "name": "Stonestrike",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>Once per day per paladin level, a stonelord can draw upon the power of the living rock. As a swift action, she treats her melee attacks until the beginning of her next turn (whether armed or unarmed) as magical and adamantine, including ignoring hardness up to twice her paladin level, with a +1 bonus on attack and damage rolls, as well as on combat maneuver checks. This bonus also applies to her CMD if she or her target is touching the ground or a stone structure. This bonus increases by +1 at 5th level and every 5 levels thereafter. This ability replaces smite evil.</p>"
                },
                "Heartstone": {
                    "name": "Heartstone",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 2nd level, a stonelord's flesh becomes progressively rockier. She gains a +1 natural armor bonus to AC and DR/adamantine equal to 1/2 her paladin level. The natural armor bonus increases by +1 at 6th level, and every four levels thereafter, to a maximum of +5 at 18th level. These benefits are halved when not touching the ground or a stone structure. This ability replaces divine grace.</p>"
                },
                "Stoneblood": {
                    "name": "Stoneblood",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 3rd level, a stonelord's vitals begin to calcify and her blood transforms into liquid stone. She adds her paladin level on checks to stabilize at negative hit points and gains a 25% chance to ignore a critical hit or precision damage. This does not stack with fortification armor or similar effects. At 9th level, this chance increases to 50% and she becomes immune to petrification. At 15th level, this chance increases to 75% and she becomes immune to bleed and blood drain effects. This ability replaces divine health and her mercies gained at 3rd, 9th, and 15th level.</p>"
                },
                "Defensive Stance": {
                    "name": "Defensive Stance",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 4th level, a stonelord gains the defensive stance ability, as a stalwart defender (Advanced Player's Guide 277), and may select one defensive power at 8th level and every four levels thereafter. Levels of stalwart defender stack with her paladin levels when determining the total number of rounds that she can maintain her defensive stance per day. A stonelord does not gain any spells or spellcasting abilities, does not have a caster level, and cannot use spell trigger or spell completion magic items.</p>"
                },
                "Earth Channel": {
                    "name": "Earth Channel",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 4th level, a stonelord gains Elemental Channel (earth) as a bonus feat, which she may activate by spending two uses of her lay on hands ability, using her paladin level as her effective cleric level. This ability replaces channel positive energy.</p>"
                },
                "Stone Servant": {
                    "name": "Stone Servant",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 5th level, a stonelord may call a Small earth elemental to her side, as a paladin calls her mount. This earth elemental is Lawful Good in alignment and possesses the celestial template, and it increases in size as the stonelord gains levels, becoming Medium at 8th level, Large at 11th level, Huge at 14th level, Greater at 17th level, and Elder at 20th level. This ability replaces divine bond.</p>"
                },
                "Stonebane": {
                    "name": "Stonebane",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, when using stonestrike, a stonelord's attack gains the bane weapon special ability against creatures with the earth subtype and constructs or objects made of earth or stone. This ability replaces aura of justice.</p>"
                },
                "Phase Strike": {
                    "name": "Phase Strike",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 12th level, a stonelord's stonestrike may pass through stone and metal as if they weren't there. By spending 2 uses of her stonestrike ability, she may ignore any cover less than total cover provided by stone or metal, and she ignores any AC bonus from stone or metal armor or shields as if wielding a brilliant energy weapon. A phase strike cannot damage constructs, objects, or creatures with the earth subtype, but unlike a brilliant energy weapon, it can harm undead. This ability replaces her 12th-level mercy.</p>"
                },
                "Mobile Defense": {
                    "name": "Mobile Defense",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 18th level, a stonelord can make one 5-foot step per round while maintaining her defensive stance. This ability replaces her 18th-level mercy.</p>"
                },
                "Stone Body": {
                    "name": "Stone Body",
                    "type": "Class Feature",
                    "featureType": "Ex",
                    "description": "<p>At 20th level, a stonelord's body transforms into living stone. She no longer needs to eat, drink, breathe, or sleep, and she becomes immune to paralysis, poison, and stunning. She is also no longer subject to critical hits or precision-based damage. This ability replaces holy champion.</p>"
                },
                "requirements": [
                    {
                        "race": "Dwarf"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            },
            "Tranquil Guardian": {
                "name": "Tranquil Guardian",
                "type": "Archetype",
                "description": "<p>A tranquil guardian is a missionary of peace and tranquility, a soothing voice of succor in a violent and dangerous world. A tranquil guardian gains the following class features.</p>",
                "Touch of Serenity": {
                    "name": "Touch of Serenity",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 1st level, a tranquil guardian gains Touch of Serenity as a bonus feat, even if she does not meet the prerequisites. At 6th level, and every six levels thereafter, the duration of a tranquil guardian's Touch of Serenity increases by 1 round. Each round on its turn, the target may attempt a new Will save to end the effect. The duration does not stack; only the longest remaining duration applies. This ability replaces smite evil.</p>"
                },
                "Serene Strike": {
                    "name": "Serene Strike",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 3rd level, when a tranquil guardian confirms a critical hit, she may convert all damage from her attack to nonlethal damage, and when she does, she can activate Touch of Serenity through her weapon or unarmed strike. Using serene strike is a free action. This ability replaces aura of courage.</p>"
                },
                "Divine Bond": {
                    "name": "Divine Bond",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>A tranquil guardian who chooses a weapon as her divine bond may only increase her weapon's enhancement bonus or add the following properties to her weapon: conductive, defending, disruptive, grayflame , or merciful.</p>"
                },
                "Aura of Calm": {
                    "name": "Aura of Calm",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 8th level, a tranquil guardian is immune to all spells and spell-like abilities with the emotion descriptor, as well as all fear effects. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against these effects.</p><p>This ability functions only while the tranquil guardian is conscious, not if she is unconscious or dead. This ability replaces aura of resolve.</p>"
                },
                "Waves of Peace": {
                    "name": "Waves of Peace",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 11th level, a tranquil guardian may expend 2 uses of her Touch of Serenity to affect each opponent within 5 feet of her with that effect. She does not need to touch the creature for the effect to take hold. This ability replaces aura of justice.</p>"
                },
                "Apostle of Peace": {
                    "name": "Apostle of Peace",
                    "type": "Class Feature",
                    "featureType": "Su",
                    "description": "<p>At 20th level, a tranquil guardian's DR increases to 10/evil, and whenever she channels positive energy or uses lay on hands to heal, she heals the maximum possible amount. In addition, any creature struck by her Touch of Serenity, even if it saves, must make an additional Will save (DC 10 + 1/2 her tranquil guardian level + her Charisma modifier) the next time it tries to attack. If it fails this save, the attack (including spells or special abilities) automatically fails. This ability replaces holy champion.</p>"
                },
                "requirements": [
                    {
                        "race": "Aasimar"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            }
        },
        "source": {
            "name": "Core Rulebook",
            "date": "2009-08-01"
        }
    }
}
