{
    "Rogue": {
        "name": "Rogue",
        "type": "Class",
        "summary": "<p>The rogue is a thief and a scout, an opportunist capable of delivering brutal strikes against unwary foes.</p>",
        "description": "<p>Life is an endless adventure for those who live by their wits. Ever just one step ahead of danger, rogues bank on their cunning, skill, and charm to bend fate to their favor. Never knowing what to expect, they prepare for everything, becoming masters of a wide variety of skills, training themselves to be adept manipulators, agile acrobats, shadowy stalkers, or masters of any of dozens of other professions or talents. Thieves and gamblers, fast talkers and diplomats, bandits and bounty hunters, and explorers and investigators all might be considered rogues, as well as countless other professions that rely upon wits, prowess, or luck. Although many rogues favor cities and the innumerable opportunities of civilization, some embrace lives on the road, journeying far, meeting exotic people, and facing fantastic danger in pursuit of equally fantastic riches. In the end, any who desire to shape their fates and live life on their own terms might come to be called rogues.</p>"
        "hitDie": "8",
        "classSkills": [
            "Acrobatics", "Appraise", "Bluff", "Climb", "Craft", "Diplomacy", "Disable Device", "Disguise", "Escape Artist", "Intimidate", "Knowledge (dungeoneering)", "Knowledge (local)", "Linguistics", "Perception", "Perform", "Profession", "Sense Motive", "Sleight of Hand", "Stealth", "Swim", "Use Magic Device"
        ],
        "skillsPerLevel": "8",
        "progression": {
            "BAB": [
                "0", "1", "2", "3", "3", "4", "5", "6", "6", "7", "8", "9", "9", "10", "11", "12", "12", "13", "14", "15"
            ],
            "Fortitude": [
                "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
            ],
            "Reflex": [
                "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
            ],
            "Will": [
                "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
            ]
        },
        "Class Features": {
            "Weapon and Armor Proficiency": {
                "name": "Weapon and Armor Proficiency",
                "type": "Class Feature",
                "description": "<p>Rogues are proficient with all simple weapons, plus the hand crossbow, rapier, sap, shortbow, and short sword. They are proficient with light armor, but not with shields.</p>"
            },
            "Sneak Attack": {
                "name": "Sneak Attack",
                "type": "Class Feature",
                "description": "<p>If a rogue can catch an opponent when he is unable to defend himself effectively from her attack, she can strike a vital spot for extra damage.The rogue's attack deals extra damage anytime her target would be denied a Dexterity bonus to AC (whether the target actually has a Dexterity bonus or not), or when the rogue flanks her target. This extra damage is 1d6 at 1st level, and increases by 1d6 every two rogue levels thereafter. Should the rogue score a critical hit with a sneak attack, this extra damage is not multiplied. Ranged attacks can count as sneak attacks only if the target is within 30 feet.<p></p>With a weapon that deals nonlethal damage (like a sap, whip, or an unarmed strike), a rogue can make a sneak attack that deals nonlethal damage instead of lethal damage. She cannot use a weapon that deals lethal damage to deal nonlethal damage in a sneak attack, not even with the usual –4 penalty.<p></p>The rogue must be able to see the target well enough to pick out a vital spot and must be able to reach such a spot. A rogue cannot sneak attack while striking a creature with concealment.</p>"
            },
            "Trapfinding": {
                "name": "Trapfinding",
                "type": "Class Feature",
                "description": "<p>A rogue adds 1/2 her level to Perception skill checks made to locate traps and to Disable Device skill checks (minimum +1). A rogue can use Disable Device to disarm magic traps.</p>"
            },
            "Evasion": {
                "name": "Evasion",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 2nd level and higher, a rogue can avoid even magical and unusual attacks with great agility. If she makes a successful Reflex saving throw against an attack that normally deals half damage on a successful save, she instead takes no damage. Evasion can be used only if the rogue is wearing light armor or no armor. A helpless rogue does not gain the benefit of evasion.</p>"
            },
            "Rogue Talents": {
                "name": "Rogue Talents",
                "type": "Class Feature",
                "description": "<p>As a rogue gains experience, she learns a number of talents that aid her and confound her foes. Starting at 2nd level, a rogue gains one rogue talent. She gains an additional rogue talent for every 2 levels of rogue attained after 2nd level. A rogue cannot select an individual talent more than once.<p></p>Talents marked with an asterisk add effects to a rogue's sneak attack. Only one of these talents can be applied to an individual attack and the decision must be made before the attack roll is made.</p>",
                "Bleeding Attack": {
                    "name": "Bleeding Attack",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A rogue with this ability can cause living opponents to bleed by hitting them with a sneak attack. This attack causes the target to take 1 additional point of damage each round for each die of the rogue's sneak attack (e.g., 4d6 equals 4 points of bleed). Bleeding creatures take that amount of damage every round at the start of each of their turns. The bleeding can be stopped by a DC 15 Heal check or the application of any effect that heals hit point damage. Bleeding damage from this ability does not stack with itself. Bleeding damage bypasses any damage reduction the creature might possess.</p>"
                },
                "Combat Trick": {
                    "name": "Combat Trick",
                    "type": "Rogue Talent",
                    "description": "<p>A rogue that selects this talent gains a bonus combat feat (see Feats).</p>"
                },
                "Fast Stealth": {
                    "name": "Fast Stealth",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>This ability allows a rogue to move at full speed using the Stealth skill without penalty.</p>"
                },
                "Finesse Rogue": {
                    "name": "Finesse Rogue",
                    "type": "Rogue Talent",
                    "description": "<p>A rogue that selects this talent gains Weapon Finesse as a bonus feat.</p>"
                },
                "Ledge Walker": {
                    "name": "Ledge Walker",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>This ability allows a rogue to move along narrow surfaces at full speed using the Acrobatics skill without penalty. In addition, a rogue with this talent is not flat-footed when using Acrobatics to move along narrow surfaces.</p>"
                },
                "Major Magic": {
                    "name": "Major Magic",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Spell-like",
                    "description": "<p>A rogue with this talent gains the ability to cast a 1st-level spell from the sorcerer/wizard spell list two times a day as a spell-like ability. The caster level for this ability is equal to the rogue's level. The save DC for this spell is 11 + the rogue's Intelligence modifier. The rogue must have an Intelligence of at least 11 to select this talent. A rogue must have the minor magic rogue talent before choosing this talent.</p>"
                },
                "Minor Magic": {
                    "name": "Minor Magic",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Spell-like",
                    "description": "<p>A rogue with this talent gains the ability to cast a 0-level spell from the sorcerer/wizard spell list. This spell can be cast three times a day as a spell-like ability. The caster level for this ability is equal to the rogue's level. The save DC for this spell is 10 + the rogue's Intelligence modifier. The rogue must have an Intelligence of at least 10 to select this talent.</p>"
                },
                "Quick Disable": {
                    "name": "Quick Disable",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>It takes a rogue with this ability half the normal amount of time to disable a trap using the Disable Device skill (minimum 1 round).</p>"
                },
                "Resiliency": {
                    "name": "Resiliency",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per day, a rogue with this ability can gain a number of temporary hit points equal to the rogue's level. Activating this ability is an immediate action that can only be performed when she is brought to below 0 hit points. This ability can be used to prevent her from dying. These temporary hit points last for 1 minute. If the rogue's hit points drop below 0 due to the loss of these temporary hit points, she falls unconscious and is dying as normal.</p>"
                },
                "Rogue Crawl": {
                    "name": "Rogue Crawl",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>While prone, a rogue with this ability can move at half speed. This movement provokes attacks of opportunity as normal. A rogue with this talent can take a 5-foot step while crawling.</p>"
                },
                "Slow Reactions": {
                    "name": "Slow Reactions",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Opponents damaged by the rogue's sneak attack can't make attacks of opportunity for 1 round.</p>"
                },
                "Stand Up": {
                    "name": "Stand Up",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A rogue with this ability can stand up from a prone position as a free action. This still provokes attacks of opportunity for standing up while threatened by a foe.</p>"
                },
                "Surprise Attack": {
                    "name": "Surprise Attack",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>During the surprise round, opponents are always considered flat-footed to a rogue with this ability, even if they have already acted.</p>"
                },
                "Trap Spotter": {
                    "name": "Trap Spotter",
                    "type": "Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Whenever a rogue with this talent comes within 10 feet of a trap, she receives an immediate Perception skill check to notice the trap. This check should be made in secret by the GM.</p>"
                },
                "Weapon Training": {
                    "name": "Weapon Training",
                    "type": "Rogue Talent",
                    "description": "<p>A rogue that selects this talent gains Weapon Focus as a bonus feat.</p>"
                },
                "Assault Leader": {"name": "Assault Leader", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, when the rogue misses with an attack on a flanked opponent, she can designate a single ally who is also flanking the target that her attack missed. That ally can make a single melee attack against the opponent as an immediate action.</p>"},
                "Befuddling Strike": {"name": "Befuddling Strike", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When the rogue deals sneak attack damage against an opponent, that opponent takes a –2 penalty on attack rolls against the rogue for 1d4 rounds.</p>"},
                "Camouflage": {"name": "Camouflage", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, a rogue with this talent can craft simple but effective camouflage from the surrounding foliage. The rogue needs 1 minute to prepare the camouflage, but once she does, it is good for the rest of the day or until the rogue fails a saving throw against an area effect spell that deals fire, cold, or acid damage, whichever comes first. The rogue gains a +4 bonus on Stealth checks while within terrain that matches the foliage used to make the camouflage. This ability cannot be used in areas without natural foliage.</p>"},
                "Canny Observer": {"name": "Canny Observer", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent makes a Perception check to hear the details of a conversation or to find concealed or secret objects (including doors and traps), she gains a +4 bonus.</p>"},
                "Charmer": {"name": "Charmer", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, the rogue can roll two dice while making a Diplomacy check, and take the better result. She must choose to use this talent before making the Diplomacy check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"},
                "Coax Information": {"name": "Coax Information", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can use Bluff or Diplomacy in place of Intimidate to force an opponent to act friendly toward her.</p>"},
                "Combat Swipe": {"name": "Combat Swipe", "type": "Rogue Talent",  "description": "<p>A rogue who selects this talent gains Improved Steal as a bonus feat.</p>"},
                "Cunning Trigger": {"name": "Cunning Trigger", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can use a swift action to set off any trap within 30 feet that she constructed.</p>"},
                "Distracting Attack": {"name": "Distracting Attack", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can make sneak attacks with subtle flourishes that disorient and distract her enemy. When she hits a creature with a melee attack that deals sneak attack damage, she can forgo the additional damage to cause the creature to become flat-footed against one target of her choosing until the beginning of her next turn. The rogue cannot designate herself as the creature gaining the benefit of this talent. Creatures with uncanny dodge are immune to distracting attack.</p>"},
                "Expert Leaper": {"name": "Expert Leaper", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When making jump checks, the rogue is always considered to have a running start. Also, when the rogue deliberately falls, a DC 15 Acrobatics check allows her to ignore the first 20 feet fallen, instead of the first 10 feet.</p>"},
                "Fast Fingers": {"name": "Fast Fingers", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, a rogue with this talent can roll two dice while making a Sleight of Hand check and take the better result. She must choose to use this talent before making the Sleight of Hand check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"},
                "Fast Getaway": {"name": "Fast Getaway", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>After successfully making a sneak attack or Sleight of Hand check, a rogue with this talent can spend a move action to take the withdraw action. She can move no more than her speed during this movement.</p>"},
                "Fast Picks": {"name": "Fast Picks", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can use the Disable Device skill to attempt to open a lock as a standard action instead of a full-round action.</p>"},
                "Follow Clues": {"name": "Follow Clues", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can use Perception to follow tracks as per the Survival skill.</p>"},
                "Guileful Polyglot": {"name": "Guileful Polyglot", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent who has at least one rank in Linguistics gains four additional languages. A rogue with this talent who does not have any ranks in Linguistics gains two additional languages. If the rogue later gains ranks in Linguistics, she gains two additional languages, to a total of four additional languages above those granted by the Linguistics skill itself.</p>"},
                "Hard to Fool": {"name": "Hard to Fool", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, a rogue with this talent can roll two dice while making a Sense Motive check, and take the better result. She must choose to use this talent before making the Sense Motive check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"},
                "Honeyed Words": {"name": "Honeyed Words", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, the rogue can roll two dice while making a Bluff check, and take the better result. She must choose to use this talent before making the Bluff check. A rogue can use this ability one additional time per day for every five rogue levels she possesses.</p>"},
                "Lasting Poison": {"name": "Lasting Poison", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can apply poison to a weapon in such a way that it is effective for two successful attacks instead of one. The poison has a reduced effect, however, and saves made against the poison receive a +2 circumstance bonus. Applying poison in this way requires a full-round action, or a standard action if the rogue has the swift poison talent.</p>"},
                "Nimble Climber": {"name": "Nimble Climber", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent fails a Climb check by 5 or more, she can immediately make another Climb check at the surface's base DC +10. If successful, she stops her fall by clinging onto the surface. The rogue does not take falling damage when she stops her fall in this manner.</p>"},
                "Offensive Defense": {"name": "Offensive Defense", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent hits a creature with a melee attack that deals sneak attack damage, the rogue gains a +1 dodge bonus to AC for each sneak attack die rolled for 1 round.</p>"},
                "Peerless Maneuver": {"name": "Peerless Maneuver", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, a rogue with this talent can roll two dice while making an Acrobatics check, and take the better result. She must choose to use this talent before making the Acrobatics check. A rogue can use this ability one additional time per day for every 5 rogue levels she possesses.</p>"},
                "Positioning Attack": {"name": "Positioning Attack", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, when a rogue with this talent hits a creature with a melee attack, she can move up to 30 feet without provoking attacks of opportunity. The movement must end in a space adjacent to the creature hit with the melee attack.</p>"},
                "Powerful Sneak": {"name": "Powerful Sneak", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Whenever a rogue with this talent takes a full attack action, she can elect to take a –2 penalty on all attack rolls until the start of her next turn. If an attack during this time is a sneak attack, she treats all 1s on the sneak attack damage dice as 2s.</p>"},
                "Quick Disguise": {"name": "Quick Disguise", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can use the items at hand and seemingly innocuous material hidden on her person to create startlingly effective disguises, reducing the amount of time it takes to create a disguise using the Disguise skill.</p><p>The time needed for the rogue to alter her appearance in this manner is based on the complexity of the disguise, as noted on the following table. The times are cumulative, so if a female rogue wants to disguise herself as a male of a different race, that takes 2 minutes.</p><table><tr><th>Disguise</th><th>Time</th></tr><tr><td>Minor details only</td><td>1 full-round action<td></tr><tr><td>Disguise as a different gender</td><td>1 minute<td></tr><tr><td>Disguise as a different race</td><td>1 minute<td></tr><tr><td>Disguise as a different age category</td><td>1 minute<td></tr><tr><td>Disguise as a different size category</td><td>1 minute<td></tr></table>"},
                "Quick Trapsmith": {"name": "Quick Trapsmith", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>As a full-round action, a rogue with this talent can set a simple trap with a CR no greater than 1/2 her rogue level. To do this, she must purchase the components, spend the required time constructing the trap in advance, and have its components at hand. The type of trap that can be constructed in this way is subject to GM discretion.</p>"},
                "Snap Shot": {"name": "Snap Shot", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent may treat her intitiative roll as a 20 for a surprise round, regardless of her initiative, but she may only take an attack action with a ranged weapon. Her normal initiative roll is used in subsequent rounds. If two or more rogues possess this talent, their initiative determines the order in which they act, but they all go before any other creature. If a rogue is prevented from acting in the surprise round, this talent has no effect.</p>"},
                "Sniper's Eye": {"name": "Sniper's Eye", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can apply her sneak attack damage on ranged attacks targeting foes within 30 feet that benefit from concealment. Foes with total concealment are still immune.</p>"},
                "Strong Impression": {"name": "Strong Impression", "type": "Rogue Talent",  "description": "<p>A rogue who selects this talent gains Intimidating Prowess as a bonus feat.</p>"},
                "Survivalist": {"name": "Survivalist", "type": "Rogue Talent",  "description": "<p>A rogue with this talent adds Heal and Survival to her list of class skills.</p>"},
                "Swift Poison": {"name": "Swift Poison", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can apply poison to a weapon as a move action, instead of a standard action.</p>"},
                "Black Market Connections": {"name": "Black Market Connections", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains better access to magic items from black market connections. She treats every settlement as one size greater for the purpose of determining the gp limit of the base value of items for sale, as well as the number of minor, medium, and major magic items for sale in the settlement. If the settlement is already a metropolis, all minor and medium magic items are for sale, as well as 3d8 major magic items. With a successful Diplomacy check, the rogue can treat the settlement as two sizes larger. If the settlement is already a metropolis and she succeeds at the check, all magic items are for sale. If the settlement is already a large city and she succeeds at the check, all minor and medium magic items are for sale, as well as 3d8 major magic items. With a successful check, the rogue can also sell stolen items on the black market. If the check fails by 5 or more, the rogue does something to spook the market, and treats the city as normal for 1 week. Furthermore, those in control of the black market may alert the authorities to the rogue's presence in an act of reprisal for spooking the market or to divert attention away from their illicit activities. The DCs of the checks are by settlement size and are given in the table below.</p><table><th><td>Community Size</td><td>DC</td></tr><tr><td>Thorp</td><td>10</td></tr>Hamlet</td><td>12</td></tr>Village</td><td>15</td></tr>Small town</td><td>18</td></tr>Large town</td><td>20</td></tr>Small city</td><td>25</td></tr>Large city</td><td>30</td></tr>Metropolis</td><td>35</td></tr></table>"},
                "Convincing Lie": {"name": "Convincing Lie", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent lies, she creates fabrications so convincing that others treat them as truth. When a rogue with this talent successfully uses the Bluff skill to convince someone that what she is saying is true, if that individual is questioned later about the statement or story, that person uses the rogue's Bluff skill modifier to convince the questioner, rather than his own. If his Bluff skill modifier is better than the rogue's, the individual can use his own modifier and gain a +2 bonus on any check to convince others of the lie. This effect lasts for a number of days equal to 1/2 the rogue's level + the rogue's Charisma modifier.</p>"},
                "Deft Palm": {"name": "Deft Palm", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can make a Sleight of Hand check to conceal a weapon while holding it in plain sight, even while she is being observed.</p>"},
                "Esoteric Scholar": {"name": "Esoteric Scholar", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once a day, a rogue with this talent may attempt a Knowledge check, even when she is not trained in that Knowledge skill.</p>"},
                "Firearm Training": {"name": "Firearm Training", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains Exotic Weapon Proficiency (firearms).</p>"},
                "Getaway Artist": {"name": "Getaway Artist", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent adds Fly, Handle Animal, and Ride to her list of class skills, and gains a +2 bonus on all driving checks.</p>"},
                "Grit": {"name": "Grit", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains the Amateur Gunslinger feat and one grit feat of her choice. She must fulfill the prerequisites of the grit feat in order to choose it. A rogue must have the firearm training talent before choosing this one.</p>"},
                "Hold Breath": {"name": "Hold Breath", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent increases the number of rounds she can hold her breath by 2. She can take this talent multiple times.</p>"},
                "Iron Guts": {"name": "Iron Guts", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent has a cast-iron stomach or has trained herself to withstand poisons, especially ingested ones. She gains a +1 bonus on all saves against ingested poisons as well as a +4 bonus on saves against all spells and effects that cause the rogue to be nauseated or sickened.</p>"},
                "Ki Pool": {"name": "Ki Pool", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains a small ki pool. This ki pool is similar to a ninja's ki pool, but the rogue's ki pool does not grant any extra attacks. The rogue gains a number of ki points equal to her Wisdom modifier (minimum 1). These ki points replenish at the start of each day. If she already has a ki pool, or gains a ki pool later, she gains half her Wisdom bonus (minimum 1) as bonus ki points to her ki pool. She can spend a ki point to gain a +10-foot bonus to movement until the end of her turn.</p>"},
                "Ninja Trick": {"name": "Ninja Trick", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can choose a trick from the ninja trick list. The rogue can choose but cannot use talents that require ki points, unless she has a ki pool. A rogue can pick this talent more than once. The ninja cannot choose a ninja trick with the same name as a rogue talent.</p>"},
                "Rope Master": {"name": "Rope Master", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this ability can move at her normal speed when using rope on a Climb check, can take 10 when using Acrobatics to move over narrow surfaces even when in danger or distracted, and gains a +4 bonus when determining the DC to escape bonds when she ties up a creature.</p>"},
                "Strong Stroke": {"name": "Strong Stroke", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent rolls twice when making Swim checks and takes the better result. If she already rolls twice while making a Swim check because of another ability or effect, she gains a +2 insight bonus on both of those rolls instead. If the rogue is under the effect of a spell or ability that forces her to roll two dice and take the worse result, she only needs to roll 1d20 while making Swim checks.</p>"},
                "Terrain Mastery": {"name": "Terrain Mastery", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains a favored terrain as the ranger ability of the same name, though the favored terrain ability does not increase with her level as the ranger's ability does. A rogue can take this ability multiple times, each time applying it to a new terrain, and granting all other favored terrains a +2 increase to the favored terrain bonus.</p>"},
                "Underhanded": {"name": "Underhanded", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains a +4 circumstance bonus on all Sleight of Hand checks made to conceal a weapon. Furthermore, if she makes a sneak attack during the surprise round using a concealed weapon that her opponent didn't know about, she does not have to roll sneak attack damage, and the sneak attack deals maximum damage. A rogue can only use the underhanded talent a number of times per day equal to her Charisma modifier (minimum 0).</p>"},
                "Wall Scramble": {"name": "Wall Scramble", "type": "Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent rolls twice when making Climb checks and takes the better of the two rolls. If she already rolls twice while making a Climb check because of another ability or effect, she gains a +2 insight bonus on both of those rolls instead. If the rogue is under the effect of a spell or ability that forces her to roll two dice and take the worse result, she only needs to roll 1d20 while making Climb checks.</p>"}
            },
            "Trap Sense": {
                "name": "Trap Sense",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>At 3rd level, a rogue gains an intuitive sense that alerts her to danger from traps, giving her a +1 bonus on Reflex saves made to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses rise to +2 when the rogue reaches 6th level, to +3 when she reaches 9th level, to +4 when she reaches 12th level, to +5 at 15th, and to +6 at 18th level.<p></p>Trap sense bonuses gained from multiple classes stack.</p>"
            },
            "Uncanny Dodge": {
                "name": "Uncanny Dodge",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>Starting at 4th level, a rogue can react to danger before her senses would normally allow her to do so. She cannot be caught flat-footed, nor does she lose her Dex bonus to AC if the attacker is invisible. She still loses her Dexterity bonus to AC if immobilized. A rogue with this ability can still lose her Dexterity bonus to AC if an opponent successfully uses the feint action (see Combat) against her.<p></p>If a rogue already has uncanny dodge from a different class, she automatically gains improved uncanny dodge (see below) instead.</p>"
            },
            "Improved Uncanny Dodge": {
                "name": "Improved Uncanny Dodge",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>A rogue of 8th level or higher can no longer be flanked.<p></p>This defense denies another rogue the ability to sneak attack the character by flanking her, unless the attacker has at least four more rogue levels than the target does.<p></p>If a character already has uncanny dodge (see above) from another class, the levels from the classes that grant uncanny dodge stack to determine the minimum rogue level required to flank the character.</p>"
            },
            "Advanced Talents": {
                "name": "Advanced Talents",
                "type": "Class Feature",
                "description": "<p>At 10th level, and every two levels thereafter, a rogue can choose one of the following advanced talents in place of a rogue talent.</p>",
                "Crippling Strike": {
                    "name": "Crippling Strike",
                    "type": "Advanced Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>A rogue with this ability can sneak attack opponents with such precision that her blows weaken and hamper them. An opponent damaged by one of her sneak attacks also takes 2 points of Strength damage.</p>"
                },
                "Defensive Roll": {
                    "name": "Defensive Roll",
                    "type": "Advanced Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>With this advanced talent, the rogue can roll with a potentially lethal blow to take less damage from it than she otherwise would. Once per day, when she would be reduced to 0 or fewer hit points by damage in combat (from a weapon or other blow, not a spell or special ability), the rogue can attempt to roll with the damage. To use this ability, the rogue must attempt a Reflex saving throw (DC = damage dealt). If the save succeeds, she takes only half damage from the blow; if it fails, she takes full damage. She must be aware of the attack and able to react to it in order to execute her defensive roll—if she is denied her Dexterity bonus to AC, she can't use this ability. Since this effect would not normally allow a character to make a Reflex save for half damage, the rogue's evasion ability does not apply to the defensive roll.</p>"
                },
                "Dispelling Attack": {
                    "name": "Dispelling Attack",
                    "type": "Advanced Rogue Talent",
                    "specialAbilityType": "Supernatural",
                    "description": "<p>Opponents that are dealt sneak attack damage by a rogue with this ability are affected by a targeted dispel magic, targeting the lowest-level spell effect active on the target. The caster level for this ability is equal to the rogue's level. A rogue must have the major magic rogue talent before choosing dispelling attack.</p>"
                },
                "Improved Evasion": {
                    "name": "Improved Evasion",
                    "type": "Advanced Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>This works like evasion, except that while the rogue still takes no damage on a successful Reflex saving throw against attacks, she henceforth takes only half damage on a failed save. A helpless rogue does not gain the benefit of improved evasion.</p>"
                },
                "Opportunist": {
                    "name": "Opportunist",
                    "type": "Advanced Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>Once per round, the rogue can make an attack of opportunity against an opponent who has just been struck for damage in melee by another character. This attack counts as an attack of opportunity for that round. Even a rogue with the Combat Reflexes feat can't use the opportunist ability more than once per round.</p>"
                },
                "Skill Mastery": {
                    "name": "Skill Mastery",
                    "type": "Advanced Rogue Talent",
                    "description": "<p>The rogue becomes so confident in the use of certain skills that she can use them reliably even under adverse conditions.<p></p>Upon gaining this ability, she selects a number of skills equal to 3 + her Intelligence modifier. When making a skill check with one of these skills, she may take 10 even if stress and distractions would normally prevent her from doing so. A rogue may gain this special ability multiple times, selecting additional skills for skill mastery to apply to each time.</p>"
                },
                "Slippery Mind": {
                    "name": "Slippery Mind",
                    "type": "Advanced Rogue Talent",
                    "specialAbilityType": "Extraordinary",
                    "description": "<p>This ability represents the rogue's ability to wriggle free from magical effects that would otherwise control or compel her. If a rogue with slippery mind is affected by an enchantment spell or effect and fails her saving throw, she can attempt it again 1 round later at the same DC. She gets only this one extra chance to succeed on her saving throw.</p>"
                },
                "Feat": {
                    "name": "Feat",
                    "type": "Advanced Rogue Talent",
                    "description": "<p>A rogue may gain any feat that she qualifies for in place of a rogue talent.</p>"
                },
                "Another Day": {"name": "Another Day", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, when the rogue would be reduced to 0 or fewer hit points by a melee attack, she can take a 5-foot step as an immediate action. If the movement takes her out of the reach of the attack, she takes no damage from the attack. The rogue is staggered for 1 round on her next turn.</p>"},
                "Deadly Cocktail": {"name": "Deadly Cocktail", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can apply two doses of poison to a weapon at once. These can be separate poisons, in which case they both affect the target individually, or two doses of the same toxin, in which case the poisons' frequency is extended by 50% and the save DC increases by +2. This talent is an exception to the rule that injury poisons can only be delivered one dose at a time.</p>"},
                "Deadly Sneak": {"name": "Deadly Sneak", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Whenever a rogue with this talent uses the powerful sneak rogue talent, she treats all 1s and 2s on the sneak attack damage dice as 3s. A rogue must have the powerful sneak rogue talent before choosing this talent.</p>"},
                "Entanglement of Blades": {"name": "Entanglement of Blades", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent hits a creature with a melee attack that deals sneak attack damage, the target cannot take a 5-foot step until the beginning of the rogue's next turn.</p>"},
                "Fast Tumble": {"name": "Fast Tumble", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent uses Acrobatics to move at full speed through a threatened square without provoking an attack of opportunity, the DC of the Acrobatics check does not increase by 10.</p>"},
                "Frugal Trapsmith": {"name": "Frugal Trapsmith", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent constructs a mechanical trap, she only pays 75% of the normal cost.</p>"},
                "Hunter's Surprise": {"name": "Hunter's Surprise", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, a rogue with this talent can designate a single enemy she is adjacent to as her prey. Until the end of her next turn, she can add her sneak attack damage to all attacks made against her prey, even if she is not flanking it or it is not flat-footed.</p>"},
                "Knock-Out Blow": {"name": "Knock-Out Blow", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, the rogue can forgo her sneak attack damage to attempt to knock out an opponent. She must declare the use of knock-out blow before she makes the attack. If the attack hits, it does normal damage, but instead of dealing sneak attack damage (and instead of any effect that triggers when the rogue deals sneak attack damage), the target falls unconscious for 1d4 rounds. A successful Fortitude save reduces this effect to staggered for 1 round. The DC of this save is equal to 10 + 1/2 the rogue's level + the rogue's Intelligence modifier.</p>"},
                "Master of Disguise": {"name": "Master of Disguise", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, a rogue with this talent gains a +10 bonus on a single Disguise check.</p>"},
                "Redirect Attack": {"name": "Redirect Attack", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, when a rogue with this talent is hit with a melee attack, she can redirect the attack to strike at an adjacent creature with a free action. The creature targeted must be within melee reach of the attack that hit the rogue, and the creature that made the attack against the rogue must make a new attack roll against the new target.</p>"},
                "Stealthy Sniper": {"name": "Stealthy Sniper", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent uses the Stealth skill to snipe, she only suffers a –10 penalty on the Stealth check, instead of –20.</p>"},
                "Thoughtful Reexamining": {"name": "Thoughtful Reexamining", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>Once per day, a rogue with this talent can reroll a Knowledge, Sense Motive, or Perception skill check to try to gain new or better information from the roll. This reroll can be made any time during the same day as the original check.</p>"},
                "Confounding Blades": {"name": "Confounding Blades", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>When a rogue with this talent hits a creature with a melee weapon that deals sneak attack damage, her target cannot make attacks of opportunity for 1d4+1 rounds. The rogue must have the slow reaction rogue talent before she can choose this talent.</p>"},
                "Familiar": {"name": "Familiar", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains a familiar as the familiar option of the wizard's arcane bond class feature. This ability functions exactly like that part of the class feature, but the rogue's effective wizard level is her rogue level –4. The rogue must have the minor magic and major magic talents before she can choose this trick.</p>"},
                "Getaway Master": {"name": "Getaway Master", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent gains a +10 bonus on all drive checks. The rogue must have the getaway artist rogue talent before choosing this talent.</p>"},
                "Hard Minded": {"name": "Hard Minded", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent is hard to fool with mind-affecting effects. At the start of her turn, if she is still subject to any mind-affecting spells or effects, she can make a Will saving throw with a standard DC for the effect's level, and if she succeeds at the check, she is no longer subject to the mind-affecting effect. She can make this saving throw even against mind-affecting effects that normally don't allow a saving throw. In those cases, generate the saving throw as if the spell or effect did allow a saving throw.</p>"},
                "Hide in Plain Sight": {"name": "Hide in Plain Sight", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can select a single terrain from the ranger's favored terrain list. She is a master at hiding in that terrain, and while within that terrain, she can use the Stealth skill to hide, even while being observed. A rogue may take this advanced talent more than once, each time selecting a different terrain from the favored terrain list.</p>"},
                "Rumormonger": {"name": "Rumormonger", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can attempt to spread a rumor though a small town or larger settlement by making a Bluff check. She can do so a number of times per week equal to her Charisma modifier (minimum 0). The DC is based on the size of the settlement, and it takes a week for the rumor to propagate through the settlement. If the check succeeds, the rumor is practically accepted as fact within the community; succeeding by 5 or more over the DC decreases the time it takes the rumor to propagate by 1d4 days. A failed check means the rumor failed to gain traction, while failing by 5 or more causes the opposite of the rumor or some other competing theory involving the rumor's subject to take hold.</p><table><th><tr>Community Size</td><td>DC</td</tr><tr><td>Small town</td><td>18</td><tr><tr><td>Large town</td><td>20</td><tr><tr><td>Small city</td><td>25</td><tr><tr><td>Large city</td><td>30</td><tr><tr><td>Metropolis</td><td>35</td><tr></table>"},
                "Unwitting Ally": {"name": "Unwitting Ally", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can spend a swift action to attempt to make an opponent act like an ally for purposes of providing a flank until the beginning of the rogue's next turn. The opponent must be able to hear and see the rogue, and the rogue must succeed at a Bluff check opposed by the opponent's Sense Motive. If the check succeeds, the opponent acts as an ally for the purpose of providing a flank. Whether or not the check succeeds, the rogue cannot use this trick again on the same opponent for the next 24 hours. If the rogue fails the check by 5 or more, she cannot use the unwitting ally ability on any opponent within line of sight of the failed attempt for 24 hours.</p>"},
                "Weapon Snatcher": {"name": "Weapon Snatcher", "type": "Advanced Rogue Talent", "specialAbilityType": "Extraordinary", "description": "<p>A rogue with this talent can make a Sleight of Hand check in place of a combat maneuver check when attempting to disarm an opponent.</p>"}
            },
            "Master Strike": {
                "name": "Master Strike",
                "type": "Class Feature",
                "specialAbilityType": "Extraordinary",
                "description": "<p>Upon reaching 20th level, a rogue becomes incredibly deadly when dealing sneak attack damage. Each time the rogue deals sneak attack damage, she can choose one of the following three effects: the target can be put to sleep for 1d4 hours, paralyzed for 2d6 rounds, or slain. Regardless of the effect chosen, the target receives a Fortitude save to negate the additional effect. The DC of this save is equal to 10 + 1/2 the rogue's level + the rogue's Intelligence modifier. Once a creature has been the target of a master strike, regardless of whether or not the save is made, that creature is immune to that rogue's master strike for 24 hours. Creatures that are immune to sneak attack damage are also immune to this ability.</p>"
            }
        },
        "Acrobat": {
            "name": "Acrobat",
            "type": "Archetype",
            "description": "<p>Agility and daring are both excellent rogue traits, and their confluence can create spectacular feats of acrobatics. Whether they are daring thieves, infiltrating assassins, or intrepid spies, proper training in acrobatics is a valuable boon for rogues.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the acrobat archetype: expert leaper, ledge walker*, nimble climber, peerless maneuver, rogue crawl*, and stand up*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the acrobat archetype: defensive roll*, fast getaway, fast tumble, and improved evasion*.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Burglar": {
            "name": "Burglar",
            "type": "Archetype",
            "description": "<p>Adept at infiltration, trap removal, and lock picking, burglars prey on the homes of the wealthy and forgotten tombs alike. Such riches are guarded with vicious traps and hazards, but the devious mind of the burglar allows her to find such dangers and avoid them.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the burglar archetype: fast picks, fast stealth*, nimble climber, quick disable*, and trap spotter*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the burglar archetype: knock-out blow, skill mastery*, and thoughtful reexamining.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Cutpurse": {
            "name": "Cutpurse",
            "type": "Archetype",
            "description": "<p>Everyone who lives in the city understands that a wealthy man stays wealthy by guarding his purse while wandering the streets and markets. Cutpurses are often trained by guilds to collect the guild's tax from local businesses on a daily basis, whether through intimidation or pickpocketing. Some find themselves taking up the mantle of adventurer, and their talents are generally appreciated in this role, but the cutpurse is still the first person her companions look to when an item goes missing.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the cutpurse archetype: combat swipe, fast fingers, fast getaway, hard to fool, minor magic*, slow reactions*, and surprise attack*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the cutpurse archetype: crippling strike*, fast tumble, and skill mastery*.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Investigator": {
            "name": "Investigator",
            "type": "Archetype",
            "description": "<p>Not all rogues work against the law. Investigators use their skills to serve the law, often in the employ of nobles or in the pursuit of noble causes. In some cities cabals of investigators work for rulers or bureaucracies, but often an investigator is a free agent who pursues whatever mysteries come across her path. Of course, not all investigators serve the law. Crime lords and guildmasters often have squads of investigators serving their own nefarious purposes.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the investigator archetype: coax information, fast picks, follow clues, hard to fool, and minor magic*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the investigator archetype: hunter's surprise, slippery mind*, and thought reexamining.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Poisoner": {
            "name": "Poisoner",
            "type": "Archetype",
            "description": "<p>Some consider poisoning an evil act. The poisoner knows poison is just a tool toward an end, and is no different than any other weapon. Some poisoners see themselves as great equalizers, as they are able to craft weapons that the weakest of creatures can wield to devastating effect, but most have no lofty delusions about their work.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the poisoner archetype: distracting attack, lasting poison, surprise attack*, swift poison, and weapon training*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the poisoner archetype: deadly cocktail, hunter's surprise, and opportunist*.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Rake": {
            "name": "Rake",
            "type": "Archetype",
            "description": "<p>The rake is a rogue who is open about her skills and talents, often to the point of being boastful. Usually she has the protection of an important figure who finds her services useful, but sometimes her bravado is enough to keep enemies away. She is often used as a face for the group for diplomacy, gathering information, negotiations, or to gain the most lucrative contracts and quests from local authorities.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the rake archetype: befuddling strike, charmer, honeyed words, and surprise attack*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the rake archetype: another day, redirect attack, and skill mastery*.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Scout": {
            "name": "Scout",
            "type": "Archetype",
            "description": "<p>Not all rogues live in the city. Scouts frequently roam the wilderness, often banding together as bandits, but sometimes serving as guides, as trailblazers, or as companions to a ranger or barbarian warrior. More comfortable with sneaking and hiding outdoors, the scout is still effective in the city and the dungeon.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the scout archetype: assault leader, camouflage, cunning trigger, survivalist, and trap spotter*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the scout archetype: hunter's surprise, skill mastery*, and stealthy sniper.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Sniper": {
            "name": "Sniper",
            "type": "Archetype",
            "description": "<p>Some say that the sniper is the worst kind of assassin: a killer who waits silently in the shadows and then strikes from a distance without remorse. Snipers, of course, understand that such protestations about “cowardice” and “honor” regarding their profession are in fact merely the bleatings of sheep fearing the slaughter and pay them no heed. Most snipers take pride in their formidable abilities, which allow them to take life quickly, quietly, and efficiently, then disappear into their surroundings without a trace.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the sniper archetype: camouflage, snap shot, sniper's eye, and weapon training*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the sniper archetype: defensive roll*, master of disguise, and stealthy sniper.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Spy": {
            "name": "Spy",
            "type": "Archetype",
            "description": "<p>The best spies are like chameleons, but not only can they change their appearances to fit the situation, they can also change their personalities, allegiances, and even loves if that's what it takes to achieve their clandestine goals. Spies are the ultimate manipulators, and even those who commission their services sometimes find that they've merely served the spies' own interests.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the spy archetype: canny observer, guileful polyglot, honeyed words, major magic*, minor magic*, and quick disguise.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the spy archetype: crippling strike*, master of disguise, and stealthy sniper.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Swashbuckler": {
            "name": "Swashbuckler",
            "type": "Archetype",
            "description": "<p>A paragon of mobile swordplay, the swashbuckler is a rogue who focuses almost exclusively on honing her skill at arms and perfecting daring acrobatic moves and elaborate flourishes that border on performance.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the swashbuckler archetype: offensive defense, positioning attack, powerful sneak, and weapon training*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the swashbuckler archetype: crippling strike*, entanglement of blades, and redirect attack.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Thug": {
            "name": "Thug",
            "type": "Archetype",
            "description": "<p>Some criminals steal with finesse, their victims only discovering the crime when the rogue is long gone and the coin already spent. A thug, on the other hand, cares nothing for finesse. Through both threat and violence, the thug gets what she wants by the promise of force, and has no problem making good on that promise as needed.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the thug archetype: offensive defense, powerful sneak, strong impression, and weapon training*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the thug archetype: crippling strike*, deadly sneak, and knock-out blow.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Trapsmith": {
            "name": "Trapsmith",
            "type": "Archetype",
            "description": "<p>Some rogues are not content with just disabling traps—they love to build them, finding a captivating beauty in the turning of gears and the slither of ropes over pulleys. The trapsmith may have started out putting together traps in order to better understand how to disable them, but for most, it's long since gone beyond that—they now relish the challenge of creating the perfect combat machine.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the trapsmith archetype: befuddling strike, cunning trigger, quick disable*, and quick trapsmith.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the trapsmith archetype: another day, frugal trapsmith, and skill mastery*.</p>"},
            "source": {
                "name": "Advanced Player's Guide",
                "date": "2010-09-01"
            }
        },
        "Bandit": {
            "name": "Bandit",
            "type": "Archetype",
            "description": "<p>Bandits, brigands, and highwaymen hone their craft along the roadsides and byways of the world, where they leap from the shadows to plunder the spoils of passing travelers. Bandits tend to have a variety of skills; sometimes these skills are similar to a ranger's, but a bandit's tactics always deal with surprise followed by intimidation, with the clear threat of naked force if intimidation does not do the trick. But not all bandits are ruthless thugs. There are those who become outlaws in opposition to tyrants or similar oppressors. These bandits target the status quo and distribute their spoils back into the needy hands of the peasantry.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the bandit archetype: assault leader, combat trick, cunning trigger, snap shot, strong impression, surprise attack, terrain master*, underhanded*, and weapon training.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the bandit archetype: hide in plain sight*, knock-out blow, and opportunist.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Chameleon": {
            "name": "Chameleon",
            "type": "Archetype",
            "description": "<p>An absolute master of disguise, a chameleon effortlessly blends into any environment. Whether disappearing into crowded city streets, vanishing into desert sands, or slipping into the darkness of subterranean tunnels, the chameleon relies upon her ability to become part of her surroundings.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the chameleon archetype: camouflage, fast stealth, quick disguise, and terrain mastery*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the chameleon archetype: hide in plain sight* and master of disguise.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Charlatan": {
            "name": "Charlatan",
            "type": "Archetype",
            "description": "<p>A charlatan is a master of lies and deception. Whether creating simple cons or elaborately woven hoaxes capable of swaying the masses and those in positions of power, a charlatan is often a purveyor of snake-oil, forgeries, and rumormongering.</p>",
            "Grand Hoax": {"name": "Grand Hoax", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>At 3rd level, the charlatan begins to master the art of the grand hoax and learns to create deceptions designed to bestow harm upon her foes. She gains the rumormonger advanced talent, even though she is not yet 10th level. This ability takes the place of trap sense.</p>"},
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the charlatan archetype: black market connections*, coax information, cunning lie*, honeyed words, and underhanded*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the charlatan archetype: hard to fool*, skill mastery, and unwitting ally*.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Driver": {
            "name": "Driver",
            "type": "Archetype",
            "Hard Drive": {"name": "Hard Drive", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>When driving a vehicle that uses a group of animals or magical beasts as muscle propulsion, the DCs of all driving checks are reduced by 2, the maximum speed of the vehicle increases by 10 feet, and the acceleration increases by 5 feet. This ability takes the place of trapfinding.</p>"},
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the driver archetype: firearm training* and getaway artist*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the driver archetype: feat and getaway master*.</p>"},
            "description": "<p>A driver makes her living driving vehicles in the service of those who can pay for her considerable talents. She may be a wagon-driver practiced at smuggling contraband, an accomplished musher blazing arctic trails, or a seemingly refined coach driver placing her roguish talents in the service of a wealthy patron.</p>",
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Knife Master": {
            "name": "Knife Master",
            "type": "Archetype",
            "description": "<p>The knife master is a trained killer who specializes in close-up combat and the wave and weave of knife fighting. In her hands, daggers and other similar light blades become truly deadly instruments.</p>",
            "Sneak Stab": {"name": "Sneak Stab", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>A knife master focuses her ability to deal sneak attack damage with daggers and similar weapons to such a degree that she can deal more sneak attack damage with those weapons at the expense of sneak attacks with other weapons. When she makes a sneak attack with a dagger, kerambit, kukri, punching daggers, starknife, or swordbreaker dagger (Advanced Player's Guide 178), she uses d8s to roll sneak attack damage instead of d6s. For sneak attacks with all other weapons, she uses d4s instead of d6s. This ability is identical in all other ways to sneak attack, and supplements that ability.</p>"},
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the knife master archetype: befuddling strike, combat trick, offensive defense, surprise attack, underhanded*, and weapon training.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the knife master archetype: another day, confounding blades*, deadly sneak, entanglement of blades, and unwitting ally*.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Pirate": {
            "name": "Pirate",
            "type": "Archetype",
            "description": "<p>A pirate breaks from the confines of country and king to commit her crimes upon the high seas. She holds allegiance only to her ship and its captain (if even that much is true), and lives a lawless life upon the waves, plundering ships and shorelines as suits her whim.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the pirate archetype: black market connections*, combat trick, finesse rogue, firearm training*, hold breath*, rope master*, and strong stroke*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the pirate archetype: getaway master*, hard to fool*, and unwitting ally*.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Roof Runner": {
            "name": "Roof Runner",
            "type": "Archetype",
            "description": "<p>A specialized urban acrobat, the roof runner makes her home high atop the spires and gables of great cities. She is skilled at traveling these uneven surfaces at full speed, performing daring leaps and deftly balancing upon narrow and precarious ledges.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the roof runner archetype: expert leaper, ledge walker, nimble climber, stand up, and terrain mastery*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talent complements the roof runner archetype: fast tumble.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Sanctified Rogue": {
            "name": "Sanctified Rogue",
            "type": "Archetype",
            "description": "<p>The sanctified rogue serves a higher purpose, acting as a representative of a church or cult, or following the tenets of a specific faith or deity. While most sanctified rogues share the beliefs or ideals of the religions they represent, not all of them are necessarily pious. A handful of disreputable holy thieves serve purely as mercenaries. At the other end of spectrum, however, more sanctified rogues adhere to the tenets of their faith with fanatical devotion. Regardless, all seem blessed with the ability to call upon divine favor to aid them in times of need.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the sanctified rogue archetype: esoteric scholar*, major magic, and minor magic.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the sanctified rogue archetype: feat and skill mastery.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Survivalist": {
            "name": "Survivalist",
            "type": "Archetype",
            "description": "<p>The survivalist focuses her talents on surviving harsh and unforgiving conditions that would kill a lesser rogue. Whether in blazing deserts or frigid arctic wastes—or simply the cold, hard reality of the streets—the survivalist uses her training to both ensure her own success and provide for the safety of her allies.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the survivalist archetype: hold breath*, iron guts*, resiliency, strong stroke*, survivalist, terrain mastery*, and wall scramble*.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the survivalist archetype: another day, defensive roll, feat, and skill mastery.</p>"},
            "source": {
                "name": "Ultimate Combat",
                "date": "2011-09-01"
            }
        },
        "Filcher": {
            "name": "Filcher",
            "type": "Archetype",
            "description": "<p>A filcher steals valuables without their owners even realizing it. Whether cutting purses in the midst of combat or replacing prized items with fakes under the noses of their owners, the filcher is the master of the quick and quiet steal. A filcher has the following class features.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the filcher archetype: fast stealth, slow reactions; fast fingers, fast getaway ; black market connections, deft palm.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the filcher archetype: skill mastery; fast tumble ; weapon snatcher.</p>"},
            "requirements": [
                {
                    "race": "Halfling"
                }
            ],
            "source": {
                "name": "Advanced Race Guide",
                "date": "2014-09-01"
            }
        },
        "Skulking Slayer": {
            "name": "Skulking Slayer",
            "type": "Archetype",
            "description": "<p>Pushed into a life of crime by the society around them, half-orcs gravitate toward criminal activities that suit them best. Half-orc rogues leave subtle tactics and finesse to halflings and elves, and rely on brute strength and thuggery when they go about making mischief. Skulking slayers have turned the use of raw strength and surprise into an art form.</p>",
            "Weapon and Armor Proficiency": {"name": "Weapon and Armor Proficiency", "type": "Class Feature",  "description": "<p>The skulking slayer gains proficiency with greatclubs and whips, but loses proficiency with rapiers and hand crossbows.</p>"},
            "Class Skills": {"name": "Class Skills", "type": "Class Feature",  "description": "<p>The skulking slayer does not gain Disable Device, Linguistics, and Sleight of Hand as class skills.</p>"},
            "Skill Ranks per Level": {"name": "Skill Ranks per Level", "type": "Class Feature",  "description": "<p>6 + Int modifier.</p>"},
            "Pass for Human": {"name": "Pass for Human", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>At 1st level, when trying to conceal her half-orc heritage, a skulking slayer gains a bonus on Disguise checks equal to half her level. When using disguise to appear as a specific individual, skulking stalkers ignore the normal –2 penalty to appear as another race.</p>"},
            "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature",  "description": "<p>At 2nd level, a skulking slayer can select the Surprise Follow-Through feat (see below) in place of a rogue talent. At 10th level, she can select the Improved Surprise Follow-Through feat in place of an advanced rogue talent.</p>"},
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the skulking slayer archetype: combat trick, surprise attack; combat swipe, powerful sneak ; terrain mastery.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the skulking slayer archetype: crippling strike; deadly sneak ; unwitting ally.</p>"},
            "requirements": [
                {
                    "race": "Half-Orc"
                }
            ],
            "source": {
                "name": "Advanced Race Guide",
                "date": "2014-09-01"
            }
        },
        "Cat Burglar": {
            "name": "Cat Burglar",
            "type": "Archetype",
            "description": "<p>Gifted with finesse and stealth, catfolk make excellent burglars. Cat burglars are masters of breaking and entering, using their feline grace to make it seem as though no crime was ever committed in the first place. Few locks can withstand skilled cat burglars, and such nimble rogues are capable of bypassing traps without activating them and enabling associates to do the same.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the cat burglar archetype: fast stealth, quick disable ; convincing fakes, dodge trap ; fast picks terrain mastery .</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the cat burglar archetype: another day, fast tumble hide in plain sight .</p>"},
            "requirements": [
                {
                    "race": "Catfolk"
                }
            ],
            "source": {
                "name": "Advanced Race Guide",
                "date": "2014-09-01"
            }
        },
        "Deadly Courtesan": {
            "name": "Deadly Courtesan",
            "type": "Archetype",
            "description": "<p>Skilled at manipulation and diversion, the deadly courtesan builds up those around her and periodically takes them down. She can be a spy, entertainer, assassin, bodyguard, or just an intimate to someone who needs it most. A deadly courtesan has the following class features.</p>",
            "Class Skills": {"name": "Class Skills", "type": "Class Feature",  "description": "<p>At 1st level, a deadly courtesan adds Knowledge (history) and Knowledge (nobility) to her list of class skills and removes Knowledge (dungeoneering) from her list of class skills.</p>"},
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the deadly courtesan archetype: finesse rogue, stand up (Core Rulebook); charmer, coax information, fast fingers, honeyed words ; convincing lie, deft palm.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the deadly courtesan archetype: slippery mind (Core Rulebook); master of disguise ; rumormonger, unwitting ally.</p>"},
            "requirements": [
                {
                    "race": "Vishkanya"
                }
            ],
            "source": {
                "name": "Advanced Race Guide",
                "date": "2014-09-01"
            }
        },
        "Eldritch Raider": {
            "name": "Eldritch Raider",
            "type": "Archetype",
            "description": "<p>An eldritch raider is a rogue who seeks to unravel the mysteries of the destruction of the gillmen's homeland. They explore old ruins that date back to the days of the old human empire and track down relics and lore from its glory days. An eldritch raider has the following class features.</p>",
            "Class Skills": {"name": "Class Skills", "type": "Class Feature",  "description": "<p>An eldritch raider adds Knowledge (arcana), Knowledge (history), and Spellcraft to her list of class skills and removes Disguise, Perform, and Sleight of Hand from her list of class skills.</p>"},
            "Skill Ranks per Level": {"name": "Skill Ranks per Level", "type": "Class Feature",  "description": "<p>6 + Int modifier.</p>"},
            "New Talents": {"name": "New Talents", "type": "Class Feature",  "description": "<p>An eldritch raider has access to the following new advanced talents when selecting rogue advanced talents.</p>",
            "Major Eldritch Magic": {"name": "Major Eldritch Magic", "type": "Advanced Rogue Talent", "specialAbilityType": "Spell-like", "description": "<p>The eldritch raider gains the ability to cast a 3rd-level spell from the sorcerer/wizard spell list two times per day as a spell-like ability. The caster level for this ability is equal to her rogue level. The save DC for this spell is 13 + her Intelligence modifier. The eldritch raider must have an Intelligence of at least 13 to select this talent. The eldritch raider must have the major magic, minor eldritch magic, and minor magic rogue talents before choosing this talent.</p>"},
            "Minor Eldritch Magic": {"name": "Minor Eldritch Magic", "type": "Advanced Rogue Talent", "specialAbilityType": "Spell-like", "description": "<p>The eldritch raider gains the ability to cast a 2nd-level spell from the sorcerer/wizard spell list two times per day as a spell-like ability. The caster level for this ability is equal to her rogue level. The save DC for this spell is 12 + her Intelligence modifier. The eldritch raider must have an Intelligence of at least 12 to select this talent. The eldritch raider must have the major magic and minor magic rogue talents before choosing this talent.</p>"}},
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the eldritch raider archetype: major magic, minor magic, quick disable, trap spotter (Core Rulebook); fast picks ; black market connections, esoteric scholar, ninja trick (slow metabolism, wall climber).</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the eldritch raider archetype: dispelling attack, improved evasion, slippery mind (Core Rulebook); major eldritch magic, minor eldritch magic; thoughtful reexamination ; familiar, hard to fool.</p>"},
            "requirements": [
                {
                    "race": "Gillman"
                }
            ],
            "source": {
                "name": "Advanced Race Guide",
                "date": "2014-09-01"
            }
        },
        "Kitsune Trickster": {
            "name": "Kitsune Trickster",
            "type": "Archetype",
            "description": "<p>The kitsune trickster combines her sharpened wit with minor arcane powers of charm and persuasion. She uses her talents to spin convincing lies, riddles, and stories.</p>",
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the kitsune trickster archetype: major magic, minor magic (Core Rulebook); false friend, obfuscate story, steal the story (see below); charmer, coax information, honeyed words ; convincing lie.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the kitsune trickster archetype: skill mastery, slippery mind (Core Rulebook); master of disguise ; rumormonger.</p>"},
            "requirements": [
                {
                    "race": "Kitsune"
                }
            ],
            "source": {
                "name": "Advanced Race Guide",
                "date": "2014-09-01"
            }
        },
        "Swordmaster": {
            "name": "Swordmaster",
            "type": "Archetype",
            "description": "<p>A swordmaster meditates to strengthen her spiritual connection to her blade. She strives to perfect her skills by mastering six deadly trances</p>",
            "Class Skills": {"name": "Class Skills", "type": "Class Feature",  "description": "<p>The swordmaster adds Knowledge (nature) and Survival to her list of class skills and removes Disguise and Knowledge (dungeoneering) from her list of class skills.</p>"},
            "Trance": {"name": "Trance", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>At 3rd level, a swordmaster learns to focus her martial prowess using an intense meditative trance. Under the influence of a trance, the swordmaster can perform fantastic martial feats. Entering a trance is a full-round action that provokes attacks of opportunity. The swordmaster can maintain the trance for a number of rounds per day equal to 4 + her Wisdom modifier. At each level beyond 3rd, she can remain in the trance for 1 additional round. She can end her trance as a free action. Following a trance, the swordmaster is fatigued for a number of rounds equal to 2 × the number of rounds she spent in the trance. A swordmaster cannot enter a new trance while fatigued but can otherwise enter a trance multiple times during a single encounter or combat. If a swordmaster falls unconscious, her trance immediately ends.</p><p>At 3rd level, the swordmaster chooses one trance from the list below. She chooses another trance at 6th, 9th, 12th, 15th, and 18th level. She can only use one type of trance at a time.</p>",
            "Crane Trance": {"name": "Crane Trance", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>The swordmaster's blade rises and falls with the graceful sweeping arcs of the mountain crane. When in this trance, a swordmaster gains the benefits of the Crane Style feat .</p>"},
            "Dragon Trance": {"name": "Dragon Trance", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>Like the dragon, the swordmaster has honed the steadiness of her mind and body. When in this trance, a swordmaster gains the benefits of the Dragon Style feat .</p>"},
            "Leopard Trance": {"name": "Leopard Trance", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>Using the swiftness of the leopard, a swordmaster's evasive footwork confuses her opponents. When in this trance, a swordmaster gains the benefits of the Mobility feat.</p>"},
            "Monkey Trance": {"name": "Monkey Trance", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>As the monkey springs, the swordmaster leaps from the reach of her enemies. While in this trance, a swordmaster can make an Acrobatics check opposed by an opponent's CMD. If she succeeds, she may move 5 feet as a swift action within the opponent's threatened area; this movement does not provoke attacks of opportunity and does not count as a 5-foot step.</p>"},
            "Serpent Trance": {"name": "Serpent Trance", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>Like the serpent, the swordmaster's quick movements allow her to catch her opponent unawares. While in this trance, a swordmaster receives a +4 bonus on Bluff checks made to feint during combat.</p>"},
            "Tiger Trance": {"name": "Tiger Trance", "type": "Class Feature", "specialAbilityType": "Extraordinary", "description": "<p>The swordmaster pounces upon her opponents, striking with the ferocity and brute force of a wild tiger. While in this trance, a swordmaster can make a combat maneuver check against an opponent within charge range. If she succeeds, she may charge that opponent and make a full attack against that opponent.</p><p>This ability replaces all increments of trap sense.</p>"}},
            "Rogue Talents": {"name": "Rogue Talents", "type": "Class Feature",  "description": "<p>The following rogue talents complement the swordmaster archetype: combat trick, stand up, surprise attack, weapon training ; befuddling strike, positioning strike.</p>"},
            "Advanced Talents": {"name": "Advanced Talents", "type": "Class Feature",  "description": "<p>The following advanced rogue talents complement the swordmaster archetype: crippling strike, defensive roll ; hunter's surprise, redirect attack confounding blade.</p>"},
            "requirements": [
                {
                    "race": "Tengu"
                }
            ],
            "source": {
                "name": "Advanced Race Guide",
                "date": "2014-09-01"
            }
        },
        "source": {
            "name": "Core Rulebook",
            "date": "2009-08-01"
        }
    }
}
