{
    "Sorcerer": {
        "name": "Sorcerer",
        "type": "Class",
        "summary": "<p>The spellcasting sorcerer is born with an innate knack for magic and has strange, eldritch powers.</p>",
        "description": "<p>Scions of innately magical Bloodlines, the chosen of deities, the spawn of monsters, pawns of fate and destiny, or simply flukes of fickle magic, sorcerers look within themselves for arcane prowess and draw forth might few mortals can imagine. Emboldened by lives ever threatening to be consumed by their innate powers, these magic-touched souls endlessly indulge in and refine their mysterious abilities, gradually learning how to harness their birthright and coax forth ever greater arcane feats. Just as varied as these innately powerful spellcasters' abilities and inspirations are the ways in which they choose to utilize their gifts. While some seek to control their abilities through meditation and discipline, becoming masters of their fantastic birthright, others give in to their magic, letting it rule their lives with often explosive results. Regardless, sorcerers live and breathe that which other spellcasters devote their lives to mastering, and for them magic is more than a boon or a field of study; it is life itself.</p>",
        "hitDie": "6",
        "classSkills": [
            "Appraise", "Bluff", "Craft", "Fly", "Intimidate", "Knowledge (arcana)", "Profession", "Spellcraft", "Use Magic Device"
        ],
        "skillsPerLevel": "2",
        "progression": {
            "BAB": [
                "0", "1", "1", "2", "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10"
            ],
            "Fortitude": [
                "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
            ],
            "Reflex": [
                "0", "0", "1", "1", "1", "2", "2", "2", "3", "3", "3", "4", "4", "4", "5", "5", "5", "6", "6", "6"
            ],
            "Will": [
                "2", "3", "3", "4", "4", "5", "5", "6", "6", "7", "7", "8", "8", "9", "9", "10", "10", "11", "11", "12"
            ],
            "spellsPerDay": [
                ["3"], ["4"], ["5"], [
                    "6", "3"
                ], [
                    "6", "4"
                ], [
                    "6", "5", "3"
                ], [
                    "6", "6", "4"
                ], [
                    "6", "6", "5", "3"
                ], [
                    "6", "6", "6", "4"
                ], [
                    "6", "6", "6", "5", "3"
                ], [
                    "6", "6", "6", "6", "4"
                ], [
                    "6", "6", "6", "6", "5", "3"
                ], [
                    "6", "6", "6", "6", "6", "4"
                ], [
                    "6", "6", "6", "6", "6", "5", "3"
                ], [
                    "6", "6", "6", "6", "6", "6", "4"
                ], [
                    "6", "6", "6", "6", "6", "6", "5", "3"
                ], [
                    "6", "6", "6", "6", "6", "6", "6", "4"
                ], [
                    "6", "6", "6", "6", "6", "6", "6", "5", "3"
                ], [
                    "6", "6", "6", "6", "6", "6", "6", "6", "4"
                ], [
                    "6", "6", "6", "6", "6", "6", "6", "6", "6"
                ]
            ],
            "spellsKnown": [
                [
                    "4", "2"
                ], [
                    "5", "2"
                ], [
                    "5", "3"
                ], [
                    "6", "3", "1"
                ], [
                    "6", "4", "2"
                ], [
                    "7", "4", "2", "1"
                ], [
                    "7", "5", "3", "2"
                ], [
                    "8", "5", "3", "2", "1"
                ], [
                    "8", "5", "4", "3", "2"
                ], [
                    "9", "5", "4", "3", "2", "1"
                ], [
                    "9", "5", "5", "4", "3", "2"
                ], [
                    "9", "5", "5", "4", "3", "2", "1"
                ], [
                    "9", "5", "5", "4", "4", "3", "2"
                ], [
                    "9", "5", "5", "4", "4", "3", "2", "1"
                ], [
                    "9", "5", "5", "4", "4", "4", "3", "2"
                ], [
                    "9", "5", "5", "4", "4", "4", "3", "2", "1"
                ], [
                    "9", "5", "5", "4", "4", "4", "3", "3", "2"
                ], [
                    "9", "5", "5", "4", "4", "4", "3", "3", "2", "1"
                ], [
                    "9", "5", "5", "4", "4", "4", "3", "3", "3", "2"
                ], [
                    "9", "5", "5", "4", "4", "4", "3", "3", "3", "3"
                ]
            ]
        },
        "Class Features": {
            "Weapon and Armor Proficiency": {
                "name": "Weapon and Armor Proficiency",
                "type": "Class Feature",
                "description": "<p>Sorcerers are proficient with all simple weapons. They are not proficient with any type of armor or shield. Armor interferes with a sorcerer's gestures, which can cause her spells with somatic components to fail (see Arcane Spells and Armor).</p>"
            },
            "Spells": {
                "name": "Spells",
                "type": "Class Feature",
                "description": "<p>A sorcerer casts arcane spells drawn primarily from the sorcerer/wizard spell list presented in Spell Lists. She can cast any spell she knows without preparing it ahead of time. To learn or cast a spell, a sorcerer must have a Charisma score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against a sorcerer's spell is 10 + the spell level + the sorcerer's Charisma modifier.</p><p>Like other spellcasters, a sorcerer can cast only a certain number of spells of each spell level per day. Her base daily spell allotment is given on Table: Sorcerer. In addition, she receives bonus spells per day if she has a high Charisma score (see Table: Ability Modifiers and Bonus Spells).</p><p>A sorcerer's selection of spells is extremely limited. A sorcerer begins play knowing four 0-level spells and two 1st-level spells of her choice. At each new sorcerer level, she gains one or more new spells, as indicated on Table: Sorcerer Spells Known. (Unlike spells per day, the number of spells a sorcerer knows is not affected by her Charisma score; the numbers on Table: Sorcerer Spells Known are fixed.) These new spells can be common spells chosen from the sorcerer/wizard spell list, or they can be unusual spells that the sorcerer has gained some understanding of through study.</p><p>Upon reaching 4th level, and at every even-numbered sorcerer level after that (6th, 8th, and so on), a sorcerer can choose to learn a new spell in place of one she already knows. In effect, the sorcerer loses the old spell in exchange for the new one. The new spell's level must be the same as that of the spell being exchanged. A sorcerer may swap only a single spell at any given level, and must choose whether or not to swap the spell at the same time that she gains new spells known for the level.</p><p>Unlike a wizard or a cleric, a sorcerer need not prepare her spells in advance. She can cast any spell she knows at any time, assuming she has not yet used up her spells per day for that spell level.</p>"
            },
            "Bloodline": {
                "name": "Bloodline",
                "type": "Class Feature",
                "description": "<p>Each sorcerer has a source of magic somewhere in her heritage that grants her spells, bonus feats, an additional class skill, and other special abilities. This source can represent a blood relation or an extreme event involving a creature somewhere in the family's past. For example, a sorcerer might have a dragon as a distant relative or her grandfather might have signed a terrible contract with a devil. Regardless of the source, this influence manifests in a number of ways as the sorcerer gains levels. A sorcerer must pick one bloodline upon taking her first level of sorcerer. Once made, this choice cannot be changed.</p>"
            },
            "At 3rd level, and every two levels thereafter, a sorcerer learns an additional spell, derived from her bloodline. These spells are in addition to the number of ": {
                "name": "At 3rd level, and every two levels thereafter, a sorcerer learns an additional spell, derived from her bloodline. These spells are in addition to the number of spells given on Table",
                "type": "Class Feature",
                "description": "<p>Sorcerer Spells Known. These spells cannot be exchanged for different spells at higher levels.</p><p>At 7th level, and every six levels thereafter, a sorcerer receives one bonus feat, chosen from a list specific to each bloodline. The sorcerer must meet the prerequisites for these bonus feats.</p>"
            },
            "Cantrips": {
                "name": "Cantrips",
                "type": "Class Feature",
                "description": "<p>Sorcerers learn a number of cantrips, or 0-level spells, as noted on Table: Sorcerer Spells Known under “Spells Known.” These spells are cast like any other spell, but they do not consume any slots and may be used again.</p>"
            },
            "Eschew Materials": {
                "name": "Eschew Materials",
                "type": "Class Feature",
                "description": "<p>A sorcerer gains Eschew Materials as a bonus feat at 1st level.</p>"
            }
        },
        "Archetype": {
            "Aberrant": {
                "name": "Aberrant",
                "type": "Bloodlines",
                "description": "<p>There is a taint in your blood, one that is alien and bizarre. You tend to think in odd ways, approaching problems from an angle that most would not expect. Over time, this taint manifests itself in your physical form.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (dungeoneering).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>enlarge person (3rd), see invisibility (5th), tongues (7th), black tentacles (9th), feeblemind (11th), veil (13th), plane shift (15th), mind blank (17th), shapechange (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Combat Casting, Improved Disarm, Improved Grapple, Improved Initiative, Improved Unarmed Strike, Iron Will, Silent Spell, Skill Focus (Knowledge [dungeoneering]).</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the polymorph subschool, increase the duration of the spell by 50% (minimum 1 round). This bonus does not stack with the increase granted by the Extend Spell feat.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Aberrant sorcerers show increasing signs of their tainted heritage as they increase in level, although they are only visible when used.</p>",
                "Acidic Ray": {"name": "Acidic Ray", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can fire an acidic ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. The acidic ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Long Limbs": {"name": "Long Limbs", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, your reach increases by 5 feet whenever you are making a melee touch attack. This ability does not otherwise increase your threatened area. At 11th level, this bonus to your reach increases to 10 feet. At 17th level, this bonus to your reach increases to 15 feet.</p>"},
                "Unusual Anatomy": {"name": "Unusual Anatomy", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 9th level, your anatomy changes, giving you a 25% chance to ignore any critical hit or sneak attack scored against you. This chance increases to 50% at 13th level.</p>"},
                "Alien Resistance": {"name": "Alien Resistance", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you gain spell resistance equal to your sorcerer level + 10.</p>"},
                "Aberrant Form": {"name": "Aberrant Form", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, your body becomes truly unnatural. You are immune to critical hits and sneak attacks. In addition, you gain blindsight with a range of 60 feet and damage reduction 5/—.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Abyssal": {
                "name": "Abyssal",
                "type": "Bloodlines",
                "description": "<p>Generations ago, a demon spread its filth into your heritage. While it does not manifest in all of your kin, for you it is particularly strong. You might sometimes have urges to chaos or evil, but your destiny (and alignment) is up to you.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (planes).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>cause fear (3rd), bull's strength (5th), rage (7th), stoneskin (9th), dismissal (11th), transformation (13th), greater teleport (15th), unholy aura (17th), summon monster IX (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Augment Summoning, Cleave, Empower Spell, Great Fortitude, Improved Bull Rush, Improved Sunder, Power Attack, Skill Focus (Knowledge [planes]).</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/good equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>While some would say that you are possessed, you know better. The demonic influence in your blood grows as you gain power.</p>",
                "Claws": {"name": "Claws", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. These attacks deal 1d4 points of damage each (1d3 if you are Small) plus your Strength modifier. At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws become flaming weapons, each dealing an additional 1d6 points of fire damage on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.</p>"},
                "Demon Resistances": {"name": "Demon Resistances", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain resist electricity 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to electricity increases to 10 and your bonus on poison saving throws increases to +4.</p>"},
                "Strength of the Abyss": {"name": "Strength of the Abyss", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 9th level, you gain a +2 inherent bonus to your Strength. This bonus increases to +4 at 13th level, and to +6 at 17th level.</p>"},
                "Added Summonings": {"name": "Added Summonings", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, whenever you summon a creature with the demon subtype or the fiendish template using a summon monster spell, you summon one additional creature of the same kind.</p>"},
                "Demonic Might": {"name": "Demonic Might", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, the power of the Abyss flows through you. You gain immunity to electricity and poison. You also gain resistance to acid 10, cold 10, and fire 10, and gain telepathy with a range of 60 feet (allowing you to communicate with any creature that can speak a language).</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Arcane": {
                "name": "Arcane",
                "type": "Bloodlines",
                "description": "<p>Your family has always been skilled in the eldritch art of magic. While many of your relatives were accomplished wizards, your powers developed without the need for study and practice.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (any one).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>identify (3rd), invisibility (5th), dispel magic (7th), dimension door (9th), overland flight (11th), true seeing (13th), greater teleport (15th), power word stun (17th), wish (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Combat Casting, Improved Counterspell, Improved Initiative, Iron Will, Scribe Scroll, Skill Focus (Knowledge [arcana]), Spell Focus, Still Spell.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you apply a metamagic feat to a spell that increases the slot used by at least one level, increase the spell's DC by +1. This bonus does not stack with itself and does not apply to spells modified by the Heighten Spell feat.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Magic comes naturally to you, but as you gain levels you must take care to prevent the power from overwhelming you.</p>",
                "Arcane Bond": {"name": "Arcane Bond", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 1st level, you gain an arcane bond, as a wizard equal to your sorcerer level. Your sorcerer levels stack with any wizard levels you possess when determining the powers of your familiar or bonded object. This ability does not allow you to have both a familiar and a bonded item. Once per day, your bond item allows you to cast any one of our spells known (unlike a wizard's bonded item, which allows him to cast any one spell in his spellbook).</p>"},
                "Metamagic Adept": {"name": "Metamagic Adept", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you can apply any one metamagic feat you know to a spell you are about to cast without increasing the casting time. You must still expend a higher-level spell slot to cast this spell. You can use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 19th level. At 20th level, this ability is replaced by arcane apotheosis.</p>"},
                "New Arcana": {"name": "New Arcana", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 9th level, you can add any one spell from the sorcerer/wizard spell list to your list of spells known. This spell must be of a level that you are capable of casting. You can also add one additional spell at 13th level and 17th level.</p>"},
                "School Power": {"name": "School Power", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 15th level, pick one school of magic. The DC for any spells you cast from that school increases by +2. This bonus stacks with the bonus granted by Spell Focus.</p>"},
                "Arcane Apotheosis": {"name": "Arcane Apotheosis", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, your body surges with arcane power. You can add any metamagic feats that you know to your spells without increasing their casting time, although you must still expend higher-level spell slots. Whenever you use magic items that require charges, you can instead expend spell slots to power the item. For every three levels of spell slots that you expend, you consume one less charge when using a magic item that expends charges.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Celestial": {
                "name": "Celestial",
                "type": "Bloodlines",
                "description": "<p>Your bloodline is blessed by a celestial power, either from a celestial ancestor or through divine intervention. Although this power drives you along the path of good, your fate (and alignment) is your own to determine.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Heal.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>bless (3rd), resist energy (5th), magic circle against evil (7th), remove curse (9th), flame strike (11th), greater dispel magic (13th), banishment (15th), sunburst (17th), gate (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Dodge, Extend Spell, Iron Will, Mobility, Mounted Combat, Ride-By Attack, Skill Focus (Knowledge [religion]), Weapon Finesse.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/evil equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your celestial heritage grants you a great many powers, but they come at a price. The lords of the higher planes are watching you and your actions closely.</p>",
                "Heavenly Fire": {"name": "Heavenly Fire", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can unleash a ray of heavenly fire as a standard action, targeting any foe within 30 feet as a ranged touch attack. Against evil creatures, this ray deals 1d4 points of damage + 1 for every two sorcerer levels you possess. This damage is divine and not subject to energy resistance or immunity. This ray heals good creatures of 1d4 points of damage + 1 for every two sorcerer levels you possess. A good creature cannot benefit from your heavenly fire more than once per day. Neutral creatures are neither harmed nor healed by this effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Celestial Resistances": {"name": "Celestial Resistances", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain resist acid 5 and resist cold 5. At 9th level, your resistances increase to 10.</p>"},
                "Wings of Heaven": {"name": "Wings of Heaven", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you can sprout feathery wings and fly for a number of minutes per day equal to your sorcerer level, with a speed of 60 feet and good maneuverability. This duration does not need to be consecutive, but it must be used in 1 minute increments.</p>"},
                "Conviction": {"name": "Conviction", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you can reroll any one ability check, attack roll, skill check, or saving throw you just made. You must decide to use this ability after the die is rolled, but before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability once per day.</p>"},
                "Ascension": {"name": "Ascension", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you become infused with the power of the heavens. You gain immunity to acid, cold, and petrification. You also gain resist electricity 10, resist fire 10, and a +4 racial bonus on saves against poison. Finally, you gain unlimited use of the wings of heaven ability. Finally, you gain the ability to speak with any creature that has a language (as per the tongues spell).</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Destined": {
                "name": "Destined",
                "type": "Bloodlines",
                "description": "<p>Your family is destined for greatness in some way. Your birth could have been foretold in prophecy, or perhaps it occurred during an especially auspicious event, such as a solar eclipse. Regardless of your bloodline's origin, you have a great future ahead.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (history).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>alarm (3rd), blur (5th), protection from energy (7th), freedom of movement (9th), break enchantment (11th), mislead (13th), spell turning (15th), moment of prescience (17th), foresight (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Arcane Strike, Diehard, Endurance, Leadership, Lightning Reflexes, Maximize Spell, Skill Focus (Knowledge [history]), Weapon Focus.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with a range of “personal,” you gain a luck bonus equal to the spell's level on all your saving throws for 1 round.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You are destined for great things, and the powers that you gain serve to protect you.</p>",
                "Touch of Destiny": {"name": "Touch of Destiny", "type": "Class Feature", "featureType": "Sp", "description": "<p>At 1st level, you can touch a creature as a standard action, giving it an insight bonus on attack rolls, skill checks, ability checks, and saving throws equal to 1/2 your sorcerer level (minimum 1) for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Fated": {"name": "Fated", "type": "Class Feature", "featureType": "Su", "description": "<p>Starting at 3rd level, you gain a +1 luck bonus on all of your saving throws and to your AC during surprise rounds (see Combat) and when you are otherwise unaware of an attack. At 7th level and every four levels thereafter, this bonus increases by +1, to a maximum of +5 at 19th level.</p>"},
                "It Was Meant To Be": {"name": "It Was Meant To Be", "type": "Class Feature", "featureType": "Su", "description": "<p>At 9th level, you may reroll any one attack roll, critical hit confirmation roll, or level check made to overcome spell resistance. You must decide to use this ability after the first roll is made but before the results are revealed by the GM. You must take the second result, even if it is worse. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day.</p>"},
                "Within Reach": {"name": "Within Reach", "type": "Class Feature", "featureType": "Su", "description": "<p>At 15th level, your ultimate destiny is drawing near. Once per day, when an attack or spell that causes damage would result in your death, you may attempt a DC 20 Will save. If successful, you are instead reduced to –1 hit points and are automatically stabilized. The bonus from your fated ability applies to this save.</p>"},
                "Destiny Realized": {"name": "Destiny Realized", "type": "Class Feature", "featureType": "Su", "description": "<p>At 20th level, your moment of destiny is at hand. Any critical threats made against you only confirm if the second roll results in a natural 20 on the die. Any critical threats you score with a spell are automatically confirmed. Once per day, you can automatically succeed at one caster level check made to overcome spell resistance. You must use this ability before making the roll.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Draconic": {
                "name": "Draconic",
                "type": "Bloodlines",
                "description": "<p>At some point in your family's history, a dragon interbred with your bloodline, and now its ancient power flows through your veins.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Perception.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>mage armor (3rd), resist energy (5th), fly (7th), fear (9th), spell resistance (11th), form of the dragon I (13th), form of the dragon II (15th), form of the dragon III (17th), wish (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Blind-Fight, Great Fortitude, Improved Initiative, Power Attack, Quicken Spell, Skill Focus (Fly), Skill Focus (Knowledge [arcana]), Toughness.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with an energy descriptor that matches your draconic bloodline's energy type, that spell deals +1 point of damage per die rolled.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The power of dragons flows through you and manifests in a number of ways. At 1st level, you must select one of the chromatic or metallic dragon types. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your dragon type, as noted on the following table.</p><table><th><td>Dragon Type</td><td>Energy Type</td><td>Breath Shape</td></th><tr><td>Black</td><td>Acid</td><td>60-foot line</td></tr><tr><td>Blue</td><td>Electricity</td><td>60-foot line</td></tr><tr><td>Green</td><td>Acid</td><td>30-foot cone</td></tr><tr><td>Red</td><td>Fire</td><td>30-foot cone</td></tr><tr><td>White</td><td>Cold</td><td>30-foot cone</td></tr><tr><td>Brass</td><td>Fire</td><td>60-foot line</td></tr><tr><td>Bronze</td><td>Electricity</td><td>60-foot line</td></tr><tr><td>Copper</td><td>Acid</td><td>60-foot line</td></tr><tr><td>Gold</td><td>Fire</td><td>30-foot cone</td></tr><tr><td>Silver</td><td>Cold</td><td>30-foot cone</td></tr></table>",
                "Claws": {"name": "Claws", "type": "Bloodline Power", "featureType": "Su", "description": "<p>Starting at 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. Each of these attacks deals 1d4 points of damage plus your Strength modifier (1d3 if you are Small). At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws deal an additional 1d6 points of damage of your energy type on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.</p>"},
                "Dragon Resistances": {"name": "Dragon Resistances", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain resist 5 against your energy type and a +1 natural armor bonus. At 9th level, your energy resistance increases to 10 and natural armor bonus increases to +2. At 15th level, your natural armor bonus increases to +4.</p>"},
                "Breath Weapon": {"name": "Breath Weapon", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you gain a breath weapon. This breath weapon deals 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of the breath receive a Reflex save for half damage. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The shape of the breath weapon depends on your dragon type (as indicated on the above chart). At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day.</p>"},
                "Wings": {"name": "Wings", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, leathery dragon wings grow from your back as a standard action, giving you a fly speed of 60 feet with average maneuverability. You can dismiss the wings as a free action.</p>"},
                "Power of Wyrms": {"name": "Power of Wyrms", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, your draconic heritage becomes manifest. You gain immunity to paralysis, sleep, and damage of your energy type. You also gain blindsense 60 feet.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Elemental": {
                "name": "Elemental",
                "type": "Bloodlines",
                "description": "<p>The power of the elements resides in you, and at times you can hardly control its fury. This influence comes from an elemental outsider in your family history or a time when you or your relatives were exposed to a powerful elemental force.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (planes).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>burning hands* (3rd), scorching ray* (5th), protection from energy (7th), elemental body I (9th), elemental body II (11th), elemental body III (13th), elemental body IV (15th), summon monster VIII (elementals only) (17th), elemental swarm (19th).</p><p>*These spells always deal a type of damage determined by your element. In addition, the subtype of these spells changes to match the energy type of your element.</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge (planes)), Weapon Finesse.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell that deals energy damage, you can change the type of damage to match the type of your bloodline. This also changes the spell's type to match the type of your bloodline.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>One of the four elements infuses your being, and you can draw upon its power in times of need. At first level, you must select one of the four elements: air, earth, fire, or water. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your element, as noted below.<table><th><td>Element</td><td>Energy Type</td><td>Elemental Movement</td></tr><tr><td>Air</td><td>Electricity</td><td>Fly 60 feet (average)<tr><td>Earth</td><td>Acid</td><td>Burrow 30 feet</td></tr><tr><td>Fire</td><td>Fire</td><td>+30 feet base speed</td></tr><tr><td>Water</td><td>Cold</td><td>Swim 60 feet</td></tr></table></p>",
                "Elemental Ray": {"name": "Elemental Ray", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of damage of your energy type + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Elemental Resistance": {"name": "Elemental Resistance", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain energy resistance 10 against your energy type. At 9th level, your energy resistance increases to 20.</p>"},
                "Elemental Blast": {"name": "Elemental Blast", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can unleash a blast of elemental power once per day. This 20-foot-radius burst does 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Creatures that fail their saves gain vulnerability to your energy type until the end of your next turn. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.</p>"},
                "Elemental Movement": {"name": "Elemental Movement", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you gain a special movement type or bonus. This ability is based on your chosen element, as indicated on the above chart.</p>"},
                "Elemental Body": {"name": "Elemental Body", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, elemental power surges through your body. You gain immunity to sneak attacks, critical hits, and damage from your energy type.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Fey": {
                "name": "Fey",
                "type": "Bloodlines",
                "description": "<p>The capricious nature of the fey runs in your family due to some intermingling of fey blood or magic. You are more emotional than most, prone to bouts of joy and rage.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (nature).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>entangle (3rd), hideous laughter (5th), deep slumber (7th), poison (9th), tree stride (11th), mislead (13th), phase door (15th), irresistible dance (17th), shapechange (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Dodge, Improved Initiative, Lightning Reflexes, Mobility, Point Blank Shot, Precise Shot, Quicken Spell, Skill Focus (Knowledge (nature)).</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the compulsion subschool, increase the spell's DC by +2.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You have always had a tie to the natural world, and as your power increases, so does the influence of the fey over your magic.</p>",
                "Laughing Touch": {"name": "Laughing Touch", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can cause a creature to burst out laughing for 1 round as a melee touch attack. A laughing creature can only take a move action but can defend itself normally. Once a creature has been affected by laughing touch, it is immune to its effects for 24 hours. You can use this ability a number of times per day equal to 3 + your Charisma modifier. This is a mind-affecting effect.</p>"},
                "Woodland Stride": {"name": "Woodland Stride", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you can move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at your normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect you.</p>"},
                "Fleeting Glance": {"name": "Fleeting Glance", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can turn invisible for a number of rounds per day equal to your sorcerer level. This ability functions as greater invisibility. These rounds need not be consecutive.</p>"},
                "Fey Magic": {"name": "Fey Magic", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you may reroll any caster level check made to overcome spell resistance. You must decide to use this ability before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability at will.</p>"},
                "Soul of the Fey": {"name": "Soul of the Fey", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, your soul becomes one with the world of the fey. You gain immunity to poison and DR 10/cold iron. Creatures of the animal type do not attack you unless compelled to do so through magic. Once per day, you can cast shadow walk as a spell-like ability using your sorcerer level as your caster level.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Infernal": {
                "name": "Infernal",
                "type": "Bloodlines",
                "description": "<p>Somewhere in your family's history, a relative made a deal with a devil, and that pact has influenced your family line ever since. In you, it manifests in direct and obvious ways, granting you powers and abilities. While your fate is still your own, you can't help but wonder if your ultimate reward is bound to the Pit.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Diplomacy.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>protection from good (3rd), scorching ray (5th), suggestion (7th), charm monster (9th), dominate person (11th), planar binding (devils and creatures with the fiendish template only) (13th), greater teleport (15th), power word stun (17th), meteor swarm (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Blind-Fight, Combat Expertise, Deceitful, Extend Spell, Improved Disarm, Iron Will, Skill Focus (Knowledge [planes]), Spell Penetration.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the charm subschool, increase the spell's DC by +2.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You can draw upon the power of Hell, although you must be wary of its corrupting influence. Such power does not come without a price.</p>",
                "Corrupting Touch": {"name": "Corrupting Touch", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can cause a creature to become shaken as a melee touch attack. This effect persists for a number of rounds equal to 1/2 your sorcerer level (minimum 1). Creatures shaken by this ability radiate an aura of evil, as if they were an evil outsider (see detect evil). Multiple touches do not stack, but they do add to the duration. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Infernal Resistances": {"name": "Infernal Resistances", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain resist fire 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to fire increases to 10 and your bonus on poison saving throws increases to +4.</p>"},
                "Hellfire": {"name": "Hellfire", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can call down a column of hellfire. This 10-foot-radius burst does 1d6 points of fire damage per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Good creatures that fail their saves are shaken for a number of rounds equal to your sorcerer level. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.</p>"},
                "On Dark Wings": {"name": "On Dark Wings", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you can grow fearsome bat wings as a standard action, giving you a fly speed of 60 feet with average maneuverability. The wings can be dismissed as a free action.</p>"},
                "Power of the Pit": {"name": "Power of the Pit", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, your form becomes infused with vile power. You gain immunity to fire and poison. You also gain resistance to acid 10 and cold 10, and the ability to see perfectly in darkness of any kind to a range of 60 feet.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Undead": {
                "name": "Undead",
                "type": "Bloodlines",
                "description": "<p>The taint of the grave runs through your family. Perhaps one of your ancestors became a powerful lich or vampire, or maybe you were born dead before suddenly returning to life. Either way, the forces of death move through you and touch your every action.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (religion).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>chill touch (3rd), false life (5th), vampiric touch (7th), animate dead (9th), waves of fatigue (11th), undeath to death (13th), finger of death (15th), horrid wilting (17th), energy drain (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Combat Casting, Diehard, Endurance, Iron Will, Skill Focus (Knowledge [religion]), Spell Focus, Still Spell, Toughness.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Some undead are susceptible to your mind-affecting spells. Corporeal undead that were once humanoids are treated as humanoids for the purposes of determining which spells affect them.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You can call upon the foul powers of the afterlife. Unfortunately, the more you draw upon them, the closer you come to joining them.</p>",
                "Grave Touch": {"name": "Grave Touch", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can make a melee touch attack as a standard action that causes a living creature to become shaken for a number of rounds equal to 1/2 your sorcerer level (minimum 1). If you touch a shaken creature with this ability, it becomes frightened for 1 round if it has fewer Hit Dice than your sorcerer level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Death's Gift": {"name": "Death's Gift", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 3rd level, you gain resist cold 5 and DR 5/— against nonlethal damage. At 9th level, your resistance to cold increases to 10 and your DR increases to 10/— against nonlethal damage.</p>"},
                "Grasp of the Dead": {"name": "Grasp of the Dead", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can cause a swarm of skeletal arms to burst from the ground to rip and tear at your foes. The skeletal arms erupt from the ground in a 20-foot-radius burst. Anyone in this area takes 1d6 points of slashing damage per sorcerer level. Those caught in the area receive a Reflex save for half damage. Those who fail the save are unable to move for 1 round. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The skeletal arms disappear after 1 round. The arms must burst up from a solid surface. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.</p>"},
                "Incorporeal Form": {"name": "Incorporeal Form", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you can become incorporeal for 1 round per sorcerer level. While in this form, you gain the incorporeal subtype. You only take half damage from corporeal sources as long as they are magic (you take no damage from non-magic weapons and objects). Likewise, your spells deal only half damage to corporeal creatures. Spells and other effects that do not deal damage function normally. You can use this ability once per day.</p>"},
                "One of Us": {"name": "One of Us", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, your form begins to rot (the appearance of this decay is up to you) and undead see you as one of them. You gain immunity to cold, nonlethal damage, paralysis, and sleep. You also gain DR 5/—. Unintelligent undead do not notice you unless you attack them. You receive a +4 morale bonus on saving throws made against spells and spell-like abilities cast by undead.</p>"}},
                "source": {
                    "name": "Core Rulebook",
                    "date": "2009-08-01"
                }
            },
            "Accursed": {
                "name": "Accursed",
                "type": "Bloodlines",
                "description": "<p>Misfortune, pestilence, and nightmares follow your family like vermin drawn to carrion. Somewhere in your family history, a hag's foul influence entered your bloodline. You may actually be related to the hag, or you may still be suffering the effects of a curse that a hag laid upon your kin in generations past. Now the hag's powers are part of your heritage.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Perception.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>ray of enfeeblement (3rd), touch of idiocy (5th), ray of exhaustion (7th), bestow curse (9th), feeblemind (11th), eyebite (13th), insanity (15th), dimensional lock (17th), energy drain (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Alertness, Blind-Fight, Combat Casting, Deceitful, Defensive Combat Training, Endurance, Great Fortitude, Mounted Combat.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>You count as a hag for the purpose of joining a hag's coven. The coven must contain at least one hag. In addition, whenever you are within 30 feet of another sorcerer with this bloodline or a witch with the coven hex, you can use the aid another action to grant a +1 bonus to the other spellcaster's caster level for 1 round.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The source of your power isn't pretty, but it does allow you to emulate the preternatural ugliness and toughness of a hag—though doing so won't help you make friends.</p>",
                "Horrific Visage": {"name": "Horrific Visage", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 1st level, you can draw upon your hag ancestor to cause one target to perceive you as having a horrifying appearance. As a standard action, you can force one target within 30 feet to make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be shaken for 1 round for every 2 sorcerer levels you possess (minimum 1 round). This is a mind-affecting, fear-based ability. This fear does not stack with other fear effects. You may use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Wretched Endurance": {"name": "Wretched Endurance", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain a +2 bonus on all saving throws against charm, cold, fear, fire, and sleep effects. And 9th level, these bonuses increase to +4.</p>"},
                "Dread Gaze": {"name": "Dread Gaze", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you gain a form of the green hag's evil eye power. As a standard action, you may fix your gaze on any one creature within 60 feet. The target must make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be staggered for 1 round for every 2 sorcerer levels you possess. You may use this ability once per day at 9th level. At 17th level, you can use this ability twice per day. At 20th level, you may use this ability three times per day.</p>"},
                "Dream Walking": {"name": "Dream Walking", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you can enter the ethereal plane. This functions like ethereal jaunt, but with a duration of 1 minute for every 2 sorcerer levels you possess. Once during this trip, you may cast nightmare as a spell-like ability on a creature you see on the Material Plane. (This is an exception to the normal rule that ethereal creatures cannot affect targets on the Material Plane).</p>"},
                "Fearsome Survival": {"name": "Fearsome Survival", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, your hag-blood gives you considerable resilience. You gain DR 10/cold iron, and gain SR equal to 6 + your sorcerer level.</p>"}},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Djinni": {
                "name": "Djinni",
                "type": "Bloodlines",
                "description": "<p>You were born with the power of air genies, and the magic of the djinn is strong in you.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (planes).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>shocking grasp (3rd), invisibility (5th), fly (7th), minor creation (9th), overland flight (11th), chain lightning (13th), plane shift (15th), greater planar binding (17th), wish (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell that deals energy damage, you can change the type of damage to electricity. This also changes the spell's descriptors to match this energy type.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Like a djinni, you have both natural power over air and several other genie-based abilities.</p>"},
                "Electricity Ray": {"name": "Electricity Ray", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of electricity damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Elemental Resistance": {"name": "Elemental Resistance", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain electricity resistance 10. Your electricity resistance increases to 20 at 9th level.</p>"},
                "Whirlwind": {"name": "Whirlwind", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you gain the ability to turn into a 10-foot-high whirlwind once per day for 1 round per sorcerer level.</p>"},
                "Elemental Movement": {"name": "Elemental Movement", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you gain a fly speed of 60 feet with average maneuverability.</p>"},
                "Power of the Djinn": {"name": "Power of the Djinn", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words “I wish,” and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.<p></p>You also become immune to electricity damage, and can use plane shift once per day to travel to or from the Plane of Air.</p>"},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Efreeti": {
                "name": "Efreeti",
                "type": "Bloodlines",
                "description": "<p>You were born with the power of fire genies, and the magic of the efreet is strong in you.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (planes).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>enlarge person (3rd), scorching ray (5th), fireball (7th), wall of fire (9th), persistent image (11th), planar binding (13th), plane shift (15th), giant form II (17th), wish (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell that deals energy damage, you can change the type of damage to fire. This also changes the spell's descriptors to match this energy type.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Like an efreeti, you have both natural power over air and several other genie-based abilities.</p>"},
                "Fire Ray": {"name": "Fire Ray", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of fire damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Elemental Resistance": {"name": "Elemental Resistance", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain fire resistance 10. At 9th level, your fire resistance increases to 20.</p>"},
                "Efreeti Form": {"name": "Efreeti Form", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you gain the ability to assume the form of an efreeti once per day. This acts like the spell giant form I, except you only use it to become an efreeti and its duration is 1 round per level. While in this form, you also gain an efreeti's heat ability.</p>"},
                "Elemental Movement": {"name": "Elemental Movement", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, your base speed increases by +30 feet.</p>"},
                "Power of the Efreet": {"name": "Power of the Efreet", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words “I wish,” and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.</p><p>You also become immune to fire damage, and can use plane shift once per day to travel to or from the Plane of Fire.</p>"},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Maestro": {
                "name": "Maestro",
                "type": "Bloodlines",
                "description": "<p>The spiritual power of art and song runs strongly through your family line. This may be the result of ancient pacts made with azata patrons, or even an inheritance from a lillend or trumpet archon ancestor. It could also be the lingering taint of a less savory heritage, such as from a harpy or a forefather driven to madness by the disquieting gibbering of a shoggoth. However it came to be, your family's artistic bent shows itself strongly in your magic.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Perform.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>ventriloquism (3rd), hideous laughter (5th), suggestion (7th), shout (9th), dominate person (11th), mass suggestion (13th), power word blind (15th), greater shout (17th), wail of the banshee (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Deceitful, Greater Spell Focus (enchantment), Lingering Performance, Persuasive, Skill Focus (Perform), Spell Focus (enchantment), Spellsong, Still Spell.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with a verbal component and no somatic or material component, you treat your caster level as if it were one higher.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You hear music whenever you cast spells, and can use the songs in your head to create magic effects.</p>",
                "Beguiling Voice": {"name": "Beguiling Voice", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 1st level, you can use the sound of your voice to lull a target creature into taking no action. This ability acts as the daze spell, except it is language-dependent, has a duration of 1 round, and affects a living creature whose Hit Dice do not exceed your sorcerer level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Fascinate": {"name": "Fascinate", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain the ability to use a Perform skill to cause one or more creatures to become fascinated with you. This acts as the fascinate bardic perform ability, except the save DC is 10 + 1/2 your sorcerer level + your Charisma bonus, and it lasts 1 round/level. You may use this ability once per day at 3rd level, twice per day at 8th level, three times per day at 13th level, and four times per day at 18th level.</p>"},
                "Perfect Voice": {"name": "Perfect Voice", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you understand all efforts to communicate through sound, and can make yourself understood to any creature able to understand language. You can speak to, and understand the speech of, any creature that understands at least one spoken language. The save DCs of language-dependent spells you cast increase by +1.</p>"},
                "Inspire": {"name": "Inspire", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, your artistic magic can inspire your allies to great accomplishments. You can use greater heroism as a spell-like ability. You can use this ability once per day at 15th level, twice per day at 17th level, and three times per day at 19th level.</p>"},
                "Grand Maestro": {"name": "Grand Maestro", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, the power of pure magic music flows through you. You cast any spell with a verbal component as if it had the Still Spell metamagic feat applied to it, with no increase to the casting time or spell slot required to cast it. You gain immunity to sonic damage and language-dependent spells.</p>"}},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Marid": {
                "name": "Marid",
                "type": "Bloodlines",
                "description": "<p>You were born with the power of water genies, and the magic of the marids is strong in you.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (planes).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>obscuring mist (3rd), see invisibility (5th), gaseous form (7th), wall of ice (9th), persistent image (11th), elemental body III (13th), plane shift (15th), polar ray (17th), wish (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell that deals energy damage, you can change the type of damage to cold. This also changes the spell's descriptors to match this energy type.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Like a marid, you have both natural power over water and several other genie-based abilities.</p>"},
                "Frost Ray": {"name": "Frost Ray", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of cold damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Elemental Resistance": {"name": "Elemental Resistance", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain cold resistance 10. At 9th level, your cold resistance increases to 20.</p>"},
                "Water's Fury": {"name": "Water's Fury", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you gain the ability to summon a rushing jet of water from the elemental plane of water and direct it against your foes. As a standard action, you can create a jet of water in a 60-foot line that deals 1d6 points of damage per two sorcerer levels you possess, and blinds the target that was struck for 1d6 rounds. A Reflex save (DC 10 + 1/2 your sorcerer level + your Charisma bonus) reduces the damage by half and negates the blinding effect.</p>"},
                "Elemental Movement": {"name": "Elemental Movement", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you gain a swim speed of 60 feet.</p>"},
                "Power of the Marid": {"name": "Power of the Marid", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words “I wish,” and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.</p><p>You become immune to cold damage, and can use plane shift once per day to travel to or from the Plane of Water.</p>"},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Rakshasa": {
                "name": "Rakshasa",
                "type": "Bloodlines",
                "description": "<p>At some point in your family's history, one of your ancestors was tainted by the influence of a rakshasa. Though most of your family seem entirely normal, you have always felt your own skin is a prison from which magic allows you to escape. Your birthright is a secret you may be forced to keep from societies that would never deal with you if your heritage were known.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Disguise.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>charm person (3rd), invisibility (5th), suggestion (7th), detect scrying (9th), prying eyes (11th), mass suggestion (13th), greater polymorph (15th), mind blank (17th), dominate monster (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Arcane Armor Mastery, Arcane Armor Training, Deceitful, Detect Expertise, Empower Spell, Light Armor Proficiency, Martial Weapon Proficiency, Stealthy.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Add half your sorcerer level to the Spellcraft DC for others to identify spells you cast. If their checks fail by 5 or more, they mistakenly believe you are casting an entirely different spell (selected by you when you begin casting).</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You can call upon the nearly divine power of your rakshasa ancestors, giving you the power to convincingly deceive your enemies.</p>",
                "Silver Tongue": {"name": "Silver Tongue", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 1st level, you can draw upon your outsider heritage to spin amazingly convincing lies. Activating this ability is a swift action. You gain a +5 bonus on one Bluff check made to convince another of the truth of your words (similar to using glibness). If a magical effect is used against you that would detect your lies or force you to speak the truth, the user of the effect must succeed on a caster level check (DC 10 + your sorcerer level) to succeed. Failure means the effect does not detect your lies or force you to speak only the truth. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Mind Reader": {"name": "Mind Reader", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 3rd level, you can read minds as a spell-like ability. This ability acts like detect thoughts, except it lasts only 1 round, you use it on a single target as a standard action, and if the target fails its Will save, you gain information as if you had concentrated on it for 3 rounds. You may use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 20th level.</p>"},
                "Hide Aura": {"name": "Hide Aura", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can conceal yourself from prying magic. This ability acts like a constant nondetection spell cast upon yourself. You can end or restore this protection as a move action.</p>"},
                "Alter Self": {"name": "Alter Self", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you can change your shape into that of any humanoid at will. This ability acts like alter self, except you may remain in a chosen form as long as you want.</p>"},
                "Outsider": {"name": "Outsider", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, your natural form becomes an animal-headed humanoid, like a true rakshasa. This does not affect your ability to speak or cast spells. You can use your alter self or other disguise and polymorph abilities to assume your original form or other forms when it suits you. You are forevermore treated as a native outsider rather than as a humanoid (or whatever your original type was) for the purpose of spells and other magical effects. Unlike other outsiders, you can still be brought back from the dead as if you were a member of your previous creature type. You gain DR 10/piercing.</p>"}},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Shaitan": {
                "name": "Shaitan",
                "type": "Bloodlines",
                "description": "<p>You were born with the power of earth genies, and the magic of the shaitans is strong in you.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (planes).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>true strike (3rd), glitterdust (5th), greater magic weapon (7th), stoneskin (9th), wall of stone (11th), wall of iron (13th), plane shift (15th), iron body (17th), wish (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell that deals energy damage, you can change the type of damage to acid. This effect also changes the spell's descriptors to match this energy type.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Like a shaitan, you have both natural power over earth, and several other genie-based abilities.</p>"},
                "Acid Ray": {"name": "Acid Ray", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Elemental Resistance": {"name": "Elemental Resistance", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain acid resistance 10. At 9th level, your acid resistance increases to 20.</p>"},
                "Avalanche": {"name": "Avalanche", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, whenever you hit a single target with a spell that deals damage, you may make a bull rush check as a swift action. Your CMB for this maneuver is equal to your sorcerer caster level + your Charisma bonus. You can make this maneuver even if the target is not in melee range, and you do not provoke an attack of opportunity for making this maneuver. If the target is in contact with earth, stone, or rock, you gain a +4 bonus on your CMB check.</p>"},
                "Elemental Movement": {"name": "Elemental Movement", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you gain a burrow speed of 30 feet.</p>"},
                "Power of the Shaitan": {"name": "Power of the Shaitan", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words “I wish,” and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.</p><p>You become immune to acid damage, and can use plane shift once per day to travel to or from the Plane of Earth.</p>"},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Aquatic": {
                "name": "Aquatic",
                "type": "Bloodlines",
                "description": "<p>Your family traces its heritage back to the ocean depths, whether scions of undersea empires left in the wake of nomadic sea-tribes, or the spawn of creeping ichthyic infiltrators into remote seaside villages. The song of the sea hums in your blood, calling the waves and all those within to your command.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Swim.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>hydraulic push* (3rd), slipstream* (5th), aqueous orb* (7th), geyser* (9th), control water (11th), beast shape IV (13th), summon monster VII (15th), seamantle* (17th), world wave* (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Athletic, Brew Potion, Defensive Combat Training, Dodge, Mobility, Silent Spell, Skill Focus (Swim), Toughness.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the water type, your effective caster level is increased by one, and summoned creatures with a swim speed or the aquatic or water type gain a +1 morale bonus on attack and damage rolls.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your seaborn magical talents awaken changes in you, both mystical and physical, as you develop your powers.</p>",
                "Dehydrating Touch": {"name": "Dehydrating Touch", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can make a melee touch attack as a standard action that inflicts 1d6 points of nonlethal damage + 1 for every two sorcerer levels you possess and sickens the target for 1 round. Oozes, plants, and creatures with the aquatic or water subtypes suffer lethal damage instead. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Aquatic Adaptation": {"name": "Aquatic Adaptation", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain a swim speed of 30 feet. At 9th level, you gain the amphibious special quality and develop a fat layer that grants a +1 natural armor bonus and resist cold 5. When immersed in water, you gain blindsense 30 feet. At 15th level, you gain a swim speed of 60 feet and blindsense of 60 feet in water.</p>"},
                "Aquatic Telepathy": {"name": "Aquatic Telepathy", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you gain telepathy (100 feet) and can communicate with creatures with a swim speed or the aquatic or water types regardless of intelligence. You may cast suggestion on such creatures a number of times per day equal to your Charisma modifier. This ability is telepathic and does not require audible or visual components. At 15th level, once per day you can telepathically call and request a service from an aquatic, water, or swimming creature as if using demand or greater planar ally.</p>"},
                "Raise the Deep": {"name": "Raise the Deep", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you raise water as per control water, but no water need be present. This created water is stationary and does not flow out of the area where you create it; it lasts 1 round per sorcerer level and then disappears. At 20th level, the dimensions of the effect are doubled. You may use this ability once per day.</p>"},
                "Deep One": {"name": "Deep One", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, you gain blindsense 60 feet and your body is covered with fine, slippery scales granting DR 10/piercing, resist cold 20, and continuous freedom of movement. Underwater, you gain evasion and blindsight 120 feet, and you are immune to pressure damage from deep water.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Boreal": {
                "name": "Boreal",
                "type": "Bloodlines",
                "description": "<p>Descended from inhabitants of the lands of ice and snow, you count among your ancestors giant-kin, troll-born, and frost-rimed spirits. Their savage and raw energies flow down through generations to infuse you to the marrow with the chill of the polar wind, crackling auroras, and the long winter's night.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Survival.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>enlarge person (3rd), rage (5th), elemental aura* (cold only) (7th), wall of ice (9th), cone of cold (11th), transformation (13th), giant form I (15th), polar ray (17th), meteor swarm (dealing cold damage) (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Arcane Strike, Diehard, Empower Spell, Endurance, Exotic Weapon Proficiency, Power Attack, Skill Focus (Intimidate), Toughness.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with the cold descriptor, increase the spell's save DC by 1.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your connection to primeval winters grants you a mastery of cold magic that few can match, and a savagery that fewer still can withstand.</p>",
                "Cold Steel": {"name": "Cold Steel", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can touch a weapon or up to 50 pieces of ammunition as a standard action, giving it the frost property for a number of rounds equal to 1/2 your sorcerer level (minimum 1). At 9th level, you can confer the icy burst property instead, but the duration of the power is halved. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Icewalker": {"name": "Icewalker", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain resist cold 5 and can move across snow and icy surfaces without penalty and without leaving tracks. At 9th level, you gain resist cold 10 and can climb icy surfaces as if using spider climb.</p>"},
                "Snow Shroud": {"name": "Snow Shroud", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you ignore concealment and Perception penalties in natural or magical snow, ice, fog, and similar weather conditions. In addition, you can surround yourself with a cloak of swirling snow for a number of rounds per day equal to your sorcerer level. This power acts and deals damage as a fire shield (chill shield) that sheds no light. It provides a 20% miss chance on attacks made against you and grants a bonus on Stealth checks equal to 1/2 your sorcerer level in snowy or icy areas. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th.</p>"},
                "Blizzard": {"name": "Blizzard", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you can create a savage winter storm centered on you. This power acts as control winds, but in addition the entire area (not including the “eye” at the center of the storm) is affected as a sleet storm and all in the area are exposed to extreme cold. You may use this ability once per day.</p>"},
                "Child of Ancient Winters": {"name": "Child of Ancient Winters", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you gain the cold subtype and you become immune to fatigue and exhaustion. In addition, you gain immunity to sneak attacks and critical hits. This power causes you to gain vulnerability to fire.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Deepearth": {
                "name": "Deepearth",
                "type": "Bloodlines",
                "description": "<p>The echoing cave-songs and the rumble and creak of primal spirits deep below the ground thrum in your soul and in all your family line. You are likely slow, steady, and stable in your thinking, little prone to wandering and preferring to instead find depth in contemplation.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (dungeoneering).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>expeditious excavation* (3rd), darkvision (5th), shifting sand* (7th), stoneskin (9th), spike stones (11th), stone tell (13th), repel metal or stone (15th), earthquake (17th), clashing rocks* (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Acrobatic Steps, Alertness, Blind-Fight, Forge Ring, Nimble Moves, Skill Focus (Perception), Stealthy, Still Spell.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you and the target of your spell are both underground, increase the spell's save DC by +1.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The powers of the living rock are within you, and your communion with the strength of stone is refined and enhanced as your power grows.</p>",
                "Tremor": {"name": "Tremor", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, as a standard action, you can cause the ground to shake beneath a single creature within 30 feet, functioning as a trip maneuver using your sorcerer level plus your Charisma modifier in place of your CMB. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Rockseer": {"name": "Rockseer", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 3rd level, you gain the stonecunning trait as a dwarf; if already a dwarf, your bonus improves to +4. At 9th level, you gain tremorsense 30 feet. At 15th level, you can see through solid objects as if using a ring of x-ray vision for a number of rounds per day equal to your sorcerer level. These rounds do not need to be consecutive.</p>"},
                "Crystal Shard": {"name": "Crystal Shard", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can touch a metal or stone weapon (or up to 50 pieces of ammunition) as a standard action, giving it the bane property against any creature with the earth subtype, oozes, or constructs made of stone or metal, for 1 minute. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th.</p>"},
                "Earth Glide": {"name": "Earth Glide", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 15th level, you can glide through any sort of natural earth or stone as easily as a fish swims through water, with a burrow speed equal to half your normal speed. You do not leave a tunnel or trace of your passage. You can use this ability for 1 minute per sorcerer level each day. The duration need not be continuous, but it must be used in 1-minute increments.</p>"},
                "Strength of Stone": {"name": "Strength of Stone", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, your flesh becomes as hard as stone, giving you DR 10/adamantine, and you become immune to petrification. You suffer no penalties while squeezing through tight spaces and are immune to bull rush, drag, grapple, reposition, and trip maneuvers, and to push and pull effects as long as you are standing on the ground.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Dreamspun": {
                "name": "Dreamspun",
                "type": "Bloodlines",
                "description": "<p>Your family is a long line of dreamers, who dream not as ordinary mortals do but rather as those who reach through and touch the supernal realm of dreams and the farthest shores of night. Whether it is a gift or curse is not always clear, but your visions of the past and future call you ineluctably to a life of adventure.</p>",
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>sleep (3rd), augury (5th), deep slumber (7th), divination (9th), dream (11th), shadow walk (13th), vision (15th), moment of prescience (17th), astral projection (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Alertness, Blind-Fight, Combat Expertise, Deceitful, Heighten Spell, Improved Feint, Persuasive, Skill Focus (Sense Motive).</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you target a single creature with a spell, you gain an insight bonus equal to half the spell's level (minimum +1) for 1 round to your AC and saving throws against any spell or attack made by that creature.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You reach out into and through the world of dreams to touch the minds and destinies of those around you.</p>",
                "Lullaby": {"name": "Lullaby", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can use lullaby as a spell-like ability a number of times per day equal to 3 + your Charisma modifier. This effect lasts for 1 minute and does not require concentration. The penalty on saves versus sleep effects increases to –4.</p>"},
                "Combat Precognition": {"name": "Combat Precognition", "type": "Bloodline Power", "featureType": "Su", "description": "<p>Your insight into the future grants you an advantage in combat. At 3rd level and every 4 levels thereafter, you gain a +1 insight bonus on initiative checks.</p>"},
                "Dreamshaper": {"name": "Dreamshaper", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can manipulate the dreamscape of others, drawing forth or tampering with their subconscious minds. This power allows you to tamper with the target's memories as if using modify memory, or you may ask questions as if using speak with dead upon a corpse. A successful Will save negates the effect. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier, with further modifiers as the nightmare spell. You can use this ability once per day at 9th level. At 17th level you can use this ability twice per day, and at 20th, three times per day.</p>"},
                "Eye of Somnus": {"name": "Eye of Somnus", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you can project your consciousness as if using arcane eye. In addition, at any point you can cause the arcane eye to become visible. The eye can no longer be moved, but it acts as a symbol of sleep to all who see it. You may use this power once per day.</p>"},
                "Solipsism": {"name": "Solipsism", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, you can drift into the dream world, fading from the world around you. You can become incorporeal for 1 minute per sorcerer level. You gain the incorporeal subtype and take only half damage from corporeal magical attacks (you take no damage from nonmagical weapons and objects). Your spells deal only half damage to corporeal creatures, but spells and abilities that do not deal damage function normally. The duration need not be continuous, but it must be used in 1-minute increments.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Protean": {
                "name": "Protean",
                "type": "Bloodlines",
                "description": "<p>You have in your veins the ever-changing wildness of primal chaos, the raw essence of unbound creation. Your mind and spirit burst with the constant inspiration of consummate freedom, though you have difficulty following through on a task when another, new and exciting, catches your interest.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (planes).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>entropic shield (3rd), blur (5th), gaseous form (7th), confusion (9th), major creation (11th), disintegrate (13th), greater polymorph (15th), polymorph any object (17th), shapechange (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Agile Maneuvers, Defensive Combat Training, Enlarge Spell, Great Fortitude, Improved Great Fortitude, Skill Focus (Craft [any]), Spell Focus, Toughness.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Your magic of creation and changing is hard to unravel. The DC to dispel transmutation or conjuration (creation) spells that you cast is increased by +4.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your ancestral immersion in primordial chaos begets your curiously warped magical talents.</p>",
                "Protoplasm": {"name": "Protoplasm", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can create a ball of entropic protoplasm and hurl it at targets within 30 feet. This protoplasm acts as a tanglefoot bag that also inflicts 1 point of acid damage per round to a creature entangled by it. The protoplasm dissolves within 1d3 rounds. You may use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Protean Resistances": {"name": "Protean Resistances", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain resist acid 5 and a +2 bonus on saving throws against polymorph, petrification, and transmutation spells or effects. At 9th level, you gain resist acid 10 and your save bonus increases to +4.</p>"},
                "Reality Wrinkle": {"name": "Reality Wrinkle", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can surround yourself with a mobile, 10-foot-radius emanation of mutable reality. This rippling distortion is similar to solid fog but does not provide concealment or block line of sight. Your movement is not slowed by this aura. Attacks from outside the aura suffer a 20% miss chance against targets inside the aura. You may use this ability a number of rounds per day equal to your sorcerer level, though this duration need not be continuous.</p>"},
                "Spatial Tear": {"name": "Spatial Tear", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, once per day, you can unravel the fibers of reality and ride along them as they snap back into place. This power functions as dimension door, while also creating a mass of black tentacles centered on your former location. Both of these effects use your sorcerer level as the caster level. At 20th level, you can use this ability twice per day.</p>"},
                "Avatar of Chaos": {"name": "Avatar of Chaos", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, you are infused with the essence of raw chaos. You gain immunity to acid, petrification, and polymorph effects (except when cast on self), as well as a +2 bonus to save DCs and on checks to overcome spell penetration against creatures with the lawful subtype.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Serpentine": {
                "name": "Serpentine",
                "type": "Bloodlines",
                "description": "<p>Your bloodline carries the lingering stain of ancient serpent races that ruled when the world was young; your forebears were likely favored slaves anointed by their reptilian masters and gifted with their cold cunning and subtle manipulation. While deception and a mesmeric charm are your birthright, you may struggle for truth in spite of your heritage.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Diplomacy.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>hypnotism (3rd), delay poison (5th), summon monster III (reptiles only) (7th), poison (9th), hold monster (11th), mass suggestion (13th), summon monster VII (reptiles only) (15th), irresistible dance (17th), dominate monster (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Combat Casting, Combat Reflexes, Deceitful, Deft Hands, Persuasive, Silent Spell, Skill Focus (Bluff), Stealthy.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Your powers of compulsion can affect even bestial creatures. Whenever you cast a mind-affecting or language-dependent spell, it affects animals, magical beasts, and monstrous humanoids as if they were humanoids who understood your language.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The treacherous and yet hypnotic serpent's blood that flows through you taints your magic with a sinuous and seductive grace.</p>",
                "Serpent's Fang": {"name": "Serpent's Fang", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 1st level, you can grow fangs as a free action. These fangs are treated as a natural weapon inflicting 1d4 points of damage plus your Strength modifier (1d3 if you are Small) plus poison (Bite—injury; save Fort DC 10 + 1/2 your sorcerer level + your Constitution modifier; frequency 1/round for 6 rounds; effect 1 Con damage; cure 1 save). At 5th level, these fangs are considered magical for the purpose of overcoming DR and the poison damage increases to 1d2 Con. At 7th level, your poison requires 2 successful saves to cure. At 11th level, your poison damage increases to 1d4 Con. You can use your fangs for a number of rounds per day equal to 3 + your Charisma modifier.</p>"},
                "Serpentfriend": {"name": "Serpentfriend", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you can use speak with animals at will with reptilian animals (including various forms of dinosaurs, lizards, and other cold-blooded creatures), and you gain a viper familiar using your sorcerer level –2 as your effective wizard level.</p>"},
                "Snakeskin": {"name": "Snakeskin", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 9th level, you gain a +1 bonus to natural armor, a +2 racial bonus on saves against poison, and a +2 bonus on Escape Artist checks. At 13th level and 17th level, these bonuses increase by +1.</p>"},
                "Den of Vipers": {"name": "Den of Vipers", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you may summon a host of writhing serpents. This power acts as creeping doom, but the swarms' poison inflicts Con damage and any creature other than you sharing a space with a swarm is entangled.</p>"},
                "Scaled Soul": {"name": "Scaled Soul", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you gain the shapechanger subtype, and you can assume the form of a reptilian humanoid (as alter self) or snake of Diminutive to Huge size (as beast shape III) at will. You retain the power of speech and the ability to use somatic spell components when transformed. You also become immune to poison and paralysis. You may use serpent's fang as often as desired, and you may choose to inflict damage to any ability score.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Shadow": {
                "name": "Shadow",
                "type": "Bloodlines",
                "description": "<p>Spirits from the shadow plane dally at times in the world of light, and such as these lay with your ancestors once upon a time, imparting the mystery of shadow-stuff into your lineage. You are often sullen and withdrawn, preferring to skulk at the fringes of social circles and keep to yourself, cultivating an air of mystery and majesty that is all your own.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Stealth.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>ray of enfeeblement (3rd), darkvision (5th), deeper darkness (7th), shadow conjuration (9th), shadow evocation (11th), shadow walk (13th), power word blind (15th), greater shadow evocation (17th), shades (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Acrobatic, Blind-Fight, Dodge, Quick Draw, Silent Spell, Skill Focus (Stealth), Stealthy, Weapon Finesse.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with the darkness descriptor or the shadow subschool, you gain a circumstance bonus on Stealth checks equal to the spell's level for 1d4 rounds.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your benighted heritage infuses your mastery of magic with the essence of shadowstuff.</p>",
                "Shadowstrike": {"name": "Shadowstrike", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can make a melee touch attack as a standard action that inflicts 1d4 points of nonlethal damage + 1 for every two sorcerer levels you possess. In addition, the target is dazzled for 1 minute. Creatures with low-light vision or darkvision are not dazzled by this ability. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Nighteye": {"name": "Nighteye", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain darkvision 30 feet. At 9th level, you gain darkvision 60 feet. If you already possess darkvision, its range is increased by these amounts.</p>"},
                "Shadow Well": {"name": "Shadow Well", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can use the Stealth skill even while being observed and without cover or concealment, as long as you are within 10 feet of a shadow other than your own. In addition, when within an area of darkness or dim light, as a standard action you may choose to switch places with a willing ally within 60 feet, who must also be in darkness or dim light. At 13th level, you can instead switch the positions of two willing allies, each of whom must be within 60 feet of you. Unless otherwise noted, this travel is identical to dimension door. You may use the ability to switch places once per day at 9th level, plus one additional time per day at 17th level and 20th level.</p>"},
                "Enveloping Darkness": {"name": "Enveloping Darkness", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, you may create an area of deeper darkness that you can see through without penalty. All creatures except you are entangled within this darkness unless using freedom of movement or a similar effect. You may use this ability once per day.</p>"},
                "Shadow Master": {"name": "Shadow Master", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you can see perfectly in natural or magical darkness. When you use shadow conjuration or shadow evocation spells, your creations are 20% more real, and any creatures you create gain the benefits of the Augment Summoning feat.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Starsoul": {
                "name": "Starsoul",
                "type": "Bloodlines",
                "description": "<p>You come from a line of stargazers and explorers who delved deeply into the darkness beyond the stars. In touching the void, the void touched them, and your mind, spirit, and body yearn to span the gulf between worlds.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (nature).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>unseen servant (3rd), glitterdust (5th), blink (7th), call lightning storm (9th; dealing fire damage, damage increased outdoors at night), overland flight (11th), repulsion (13th), reverse gravity (15th), greater prying eyes (17th), meteor swarm (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Blind-Fight, Craft Rod, Dodge, Endurance, Improved Counterspell, Improved Iron Will, Iron Will, Quicken Spell, Skill Focus (Perception), Toughness.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast an evocation spell, targets that fail their saves are dazzled by tiny sparkling starlights for 1 round per level of the spell.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your skyward gaze and communion with the heavens focus and enhance your magical talents.</p>",
                "Minute Meteors": {"name": "Minute Meteors", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can summon a rain of tiny meteorites as a standard action to fall in a 5-foot column, 30 feet high, with a range of 30 feet. The meteors inflict 1d4 points of fire damage + 1 per 2 sorcerer levels. A Reflex save negates this damage. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You may use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Voidwalker": {"name": "Voidwalker", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain low-light vision and resist cold and fire 5. At 9th level, you no longer need to breathe, as if wearing a necklace of adaptation.</p>"},
                "Aurora Borealis": {"name": "Aurora Borealis", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can create a sheet of cascading colors. This power acts as a wall of fire, but it inflicts cold damage and does not radiate heat. However, one side of the aurora designated by you fascinates creatures within 10 feet, up to a maximum of 2 HD of creatures per sorcerer level. A Will save negates this fascinate effect. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You may use this ability for a number of rounds per day equal to your sorcerer level. These rounds do not need to be consecutive.</p>"},
                "Breaching the Gulf": {"name": "Breaching the Gulf", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, your caster level is increased by 3 when casting spells of the teleportation subschool. In addition, once per day you can teleport a single creature within 30 feet into the void of space if it fails a Will save. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The target can attempt a new saving throw as a full-round action each round to return. While trapped in the airless void, the target takes 6d6 points of cold damage per round and must hold its breath or begin to suffocate.</p>"},
                "Starborn": {"name": "Starborn", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, you gain immunity to cold and blindness, and you can see perfectly in natural or magical darkness. In addition, you gain fast healing 1 when you are outdoors at night.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Stormborn": {
                "name": "Stormborn",
                "type": "Bloodlines",
                "description": "<p>You trace your heritage to fierce and proud spirits of storm and sky, and living lightning sings in your veins.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (nature).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>shocking grasp (3rd), gust of wind (5th), lightning bolt (7th), shout (9th), overland flight (11th), chain lightning (13th), control weather (15th), whirlwind (17th), storm of vengeance (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Deadly Aim, Dodge, Enlarge Spell, Far Shot, Great Fortitude, Point Blank Shot, Skill Focus (Fly), Wind Stance.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with the electricity or sonic descriptor, increase the save DC by 1.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your mastery of the storm is reflected in the unique panoply of powers you manifest.</p>",
                "Thunderstaff": {"name": "Thunderstaff", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, you can touch a weapon as a standard action, giving it the shock property for a number of rounds equal to 1/2 your sorcerer level (minimum 1). At 9th level, you can confer the shocking burst property instead, but the duration of the power is halved. You can use this ability a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Stormchild": {"name": "Stormchild", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you gain resist electricity 5 and resist sonic 5, and treat wind effects as being one step less severe. At 9th level, you treat wind effects as being two steps less severe and gain blindsense 60 feet against concealment from natural or magical fog, mist, or weather effects.</p>"},
                "Thunderbolt": {"name": "Thunderbolt", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can command a stroke of lightning to strike from above in a 5-foot-radius cylinder 60 feet high. The thunderbolt inflicts 1d6 points of damage per sorcerer level; half of this damage is electricity and half is sonic. A Reflex save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) halves this damage. Creatures failing their saves are deafened for 1 round. At 9th level, you can use this ability once per day, at 17th twice per day, and at 20th three times per day. This power has a range of 120 feet.</p>"},
                "Ride the Lightning": {"name": "Ride the Lightning", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 15th level, as a full-round action you can become a living lightning bolt and move in a straight line up to 10 times your speed. You do not provoke attacks of opportunity while moving in this way. Creatures or objects in your path are affected as by your thunderbolt power. Creatures do not block your movement but solid barriers do unless they are reduced to 0 hit points. You can use this power once per day for a number of rounds equal to your sorcerer level.</p>"},
                "Storm Lord": {"name": "Storm Lord", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, you are one with the storm. You gain immunity to deafness, stunning, and wind effects and gain blindsight 120 feet against concealment from natural or magical fog, mist, or weather. Once per day, when attacked with an electricity or sonic effect, you may forgo your saving throw and absorb the energies of the attack, healing 1 point of damage for every 3 points of damage the attack would otherwise have dealt.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Verdant": {
                "name": "Verdant",
                "type": "Bloodlines",
                "description": "<pYour progenitors infused themselves with raw plant life, binding it into their own tissue and passing it down to their literal seed, giving you innate communion with nature.></p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Knowledge (nature).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>entangle (3rd), barkskin (5th), speak with plants (7th), command plants (9th), wall of thorns (11th), transport via plants (13th), plant shape III (15th), animate plants (17th), shambler (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Acrobatic Steps, Craft Staff, Endurance, Extend Spell, Fleet, Nimble Moves, Skill Focus (Knowledge [nature]), Toughness.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with a range of personal, your skin toughens, granting you a natural armor bonus equal to the spell's level for 1d4 rounds. This bonus does not stack with any other natural armor bonuses you might have.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The power of living things infuses every aspect of your magic, as you draw power from nature and its life energies flow through you.</p>",
                "Tanglevine": {"name": "Tanglevine", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, as a standard action, you can create a 15-foot-long, animated vine that springs from your hand. This vine lasts for 1 round and can be used to make a single disarm, steal, or trip combat maneuver, using your sorcerer level plus your Charisma modifier in place of your normal CMB. You can use this power a number of times per day equal to 3 + your Charisma modifier.</p>"},
                "Photosynthesis": {"name": "Photosynthesis", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you feed upon nature's raw essence. Your need to eat and sleep is reduced as if wearing a ring of sustenance, and you gain a +2 racial bonus on saving throws made against poison and sleep effects. At 9th level, these bonuses increase to +4.</p>"},
                "Massmorph": {"name": "Massmorph", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, as a full-round action, you can alter the size and health of plant life, as if using plant growth or diminish plants. Alternatively, you can transform one willing non-plant creature per sorcerer level (no two of which can be more than 30 feet apart) as tree shape. You may transform creatures as plant shape I at 15th level, or plant shape II at 20th level. You can transform non-plant creatures using this power once per day.</p>"},
                "Rooting": {"name": "Rooting", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 15th level, as a move action, you can extend roots into the ground. Your speed is reduced to 5 feet, but you gain a +4 bonus to natural armor and a +10 bonus to CMD against bull rush, overrun, reposition, and trip maneuvers. You also gain tremorsense 30 feet and fast healing 1. You can use this power for a number of minutes per day equal to your sorcerer level. This duration need not be consecutive, but it must be used in 1-minute increments.</p>"},
                "Shepherd of the Trees": {"name": "Shepherd of the Trees", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, your verdant heritage fully manifests. You gain a +4 natural armor bonus. You gain immunity to paralysis, poison, polymorph, sleep, and stunning, and you gain tremorsense 30 feet even when not rooted.</p>"}},
                "source": {
                    "name": "Advanced Player's Guide",
                    "date": "2010-09-01"
                }
            },
            "Kobold Sorcerer": {
                "name": "Kobold Sorcerer",
                "type": "Archetype",
                "description": "<p>While many kobold sorcerers tout their purely draconic bloodline, over generations of eldritch training, some such spellcasters have created a bloodline that, while tinged with some draconic magic, is the embodiment of the race's virtue distilled into arcane form. Many practitioners of this bloodline go on to lead powerful kobold tribes.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Disable Device.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>alarm (3rd), create pit (5th), explosive runes (7th), dragon's breath (9th), transmute rock to mud (11th), guards and wards (13th), delayed blast fireball (15th), form of the dragon III (17th), imprisonment (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Alertness, Combat Casting, Defensive Combat Training, Dodge, Improved Initiative, Lightning Reflexes, Silent Spell.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell against a creature that is denied its Dexterity bonus to AC, increase that spell's DC by +2.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Like all kobolds, you have a natural talent for ambushing, creating traps, and mining. As your power increases, you discover ever more useful ways to blend your magic with these instinctive talents.</p>",
                "Trap Rune": {"name": "Trap Rune", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, as a standard action, you can sketch a single, nearly invisible magical rune on any 5-foot-square solid surface. When you create a rune, pick one of the following energy types: acid, cold, electricity, or fire. While the rune is active, the next creature other than you who steps on or touches the rune's area causes the rune to explode. The rune's explosion deals a number of points of energy damage equal to 1d8 + 1 per sorcerer level you possess to anything in its square. A Reflex saving throw halves the damage (DC 10 + 1/2 your sorcerer level + your Charisma modifier). The rune is considered a magical trap for the purpose of perceiving it or disabling it. The DC for both Perception and Disable Device checks is the same as the Reflex saving throw to halve the damage. You can use this ability a number of times per day equal to 3 + your Charisma modifier. Each rune lasts for 24 hours or until discharged.</p>"},
                "Trap Sense": {"name": "Trap Sense", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 3rd level, you develop a sixth sense that helps you avoid traps. You gain a +2 bonus on Perception checks made to notice traps. You also gain a +1 bonus on Reflex saves to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses increase by +1 at 7th level and for every four sorcerer levels you gain thereafter (to a maximum of +5 at 19th level). This bonus stacks with that provided by a rogue's trap sense and similar abilities.</p>"},
                "Arcane Ambush": {"name": "Arcane Ambush", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, as a swift action, you can expend a spell slot in order to grant you and your allies a bonus on attack and damage rolls. This bonus lasts 1 round, is equal to the level of the spell expended, and only applies to opponents your allies are flanking or opponents denied their Dexterity bonus against your allies. You grant this bonus to yourself plus up to one ally for every four sorcerer levels you possess (to a maximum of five allies at 20th level). The allies must be within 30 feet of you and you must have line of effect to each affected ally.</p>"},
                "Earth Glide": {"name": "Earth Glide", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you gain the earth glide universal monster ability with a speed equal to your base speed. This does not give you the ability to breathe while passing through earth, so you must hold your breath or use some alternate method to breathe while using this ability.</p>"},
                "Nimble Walker": {"name": "Nimble Walker", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 20th level, you gain a +5 racial bonus on Reflex saving throws and on Acrobatics checks made to move through a creature's threatened area or through its space. You also gain the ability to breathe while passing through earth using your earth glide ability.</p>"}},
                "requirements": [
                    {
                        "race": "Kobold"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            },
            "Imperious": {
                "name": "Imperious",
                "type": "Bloodline",
                "description": "<p>A scion of forgotten kings, with a lineage rich with the dust of ancient empires spanning every golden age of humanity's history, an imperious embodies the apex of human potential, as well as human temerity and uninhibited hubris.</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>Perform (oratory).</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>moment of greatness , eagle's splendor (5th), heroism (7th), threefold aspect (9th), greater command (11th), pure strain (13th), greater age resistance, prediction of failure , overwhelming presence (19th).</p>"},
                "Bonus Feats": {"name": "Bonus Feats", "type": "Class Feature", "description": "<p>Diehard, Endurance, Heroic Defiance, Heroic Recovery, Improved Initiative, Lingering Spell, Magical Aptitude, Persuasive.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a harmful spell, you gain a bonus equal to the spell's level on Intimidate checks made against any creature adversely effected by that spell until the end of your next turn. Adversely effected typically means damage, but it can also mean debilitating effects or conditions.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You draw upon ancestors both legendary and forgotten.</p>",
                "Student of Humanity": {"name": "Student of Humanity", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 1st level, you gain Diplomacy, Knowledge (history), Knowledge (local), Knowledge (nobility), and Linguistics as class skills. In addition, when using these skills to learn, study, or gather information about humans, you add an insight bonus equal to your Charisma bonus on such checks.</p>"},
                "Heroic Echo": {"name": "Heroic Echo", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 3rd level, when you receive a morale bonus from any spell, spell-like ability, or magic item, including those you cast on yourself, that bonus increases by +1. At 9th level, this ability also applies to competence bonuses. If you receive a morale effect (or a competence effect at 9th level) that affects an area or multiple targets, as an immediate action you can share your increased bonus with all other recipients. This increase to other participants lasts a number of rounds equal to your Charisma bonus. You can use this ability once per day, plus one time per three levels after 3rd.</p>"},
                "Take Your Best Shot": {"name": "Take Your Best Shot", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, if you are targeted by a harmful spell, spell-like ability, or supernatural ability and suffer no harm from it, whether because of a successful saving throw, spell resistance, the attack missing, or some other protection, as an immediate action you can make an Intimidate check to demoralize the creature that produced the effect, but only if the creature that used the harmful effect is within 30 feet and can clearly see and hear you.</p><p>At 13th level, you can use this ability after succeeding at a saving throw to reduce the effects of an attack (if no save is allowed, you cannot use this ability).</p>"},
                "Heroic Legends": {"name": "Heroic Legends", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you may inspire greatness or inspire heroics as a bard of your sorcerer level by sacrificing a spell slot as a swift or move action. The effect lasts a number of rounds equal to the sacrificed spell's level; this duration is doubled for human recipients.</p>"},
                "Immortal Legend": {"name": "Immortal Legend", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 20th level, you cease aging; no longer need to eat, drink, or sleep; and gain immunity to death effects and energy drain.</p>"}},
                "requirements": [
                    {
                        "race": "Human"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            },
            "Crossblooded": {
                "name": "Crossblooded",
                "type": "Archetype",
                "description": "<p>A crossblooded bloodline combines the powers of two distinct heritages. In most cases, sorcerers with this bloodline are the offspring of two sorcerers from different ancestries, but occasionally a crossblooded sorcerer arises from the conjunction of other powers. A draconic sorcerer who is also the culmination of a great destiny, an abyssal sorcerer from a family that dealt with devils, and an arcane sorcerer raised from birth by fey are all possible sources for crossblooded bloodlines.</p><p>A crossblooded sorcerer selects two different bloodlines. The sorcerer may gain access to the skills, feats, and some of the powers of both bloodlines she is descended from, but at the cost of reduced mental clarity and choice (see Drawbacks).</p>",
                "Class Skill": {"name": "Class Skill", "type": "Class Feature", "description": "<p>A crossblooded sorcerer receives the bonus class skill from both of her bloodlines. If these are the same skill, this does not grant any additional benefit.</p>"},
                "Bonus Spells": {"name": "Bonus Spells", "type": "Class Feature", "description": "<p>A crossblooded sorcerer may select her bonus spells from either of her bloodlines. The sorcerer also has the choice to learn a lower-level bonus spell she did not choose in place of the higher-level bonus spell she would normally gain. Lower-level bonus spells learned this way always use the spell level that they would be if the sorcerer had learned them with the appropriate bonus spell.</p>"},
                "Example": {"name": "Example", "type": "Class Feature", "description": "<p>A 3rd-level aberrant/abyssal crossblooded sorcerer has the choice of learning cause fear or enlarge person as her bloodline bonus spell. If she selected cause fear as her 3rd-level bonus spell, at 5th level she could use her new bonus spell to learn enlarge person instead of bull's strength or see invisibility, and she would add it to her list of 1st-level spells known (just as if she had learned it as her 3rd-level bonus spell).</p>"},
                "Bonus Feat": {"name": "Bonus Feat", "type": "Class Feature", "description": "<p>A crossblooded sorcerer combines the bonus feat lists from both of her bloodlines and may select her bloodline bonus feats from this combined list.</p>"},
                "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>A crossblooded sorcerer gains the bloodline arcana of both her bloodlines.</p>"},
                "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>At 1st, 3rd, 9th, 15th, and 20th levels, a crossblooded sorcerer gains one of the two new bloodline powers available to her at that level. She may instead select a lower-level bloodline power she did not choose in place of one of these higher-level powers.</p>"},
                "Drawbacks": {"name": "Drawbacks", "type": "Class Feature", "description": "<p>A crossblooded sorcerer has one fewer spell known at each level (including cantrips) than is presented on the sorcerer spells known table. Furthermore, the conflicting urges created by the divergent nature of the crossblooded sorcerer's dual heritage forces her to constantly take some mental effort just to remain focused on her current situation and needs. This leaves her with less mental resolve to deal with external threats. A crossblooded sorcerer always takes a –2 penalty on Will saves.</p>"},
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Wildblooded": {
                "name": "Wildblooded",
                "type": "Archetype",
                "description": "<p>A wildblooded sorcerer has a mutated version of a more common bloodline, with one arcana and at least one bloodline power that are different from those of an unmutated bloodline. When creating a wildblooded sorcerer, select an existing bloodline, then select one of the following mutated bloodlines associated with that bloodline. Use the normal bloodline's class skill, bonus spells, and bonus feats, and the mutated bloodline's bloodline arcana. Use the normal bloodline's bloodline powers, except when the mutated bloodline replaces one of those powers.</p>",
                "Anarchic": {
                    "name": "Anarchic",
                    "type": "Bloodlines",
                    "description": "<p>Your magical power taps into pure anarchy.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Protean.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you fail a concentration check to cast a spell, a cantrip effect is created. Randomly determine one of your cantrips known (for example, if you know 6 cantrips, roll 1d6). There is a 50% chance this cantrip affects a target of your choice within 60 feet; otherwise it affects you.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Raw magical energy lashes out when you destroy or negate hostile spells.</p>",
                    "Wild Feedback": {"name": "Wild Feedback", "type": "Class Feature", "featureType": "Su", "description": "<p>At 3rd level, when you successfully dispel or counterspell an opponent's spell, the caster (if it is within 100 feet) takes 1d6 points of damage +1 per level of the spell affected. This bloodline power replaces protean resistances.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Aerial": {
                    "name": "Aerial",
                    "type": "Bloodlines",
                    "description": "<p>Your magic is more focused on the power of air and rain than on lightning and thunder.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Stormborn.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever outdoors during any form of precipitation, your effective caster level is increased by 2.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The greatest storms bring ruin through wind, not electricity.</p>",
                    "Windcaller": {"name": "Windcaller", "type": "Class Feature", "featureType": "Sp", "description": "<p>At 9th level, you can call the winds to obey your commands for 1 minute per level. This functions like control winds, except that you may choose to be immune to any increased wind effects you create. The ability's duration does not need to be consecutive, but it must be used in 1-minute increments. This bloodline power replaces thunderbolt.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Bedrock": {
                    "name": "Bedrock",
                    "type": "Bloodlines",
                    "description": "<p>Your earth magic is more defensive than offensive.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Deep Earth.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/adamantine equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Rock is timeless; it endures.</p>",
                    "Iron Hide": {"name": "Iron Hide", "type": "Class Feature", "featureType": "Sp", "description": "<p>At 9th level, as a swift action, you can grant yourself DR 10/adamantine for a number of rounds per day equal to your sorcerer level. The rounds do not need to be used consecutively. This bloodline power replaces crystal shard.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Brutal": {
                    "name": "Brutal",
                    "type": "Bloodlines",
                    "description": "<p>The powers of the Abyss can vary radically, even for similar fiends.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Abyssal.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell that deals hit point damage, one target of your choice affected by the spell takes 2 additional hit points of damage. This ability has no effect on spells that do not deal hit point damage (such as ability score damage).</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Flight is often the key to survival.</p>",
                    "Wings of the Abyss": {"name": "Wings of the Abyss", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, you can sprout leathery wings and fly for a number of minutes per day equal to your sorcerer level, with a speed of 60 feet and good maneuverability. This duration does not need to be consecutive, but it must be used in 1-minute increments. This bloodline power replaces strength of the abyss.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Empyreal": {
                    "name": "Empyreal",
                    "type": "Bloodlines",
                    "description": "<p>Your heavenly power derives from insight rather than force of personality.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Celestial.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Unlike most sorcerers whose innate magic is powered by force of personality, you use pure willpower to master and fuel your magic. You use your Wisdom, rather than your Charisma, to determine all class features and effects relating to your sorcerer class, such as bonus spells per day, maximum spell level you can cast, and the save DCs of your spells. You gain a +2 bonus on all Heal and Knowledge (religion) checks.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your quasi-divine nature gives you strange powers.</p>",
                    "Sacred Cistern": {"name": "Sacred Cistern", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, your bloodline makes you a natural receptacle of divine energy. You can channel energy once per day as a cleric of your sorcerer level – 4. This bloodline power replaces wings of heaven.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Envenomed": {
                    "name": "Envenomed",
                    "type": "Bloodlines",
                    "description": "<p>The ophidian source of your bloodline has more to do with stealth and assassination than it does with leadership and alliances.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Serpentine.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>You gain a +2 bonus on Acrobatics, Climb, and Stealth checks.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The stink of poison taints your magic.</p>",
                    "Envenom": {"name": "Envenom", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 3rd level, as a swift action, you can lick or bite a melee weapon to imbue it with 1 dose of black adder venom. The poison's DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You may use this ability once per day at 3rd level, and one additional time per day for every three additional levels. The poison cannot be removed or stored, and the weapon loses the benefit of the poison after the first successful attack or 1 hour has passed. The bloodline power replaces serpentfriend.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Groveborn": {
                    "name": "Groveborn",
                    "type": "Bloodlines",
                    "description": "<p>Some plant magic is more green, while some is more brown, like hardwood.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Verdant.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Your powers of compulsion can affect even plant creatures. Whenever you cast a mind-affecting or language-dependent spell, it affects creatures of the plant type as if they were humanoids that understood your language.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your nature powers create tough, resilient minions.</p>",
                    "Lush Summoning": {"name": "Lush Summoning", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 3rd level, whenever you summon creatures with a conjuration (summoning) spell, you can decide that they appear green and leafy. The natural armor bonus of such creatures is increased by +2, and they gain a +4 bonus on saves against paralysis, poison, polymorph, sleep, and stunning. This bloodline power replaces photosynthesis.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Karmic": {
                    "name": "Karmic",
                    "type": "Bloodlines",
                    "description": "<p>The universe punishes those who interfere with destiny.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Destined.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>If you are casting defensively because a creature is threatening you and you fail your concentration check, one of the creatures that is threatening you provokes an attack of opportunity from you or from one ally who is adjacent to the enemy. You decide which creature provokes this attack and which of its adjacent opponents may make the attack.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your blood responds angrily when you are attacked.</p>",
                    "Fate's Retribution": {"name": "Fate's Retribution", "type": "Bloodline Power", "featureType": "Su", "description": "<p>Starting at 1st level, when you are hit by a melee attack, as an immediate action, you can curse the creature that struck you. The target takes a –2 penalty on all attack and damage rolls for 1d4 rounds. A Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) negates this effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier. This bloodline power replaces touch of destiny.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Linnorm": {
                    "name": "Linnorm",
                    "type": "Bloodlines",
                    "description": "<p>Your draconic heritage stems from a mighty, primordial linnorm rather than from the more common, somewhat civilized dragons.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Draconic.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with an energy descriptor that matches your linnorm bloodline's energy type, you gain a natural armor bonus equal to the spell's level for 1d4 rounds.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>True dragons blast their foes with rays of energy.</p>",
                    "Elemental Spit": {"name": "Elemental Spit", "type": "Bloodline Power", "featureType": "Su", "description": "<p>Starting at 1st level, you can fire an elemental ray that matches your linnorm bloodline's energy type as a standard action, targeting any foe within 30 feet as a ranged touch attack. The ray deals 1d6 points of damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier. This bloodline power replaces claws.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Pit-Touched": {
                    "name": "Pit-Touched",
                    "type": "Bloodlines",
                    "description": "<p>Your diabolic corruption is from a source in the deepest parts of Hell.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Infernal.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell, you gain a bonus on Intimidate checks equal to the spell's level for 1 round.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>The crushing weight of evil has given you the strength to endure.</p>",
                    "Tough as Hell": {"name": "Tough as Hell", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>At 9th level, you gain a +2 inherent bonus to your Constitution. This bonus increases to +4 at 13th level, and to +6 at 17th level. This bloodline power replaces hellfire.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Primal": {
                    "name": "Primal",
                    "type": "Bloodlines",
                    "description": "<p>Your powers are attuned to the concentrated core of the elemental plane.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Elemental.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with an energy descriptor that matches your elemental bloodline's energy type, that spell deals +1 point of damage per die rolled.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You can infuse raw energy into your summoned minions.</p>",
                    "Elementalist Summoning": {"name": "Elementalist Summoning", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 9th level, whenever you summon a creature, it gains energy resistance 10 against the energy type that matches your elemental bloodline (if it already has such resistance, its resistance increases by +5), and its natural attacks deal an additional 1d6 points of damage of the same energy type. This bloodline power replaces elemental blast.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Rime-Blooded": {
                    "name": "Rime-Blooded",
                    "type": "Bloodlines",
                    "description": "<p>The wintry origin of your magic flows like ice water in your veins.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Boreal.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell with the cold descriptor, you may select one target of the spell to be slowed (as the spell) for 1 round. A Fortitude save (DC 10 + the level of cold spell + your Charisma modifier) negates the effect.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Sometimes you must bring the cold to your enemies.</p>",
                    "Freezing Bolt": {"name": "Freezing Bolt", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can cause the air to erupt in freezing sleet. This 10-foot-radius burst does 1d6 points of cold damage per sorcerer level (Reflex half). The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet. This bloodline power replaces snow shroud.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Sage": {
                    "name": "Sage",
                    "type": "Bloodlines",
                    "description": "<p>Scholars of the arcane are always creating new means to use magic.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Arcane.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Unlike most sorcerers, whose innate magic is powered by force of personality, you use your intellect to understand and master your mystic powers. You use your Intelligence, rather than your Charisma, to determine all class features and effects relating to your sorcerer class, such as bonus spells per day, the maximum spell level you can cast, the save DCs of your spells, and the number of daily uses of your bloodline powers. You gain a +2 bonus on all Knowledge (arcana) and Spellcraft checks.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your preferred focus is a bolt of mind-spun magic.</p>",
                    "Arcane Bolt": {"name": "Arcane Bolt", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you can unleash a ray of magic force as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d4 points of damage + 1 for every two sorcerer levels you possess. This damage is treated as a spell of a level equal to half your sorcerer level, and is a force effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier. This bloodline power replaces arcane bond.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Sanguine": {
                    "name": "Sanguine",
                    "type": "Bloodlines",
                    "description": "<p>The power of undeath can derive from cold blood as well as hard bone.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Undead.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the necromancy school, your effective caster level is increased by 1.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your magic emulates that of the hungry dead.</p>",
                    "The Blood Is the Life": {"name": "The Blood Is the Life", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 1st level, you can gain sustenance from the blood of the recently dead. As a standard action, you can drink the blood of a creature that died within the past minute. The creature must be corporeal, must be at least the same size as you, and must have blood. This ability heals you 1d6 hit points and nourishes you as if you'd had a full meal. You may use this ability a number of times per day equal to 3 + your Charisma modifier. This bloodline power replaces grave touch.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Seaborn": {
                    "name": "Seaborn",
                    "type": "Bloodlines",
                    "description": "<p>Your powers rise like the tides</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Aquatic.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>When you are in a body of water large enough to float in, your effective caster level is increased by 1.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>You prefer to attack with water rather than to leech it away.</p>",
                    "Water Blast": {"name": "Water Blast", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>As a standard action, you can fire a bolt of water at a foe within 30 feet as a ranged touch attack. The foe is knocked prone, and at your option may be pushed 5 feet directly away from you. A reflex save (DC 10 +1/2 your sorcerer level + your Charisma modifier) negates this effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier. This bloodline power replaces dehydrating touch.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Sylvan": {
                    "name": "Sylvan",
                    "type": "Bloodlines",
                    "description": "<p>Your ties to nature have more to do with creatures than with capriciousness.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Fey.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>See bloodline powers.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your magic shows a kinship to that of the beast-talkers and shapechanger fey.</p>",
                    "Animal Companion": {"name": "Animal Companion", "type": "Bloodline Power", "featureType": "Ex", "description": "<p>You gain an animal companion. Your effective druid level for this ability is equal to your sorcerer level – 3 (minimum 1st). This bloodline power counts as your bloodline arcana and also replaces laughing touch.</p>"},
                    "Fey Wings": {"name": "Fey Wings", "type": "Bloodline Power", "featureType": "Su", "description": "<p>At 15th level, you can grow insectlike wings from your back and become one size category smaller (as if you had used reduce person), gaining a fly speed of 60 feet with average maneuverability. You can maintain this form for 1 minute per level. This duration does not need to be consecutive, but it must be used in 1-minute increments. This bloodline power replaces fey magic.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Umbral": {
                    "name": "Umbral",
                    "type": "Bloodlines",
                    "description": "<p>Your nature is to gather the darkness into yourself.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Shadow.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell in an area of dim light or darkness, your effective caster level is increased by 1.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your shadow magic is more defensive than offensive.</p>",
                    "Cloak of Shadows": {"name": "Cloak of Shadows", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 1st level, as a standard action, you can grant one target a cloak of shadows. This cloak gives the target a bonus on Stealth checks made in areas of dim or no light equal to 1/2 your sorcerer level for 1 round per 2 sorcerer levels you possess (minimum +1 bonus for 1 round). You may use this ability a number of times per day equal to 3 + your Charisma modifier. This bloodline power replaces shadowstrike.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Visionary": {
                    "name": "Visionary",
                    "type": "Bloodlines",
                    "description": "<p>Your dream-magic strongly influences the waking world.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Dreamspun.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Though you can still only regain spells once per day, you need only a single hour of sleep prior to doing so. (You still risk fatigue as normal if you don't receive enough rest.)</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your dreams hint at the future.</p>",
                    "Visions": {"name": "Visions", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, when you sleep, you can gain information through prophetic visions. Once per day when sleeping, you may gain information about actions taken in the next week as if you had cast a divination spell. You can gain information about a single question at 9th level. At 17th level, you can have two questions answered while you sleep, and at 20th level, three questions. This bloodline power replaces dreamshaper.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Void-Touched": {
                    "name": "Void-Touched",
                    "type": "Bloodlines",
                    "description": "<p>The darkness between the stars calls to you.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Starsoul.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast an evocation spell, you may select one affected target that fails its save to suffer the choking airlessness of the void, silencing it (as silence, but affecting only the target) for 1 round. This is a supernatural ability.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your magic is blacker than any night.</p>",
                    "Black Motes": {"name": "Black Motes", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>This ability works exactly like (and replaces) minute meteors, except it deals cold damage.</p>"},
                    "Voidfield": {"name": "Voidfield", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>At 9th level, you can create an area influenced by the black void. This ability acts as an ice storm, except the area is also subject to deeper darkness for 1 round per four sorcerer levels. You may use this ability once per day at 3rd level, and one additional time per day for every three additional levels. The bloodline power replaces aurora borealis.</p>"}},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "Warped": {
                    "name": "Warped",
                    "type": "Bloodlines",
                    "description": "<p>The alien taint in your blood causes malformations and mutations in others.</p>",
                    "Associated Bloodline": {"name": "Associated Bloodline", "type": "Class Feature", "description": "<p>Aberrant.</p>"},
                    "Bloodline Arcana": {"name": "Bloodline Arcana", "type": "Class Feature", "description": "<p>Whenever you cast a spell of the polymorph subschool, one target of your choice may receive one random effect from the Warped Polymorph Benefits table (see below). This bonus lasts as long as the polymorph effect on the target.</p>"},
                    "Bloodline Powers": {"name": "Bloodline Powers", "type": "Class Feature", "description": "<p>Your strange blood brings out the worst in people.</p>"},
                    "Warp Touch": {"name": "Warp Touch", "type": "Bloodline Power", "featureType": "Sp", "description": "<p>Starting at 1st level, you create brief, disorienting changes in a creature's physical form. This ability affects one creature within 30 feet, which is dazed for 1 round (Fortitude negates; DC 10 + 1/2 your sorcerer level + your Charisma modifier). You can use this ability a number of times per day equal to 3 + your Charisma modifier. This bloodline power replaces acidic ray.</p><table><caption>Warped Polymorph Benefits</caption><tr><td>d12</td><td>Effect</td></th><tr><td>1</td><td>Double-Jointed: +2 on Escape Artist checks.</td></tr><tr><td>2</td><td>Webbed Digits: +2 on Swim checks.</td></tr><tr><td>3</td><td>Iron Grip: +2 on Climb checks and to CMD against disarm maneuvers.</td></tr><tr><td>4</td><td>Bug Eyes: +2 on Perception checks.</td></tr><tr><td>5</td><td>Camouflage: +2 on Stealthchecks.</td></tr><tr><td>6</td><td>Tough Hide: +1 natural armor bonus.</td></tr><tr><td>7</td><td>Hardy: +1 on Fortitude saving throws.</td></tr><tr><td>8</td><td>Lively: +1 on Reflex saving throws.</td></tr><tr><td>9</td><td>Astute: +1 on Will saves.</td></tr><tr><td>10</td><td>Quick: +5 ft. movement rate.</td></tr><tr><td>11</td><td>Vicious: +1 on melee attack rolls.</td></tr><tr><td>12</td><td>Eagle Eyes: +1 on ranged attack rolls.</td></tr></table>"},
                    "source": {
                        "name": "Ultimate Magic",
                        "date": "2011-04-01"
                    }
                },
                "source": {
                    "name": "Ultimate Magic",
                    "date": "2011-04-01"
                }
            },
            "Wishcrafter": {
                "name": "Wishcrafter",
                "type": "Archetype",
                "description": "<p>Wishcrafters are born with a talent for manipulating reality inherited from their efreeti ancestors. However, like the genies they are descended from, wishcrafters can only draw upon this power to fulfill the desires of others. A wishcrafter has the following class features.</p>",
                "Wishbound Arcana": {"name": "Wishbound Arcana", "type": "Class Feature", "featureType": "Su", "description": "<p>At 1st level, the wishcrafter can use the wishes of non-genie creatures other than herself in place of the normal verbal components of her spells. A creature can make a wish as a free action at any time, even during the wishcrafter's turn. The wishcrafter must be able to hear and understand a wish in order to use it as a spell component. A spell that doesn't normally have a verbal component gains one when cast using this ability. A wish doesn't need to mention the name of a specific spell, but must describe an outcome that can be accomplished by casting a spell the wishcrafter knows (for example, wishing to be bigger could supply the verbal component for enlarge person). A wishcrafter gains a +1 bonus to her caster level when using a creature's wish as a verbal component in this manner, but cannot include herself as a target of such spells. She can be affected by such a spell if it affects an area rather than a target or targets. A wishcrafter is under no compulsion to grant a creature's wish. Once the wishcrafter grants a creature's wish using this ability, she cannot use this ability to grant that creature any further wishes for 24 hours. This ability replaces bloodline arcana.</p>"},
                "Expanded Wishcraft": {"name": "Expanded Wishcraft", "type": "Class Feature", "description": "<p>At 3rd level and every 2 levels thereafter, the wishcrafter grows more adept at altering reality to fit the whims of others. She may add an additional spell selected from the sorcerer/wizard spell list to her list of spells known. This spell must be one level lower than the highest-level spell she can cast. A wishcrafter can only use these spells in conjunction with her wishbound arcana ability. For example, if she used this ability to learn cat's grace, she can only cast it when another creature wishes for it, and can't cast it on herself because it is a targeted spell. She cannot use these spells to craft or recharge magic items. These bonus spells replace the bloodline spells gained by the sorcerer's bloodline.</p>"},
                "Heart's Desire": {"name": "Heart's Desire", "type": "Class Feature", "featureType": "Su", "description": "<p>At 7th level, as a swift action, a wishcrafter can force a single creature within 30 feet to confess its deepest desire. The target receives a Will save to negate this effect (DC 10 + 1/2 the wishcrafter's level + the wishcrafter's Charisma modifier). On a failed save, the creature must immediately wish aloud in a clear voice for something it truly desires, allowing the wishcrafter to activate her wishbound arcana ability if she knows a spell that can fulfill that wish. This is a mind-affecting effect. Regardless of whether the save is successful, a creature cannot be the target of the same wishcrafter's heart's desire ability again for 24 hours. The wishcrafter can use this ability a number of times per day equal to her Charisma bonus. This ability replaces the bloodline bonus feat gained at 7th level.</p>"},
                "Twisted Wish": {"name": "Twisted Wish", "type": "Class Feature", "featureType": "Su", "description": "<p>At 13th level, a wishcrafter becomes adept at corrupting wishes to negatively affect the creature that wished them. When a wishcrafter affects a creature with a spell using its wish as a spell component, she may twist the wish, applying a –4 penalty to the creature's saving throws against the spell. The effects of wishes twisted this way are difficult to remove; the DC of caster level checks to dispel them increases by 5. This ability replaces the bloodline bonus feat gained at 13th level.</p>"},
                "Perfect Wishcraft": {"name": "Perfect Wishcraft", "type": "Class Feature", "featureType": "Su", "description": "<p>At 19th level, the wishcrafter perfects her ability to manipulate reality. Once per day, she may cast any spell on the sorcerer/wizard spell list as if it were on her list of spells known. Using this ability otherwise has all of the benefits and limitations of the wishbound arcana ability. This ability replaces the bloodline bonus feat gained at 19th level.</p>"},
                "requirements": [
                    {
                        "race": "Ifrits"
                    }
                ],
                "source": {
                    "name": "Advanced Race Guide",
                    "date": "2014-09-01"
                }
            }
        },
        "source": {
            "name": "Core Rulebook",
            "date": "2009-08-01"
        }
    }
}
